{"songs": [{"title": "“Our Dreams Were Bigger Than Our Fears” - Essay", "album": null, "year": null, "lyrics": "A bus. The yellow lighting of the gas station against the dark hours of midnight. Fast asleep. Silence. My head slumped over my mom's shoulder. Her voice timid and hesitant as she stumbled through a sentence in English at the cash register. A Winnie the Pooh journal. These are the things I remember when I think of when my mom and I immigrated to America.\n\nI was almost 7 at the time, born in Havana, Cuba. My papá is puro Mexicano and we lived back and forth between the heat of Havana and the concrete jungle of Mexico City. I didn't realize it then, but, boy, does it hit me now. I realize how scary it must have been for them. For my mom to leave the streets of Havana where our neighbors were our friends, where we gathered every holiday to eat pork and my grandma's rice and beans, to not hear the malecón and the heartbeat of her city pulsing with every crash of the wave. For my Dad to leave behind his four brothers and sisters, the memory of his parents, the street vendors selling the elotes con mayonesa that I would beg him to get in the mornings before school, the best friends he'd grown up with . . . everything. To decide to start from the ground up.\n\nWith a couple hundred dollars, the clothes on our backs, no family in the United States, and no clue of what was going to happen next, that's exactly what we did. Like my mom said, \"I don't know where I'm going, but I can't stay here.\" And that was enough.\n\nWhy were we packing up our stuff? Why was my grandma hugging me tighter than usual? Where were we going? \"We're going to Disney World!\" That's what my Mom told me when we were crossing the border. She packed a little backpack with my Winnie the Pooh journal and my doll, and we crossed the border from Mexico to the US, seeing my Dad become an ant in the distance as he stayed behind.\n\nJust Disney World. Whenever I have to make a decision now and I'm afraid, my mom always reminds me of that day. \"That day, I knew if I thought about it, fear would make me turn back. That's why when you're afraid, you force yourself to jump. You don't think, you just jump,\" she says to me.\n\nAfter she sat down with the immigration officer in a tiny office, we and a bunch of people from other countries with similar hopes were placed in rooms with tiny beds in them, a hotel full of these rooms. It was me and my mom and two other families in a little room waiting for somebody to come in and let us know if we were going to be granted permission to enter the US or be sent back. Some people spent days there, some spent weeks in agonizing anxiety over what the answer would be. Meanwhile, I was wondering when the heck we were going to get to Disney. We were there only a day when we finally got the news. The room bursted with joy, everybody around me clapping and hugging and screaming and crying! And me yelling out \"Yay! We're all going to Disney!\" Little did I know.\n\nLittle me and my mamá ended up on a Greyhound bus to Miami that took 36 hours — that's where I have my most vivid memories. Other stuff I vaguely remember and know from stories my parents told me years after. But I remember writing in my Winnie the Pooh journal a lot on that bus ride.\n\nWe got to Miami and moved into my grandpa's colleague's house who later became my godmother. My mom was a very good architect in Cuba, but when she came to America none of the degrees she earned in Cuba counted, so to make enough to keep us fed and put me into school she began stacking shoes in Marshalls and going to school at night to take courses in English, all while taking me to and from school and helping me with my homework all by herself, alone in a strange country. I can't imagine how frustrating it must have been for her to have worked her whole life in architecture and then have it all erased when she came here.\n\nOne day, as if God was listening, two elderly Cuban women were conversing with her and told her: \"Oye, tu estás muy bonita para trabajar en Marshalls. Where are you from?\" My mom told her the story of how she was Cuban and she was actually an architect. You wouldn't believe it, but the two Cuban women said they had a brother who worked in architecture and needed someone who worked in Autocad, a complicated architectural computer program. They asked her: \"Do you know Autocad?\" Internally, my mom was like \"Autocad? What the hell is Autocad? We use pencil and paper where I'm from.\" But to the ladies, she said: \"Autocad? Of course. Yes, of course. I can do that.\" She learned how to use the program in a week and made enough to move us out of my godmother's house and into an apartment.\n\nShe learned fast because she literally had to in order to survive. Immigrants have one thing in common: Hunger. I don't mean it literally, although that's true too, but metaphorically. The hunger to do the impossible because you have no choice, because you came too damn far, because you've known what struggling is, and you're not going to take an opportunity for granted. The hunger and ability to win above people with better circumstances than you simply because you want it badly enough.\n\nLong story short, my papá came over from Mexico a year and a half later — I had a little calendar in my room counting down the days — because he couldn't stand being away from us. He went through such hardship to cross the Mexican border and had it harder than my mom and I did, literally risking his life for his family to physically make it here. When he first came to the US, he started off washing cars in front of Dolphin Mall in the blistering Miami heat. But we kept moving on up . . . with the Latin community in Miami, helping each other up as we did it. Slowly and slowly my parents kept working and climbing and ended up forming a construction company together named after my sister and I. They always pushed me to focus on my studies because the whole reason we came here was so my sister and I could have better opportunities in life than they did. They said: \"Money comes and goes, but your education, lo que tienes aquí (and they would point to my head while saying that), nobody can ever take that away from you.\" They let me know that in order to go a good college I had to get a scholarship, so I worked as hard as I could. However — plot twist! — that didn't quite go the way we thought it would.\n\nYou see, in 9th grade, a little girl who had never sung in front of people before asked her parents if they could take her to Greensboro, NC, to audition for a little show called The X Factor. Yikes! I had never sang in front of people before. Well, did my mom know Autocad? No. Did I know how to perform on a stage on TV? No. But I wanted it badly enough, and I learned from my family that if you work hard enough and you want it badly enough, you can do the impossible.\n\nI was wrong about one thing. My mamá and papá did not leave everything behind, they brought it with them. My grandma still makes pork and rice and beans every holiday like she did, and my mom still feels the waves of the malecón in her heartbeat because she still feels the most at peace when she's by the sea. My grandma and dad still get drunk and sing Luis Miguel in the kitchen. We found our favorite Taco spot in Miami (I capitalized Taco because they are that good). And whenever we find another person from our country, we freak out. \"¿De qué parte?\" Because we have home in us. Because we brought it with us. Every Cuban brought it with them and so we have Miami. Mexicans brought it and so we have the best Mexican food ever. The Italians brought it and so we have pizza. The Swedish brought it and we have great pop songs. The list goes on and on. And so, that's why when I hear a bigoted, racist man with power and influence speak with anger and ill-will about immigrants, I think \"what a fool.\"\n\nI am so proud to be Cuban-Mexican. This country was built on immigrants. People who were brave enough to start over. How strong we are to leave behind everything we know in hopes of something better. We are not fearless, we just have dreams bigger than our fears. We jump. We run. We swim, we move mountains, we do whatever it takes. And so next time, when anybody wants to tell you they want to build a \"wall\" on our border, remember behind that wall is struggle, determination, hunger. Behind that wall, could be the next cure for cancer, the next scientist, the next artist, the next drummer, the next anything they work hard enough to become!\n\nP.S. I did end up going to Disney for the first time a year later.", "image": "https://images.genius.com/8e36e8a08d0973f3e63e126e80ee9d56.675x645x1.jpg"}], "artist": "Camila Cabello"}