{"songs": [{"title": "What Do I Know About Love?", "album": null, "year": "2019-08-31", "lyrics": "What do I know about love?\nNothing\nWhere does the love go when it runs out? When does it leave? Why does it die?\nDo you kill it in one violent blow?\nOr is it a million unattended, unhealed little cuts and scratches?\nWhat do I know about love?\nEverything\nIt creeps into my chest, uninvited and untameable\nI know love has no mercy on anyone, rich, poor, independent codependent, confident, insecure\nIt'll bring you to your knees - if you did it right\nWhat I know for sure about love is that you never come out of it the same\nThe other person is a chemical and I am a chemical and we both will come out as different people than when we met\nI know when you're in love, kissing is everything\nBecause words aren't the only way to tell someone how you feel\nI know when you fall in love you feel like you're the first and only two people in the world\nEvery kiss, every touch, every caress is like something you feel nobody has ever felt before\nAnd you think - has everybody that's fallen in love before just walked around this nonchalantly the whole time?\nYou're at a restaurant with your friends and you can feel it, this\nsecret under your tongue\nBurning like fire\nBut sweet\nAnd it creeps up to your cheeks and makes you smile\nAnd suddenly you look down and you see your heart's veins reaching, reaching, clinging to someone else's heart\nI've learned a lot about love in my 20s, but not enough to maintain any control in the face of its power\nAnd for every new thing I learned, there was something else I couldn't understand\nAll I know is love changes you\nIf you're lucky, to something better\nWhat I know for sure is falling in love with life itself makes an artist out of everyone\nI thought I was making art before\nWriting songs was me making art but...\nNow I want my life to be the work of art\nAnd my songwriting to be the camera that I take a picture of it with\nIt's what I'm living\nThat's the art\nWhat do I know about love?\nMaybe nothing\nAnd that's why it's everything", "image": "https://images.genius.com/c74b97a034e030eb675599b1930c75fc.960x960x1.jpg"}], "artist": "Camila Cabello"}