{"songs": [{"title": "I Would", "album": "Take Me Home", "year": "2012-11-09", "lyrics": "[Verse 1: Liam & Harry]\nLately I found myself thinking, been dreaming about you a lot\nAnd up in my head I’m your boyfriend, but that’s one thing you’ve already got\nHe drives to school every morning while I walk alone in the rain\nHe’d kill me without any warning if he took a look in my brain\n\n[Chorus: Zayn & All]\nWould he say he’s in L-O-V-E?\nWell if it was me then I would, I would\nWould he hold you when you’re feeling low?\nBaby you should know that I would, I would\nWould he say he’s in L-O-V-E?\nWell if it was me then I would, I would\nWould he hold you when you’re feeling low?\nBaby you should know that I would\n\n[Verse 2: Niall & Louis]\nBack in my head we were kissing, I thought things were going alright\nWith a sign on my back saying \"Kick me,\" reality ruined my life (Go Tommo, go!)\nFeels like I’m constantly playing a game that I’m destined to lose\n'Cause I can’t compete with your boyfriend, he’s got 27 tattoos\n\n[Chorus: Zayn & All]\nWould he say he’s in L-O-V-E?\nWell if it was me then I would, I would\nWould he hold you when you’re feeling low?\nBaby you should know that I would, I would\nWould he say he’s in L-O-V-E?\nWell if it was me then I would, I would\nWould he hold you when you’re feeling low?\nBaby you should know that I would\nI would\nI would\n\n[Bridge: Louis & Harry & Zayn]\nWould he please you? Would he kiss you?\nWould he treat you like I would? (I would)\nWould he touch you? Would he need you?\nWould he love you like I would?\nWould he say he’s in L-O-V-E?\nWell if it was me then I would\nWould he hold you when you’re feeling low?\nBaby you should know that I would\n\n[Chorus: Louis & & Zayn All]\nWould he please you? (Would he please you?) Would he kiss you? (Would he kiss you?)\nWould he treat you like I would? (Like I would)\nWould he touch you? (Would he touch you?) Would he need you? (Would he need you?)\nWould he love you like I would? (Like I would)\nWould he say he’s in L-O-V-E?\nWell if it was me then I would (I would)\nWould he hold you when you’re feeling low?\nBaby you should know that I would, I would, yeah, I would, yeah", "image": "https://images.rapgenius.com/f6290727688efe6e612b9b87f337cfdd.1000x1000x1.jpg"}], "artist": "One Direction"}