{"songs": [{"title": "Truly Madly Deeply", "album": "Take Me Home", "year": "2012-11-09", "lyrics": "[Verse 1: Liam & Niall]\nAm I sleep, am I awake or somewhere in between?\nI can’t believe that you are here and lying next to me\nOr did I dream that we were perfectly entwined?\nLike branches on a tree, or twigs caught on a vine\nLike all those days and weeks and months I tried to steal a kiss\nAnd all those sleepless nights and daydreams where I pictured this\nI’m just the underdog who finally got the girl\nAnd I am not ashamed to tell it to the world\n\n[Chorus: Harry & Louis]\nTruly, madly, deeply I am, foolishly, completely falling\nAnd somehow you kicked all my walls in\nSo baby say you’ll always keep me\nTruly, madly, crazy, deeply in love with you, in love with you\n\n[Verse 2: Liam & Zayn]\nShould I put coffee and granola on a tray in bed\nAnd wake you up with all the words that I still haven’t said?\nAnd tender touches just to show you how I feel\nOr should I act so cool, like it was no big deal?\nWish I could freeze this moment in a frame and stay like this\nI’ll put this day back on replay and keep reliving it\n'Cause here’s the tragic truth, if you don’t feel the same\nMy heart would fall apart if someone said your name\n\n[Chorus: All]\nTruly, madly, deeply I am, foolishly, completely falling\nAnd somehow you kicked all my walls in\nSo baby say you’ll always keep me\nTruly, madly, crazy, deeply in love with you\n\n[Bridge: Louis]\nI hope I’m not a casualty\nI hope you won’t get up and leave\nMight not mean that much to you\nBut to me it’s everything, everything\n\n[Chorus: Zayn & All]\nTruly, madly, deeply I am, foolishly, completely falling\nAnd somehow you kicked all my walls in\nSo baby say you’ll always keep me\nTruly, madly, crazy, deeply in love with you, in love with you\nIn love with you, in love with you, with you", "image": "https://images.genius.com/df8465ca6cd82707b82f56ff661e4bb9.1000x1000x1.jpg"}], "artist": "One Direction"}