{"songs": [{"title": "Zayn and Louis - marijuana controversy", "album": null, "year": null, "lyrics": "Louis and Zayn leave the underground car park as they head to the stadium for the concert:\n\nMinder: Well we got a full chicken.. we can take this to Jamaica, we don’t have anything in Jamaica set up\n\nUnknown male: Are we allowed to talk contraband in this?\n\nLouis: Yes of course. That’s what it’s about... Where’s the lighter? Can anybody pass me a lighter please? I want to light up. You got a lighter?\n\nAfter much searching, Louis can be seen lighting up and heard coughing\n\nLouis: So here we are, leaving Peru. Joint lit. Happy days... What do you think Zayn? About that kind of content?\n\nZayn: I think it’s very controversial\n\nLouis sees a police motorbike rider escorting their convoy\n\nLouis: ‘That’s the police. That’s the po po... Nice. I’m trying to blow it into the camera. Smokescreen baby!... That’s just Zayn warming up there before the show. Zayn takes his job very seriously. He makes sure he goes through a two-hour intense warm up regime before every show, just to get himself in the zone. One very, very important factor to Zayn’s warm up, of course is Mary Jane herself. In fact I’m presenting it to him now for some fantastic singing\n\nLouis passes Zayn the roll up cigarette\n\nLouis: How is it Zayn?\n\nZayn: Nice\n\nLouis: That’s the po po. One nil\n\nLouis starts filming out the window\n\nLouis: Get a bit of the culture. How’s that kind of culture?\n\nZayn: It’s great culture this. It’s going to be even greater culture when we get to Jamaica\n\nMember of crew: I just got an update. We got chicken in Chile\n\nZayn: Chicken in Chile! Chile chicken\n\nLouis: Yeh baby. That’s the po po. Two nil\n\nLouis puts on an exaggerated dopey voice and sways the camera around:\n\nLouis: Fucking ‘ell bro, I’m chillin. Oh my God bro. My ‘ed’s a wreck\n\nLouis: It’s green only! Nig!\n\nLouis: I’m just wondering now. I’m sitting here in Peru wondering will this come back to me? Who knows? Maybe, maybe not\n\nAnother police bike passes:\n\nLouis: One nil bitch! Look at this bitch... He’s having a look. He’s thinking. I’m sure I can smell an illegal substance in there. And he’s hit the nail on the head\n\nZayn: Carl showed... me Kid Rock’s last book. And it’s about twice the size. Hard back. Black. Simple writing. No bullshit.No like ‘My favourite colour’s blue.. And all just sick pictures\n\nLouis is passed the roll up by a crew member and zooms in on it:\n\nLouis: Ooo Stubbsy!\n\nZayn: “Every time you look in it you just think 'fuck I’ve never seen that picture.' That’s a bad photo...instead of boring crap.\n\nLouis: “Yeah I know, same old crap that I’m sure the fans are bored of reading.”\n\nZayn: \"They want to know what we're up to now man.\"\n\nTalking about the Kid Rock book Zayn says: “He’s smoking a J in one of the pictures Louis and he’s got a gold ring on his middle finger, which is a bid weird, but, aside from that he’s sticking his middle finger up with a J in his mouth, and that's one of the pictures in the book.\n\nLouis: “Sick.”", "image": "https://images.genius.com/e08cc1a9a96cb263a1b98aea2a3bfcc0.1000x1000x1.jpg"}], "artist": "One Direction"}