{"songs": [{"title": "Hermit the Frog (Mermaid vs Sailor Version)", "album": "Mermaid vs Sailor", "year": "2007-11-23", "lyrics": "[Intro]\nMmm-hmm\nOh, oh, oh, oh, oh\nOh, oh, mmm-hmm\n\n[Verse 1]\nYeah I feel I'm watered down\nWhenever he's around\nI put on the crown of clowns\nAnd melt slowly to the ground\n\n[Verse 2]\nYeah I feel it coming on\nWhen I've been static for too long\nAnd an explosion comes in time\nBefore I go and cross the line\nOh yeah, I go and cross the line\n\n[Verse 3]\nThink before you blurt (Jajajaja)\nOut the words you say to hurt\n'Cause next week you'll be\nOh, oh, oh-oh, oh, oh, oh, oh-oh, oh\n\n[Pre-Chorus 1]\nThey say, \"you used to be so kind\nI never knew you had such a dirty mind!\"\nWell, I went to the doctors believing\nThe devil had control over me and\nI was finding it hard to breath in\nFinding it hard to fight the feeling\n\n[Chorus]\nBut my heart just burst like a glass balloon\nAnd let it fly too high and it shattered too soon\nI was the wrong damn girl in the wrong damn room\nI broke my glass balloon\nI let go of my glass balloon\n\nOh, oh, oh, oh, oh! (Oh, oh, oh, oh, oh, oh)\n\n[Verse 4]\nThey call him Hermit the Frog\nHe's looking for a dog\nDid you find your bitch in me?\nOh you're abominable socially\nYou're just a little bit too much like me\n\n[Verse 5]\nThink before you blurt\nOut the words you say to hurt\n'Cause last week I was so, oh, oh-oh, oh, oh, oh\nBut now it'll be you, oh, oh-oh, oh\n\n[Pre-Chorus 2]\nSaid she used to be so kind\nWell baby I give you your dirty mind\nWell I, I wanna tell you a secret\nYou can take your double standard love and keep it\nI can't help the devil likes to make my heart a double bed\nAnd I can't help he sometimes likes to come and rest his little head\n\n[Chorus]\nWhen my heart just burst like a glass balloon\nWe let them fly too high and they shattered too soon\nAre we the wrong damn people in the wrong damn room?\nWe broke our glass balloons\nWe let go of their glass balloons\n\n[Outro]\nWe broke our glass balloon\nLet go of my glass balloon", "image": "https://images.genius.com/35e256907652ad53a9adc0ddbad4aed4.501x501x1.jpg"}], "artist": "MARINA"}