{"songs": [{"title": "Bad Kidz", "album": null, "year": "2010-01-31", "lyrics": "[Verse 1]\nWe came to an agreement, in good health\nThat if no one would take care of us\nWe'd be fine by ourselves\nIt was time to fuck the views\nOf those who don't deserve our spit\nWhy is it that we crave the praise\nFrom the people who least deserve it?\n\nIf you gave us a flower\nWe'd sit and we'd water it\nBut instead we watch you weave your webs\nAnd you wait for us to fly into it\n\nYou act like you're strong and\nWe all act like we're we-e-eak\nIf only you'd quit trying to cripple\nOur dancing fee-eet\n\n[Chorus 1]\nBad kids, bad ki-i-ids\nSlip through your hands like liquid\nBad kids, bad ki-i-ids\nVanish when you shut your eyelids\nThey'll vanish when you shut your eyeli-i-ids\n\n[Verse 2]\nThinking of it is painful, it's better to accept it all\nThinking of all the mothers and the daughters\nAnd the fathers and the sons\nWho are waiting for a call\nThat says, \"I didn't mean it\nI love you for who you a-a-are\nWhether you make it in this sick industry or not\nYou'll always be my special star.\"\n\nHe said\n\"If I became a pretty flower\nWould you sit and talk to me?\nOh my roots, my roots are getting old\nAnd I'm getting, I'm getting, I'm getting lonely, lonely!\"\n\nI'd play Superman, I'd make you feel safe\nSo why are you disappointed?\nEverything I did for you means nothing\nCause you turned out to be wicked\n\n[Chorus 2]\n\n[Verse 3]\nI'm the tangled ball of string\nI'm the criminal, you're the victim\nI am the cat, and you are the mouse\nAnd I am the milkmaid that killed all the cows\nSo, am I the oil to stain your skin?\nAm I the storm that sank your ship?\nNo, you are the horse, and I, the cart\nBut it's you, but it's you, but it's you\nIt's not me, it's not me, it's not me\nThat broke your heart\n\n[Outro]\nThat broke your heart\nThat broke your heart\nThat broke your heart\n\nAh-ah-ah!", "image": "https://images.genius.com/0488f4b6a6eaa454411e14a31e3ee80f.1000x1000x1.jpg"}], "artist": "MARINA"}