{"songs": [{"title": "You Need Me, I Don’t Need You (Live at the Bedford)", "album": "Live at the Bedford", "year": "2010-09-07", "lyrics": "[Verse 1]\nNow I'm in town, break it down, thinking of making a new sound\nPlaying a different show\nEvery night in front of a new crowd\nThat's new now, ciao, seems that life is great now\nSee me lose focus, as I sing to you loud\nAnd I can't, no, I won`t hush\nI'll say the words that make you blush\nI'm gonna sing this now\nSee, I'm true, my songs are where my heart is\nI'm like glue, I stick to other artists\nI'm not you, now that would be disastrous\nLet me sing and do my thing and move to greener pastures\nSee, I'm real, I do it all, it's all me\nI'm not fake, don't ever call me lazy\nI won't stay put, give me the chance to be free\nSuffolk sadly seems to sort of suffocate me\n\n[Chorus]\nCause you need me, I don't need you\nYou need me, man, I don't need you\nYou need me, man, I don't need you (at all)\nYou need me, man, I don't need you\nYou need me, man, I don't need you\nYou need me, man, I don't need you\nYou need me, man, I don't need you (at all)\nYou need me\n\n[Verse 2]\nI sing and write my own tune and I write my own verse, hell\nDon't need another word-smith to make my tune sell\nCall yourself a singer-writer you're just bluffing\nYour names on the credits and you didn't write nothing\nI sing fast, I know that all my shit's cool\nI will blast and I didn't go to Brit School\nI came fast with the way I act, right\nI can't last if I'm smoking on a crack pipe\nAnd I won't be a product of my genre\nMy mind will always be stronger than my songs are\nNever believe the bullshit that fake guys feed to ya\nAlways read the stories that you hear on Wikipedia\nAnd musically I'm demonstrating\nWhen I perform live, feels like I am meditating\nTimes at the Enterprise when some fella filmed me\nA young singer-writer like a Gabriella Cilmi\n\n[Chorus]\nCause you need me, man, I don't need you\nYou need me, man, I don't need you\nYou need me, man, I don't need you, (at all)\nYou need me, man, I don't need you\nYou need me, man, I don't need you\nYou need me, man, I don't need you\nYou need me, man, I don't need you, (at all)\nYou need me\n\n[Verse 3]\nAll I want in this cold world is to make music and use it\nNot to abuse it and get affected, infected with the who's who of music\nWho did it, who is it, who's in it or what the hell does it matter?\nChitter chatter, don't matter what a yidder, yidder, yadder, it don't matter to me\nAll I want is a bit of dignity in me to battle this industry freely\nTo be me in this seedy, needy world, can you hear me?\nHey, so I keep singing that\nWhen I first started this rapping shit I felt pressure from haters\nBecame invaded with sadists and just developed a hater radar\nAnd made for the stars, kept my grind in the dark\nAnd then appeared with a remedy kicking rhymes with a melody\nHennesey shots and... all these fools on the block\nWho said you gotta be a gangster now to raise to the top?\nI'm just a normal, casual, usual, everyday type of guy...\nMy head in the sky... Ready to die\nEd Sheeran, Alone Star\nComing out here freestyling with the guitar\nCause I've forgotten the lyrics of this bit right here\nSo I freestyle off the top of the bit with the...\n\n[Interlude: \"In Da Club\"]\nYou can find me in the club, bottle full of bub\nMummy I've got the X if you're into taking drugs\nInto having sex, I ain't into making love\nCome give me a hug if you're into getting rough\nYou can find me in the club, bottle full of bubbly\nMummy I've got the X if you're into taking drugs\nInto having sex, I ain't into making love\nCome give me a hug if you're into getting rough\n\n[Break]\nMy eyes are red, I've been burning, I've been burning\nMy eyes are red, I've been burning, I've been burning\nMy eyes are red I've been burning, I've been burning on a spliff off your high grade\nMy eyes are red I've been burning, I've been burning, burning, burning\n\n[Verse 4]\nNow where I come from burning weed it is a habit\nA big fat bag of high grade weed, you know I got to have it\nCos if I don't have it in my pocket I'm going to panic\nCos like I said where I come from weed smoking is a habit\nYup, we'll do da bun in the place up in the hood\nOne of them things I have inherited like a ghetto man should\nOne of them things is smoking weed it yes it makes me feel good\nBurning high grade sensimilla, yes it makes me feel\nBut me is a man, ah, talk about sensimilla is a drug\nAnd if I start to smoke it I'mma-nna turn into a thug\nWhere I come from that they talking could that only get you mugged\nWhere I come from burning weed it is a blessing from above\nWhere I come from yes we bun it when we listen rub a dub\nWhere I come from yes we bun after we just-a make a love\nWhere I come from yes we bun it when the sun starts shine\nI blaze high grade weed all the time!\nNow my eyes are red\n\n[Chorus]\nNow my eyes are red\nCause you need me, I don't need you\nYou need me man, my eyes are red\nYou need me man, I don't need you\nYou need me man, my eyes are red\nAnd you need me, I don't need you\nYou need me man, my eyes are red\nYou need me man, I don't need you\nYou need me man, I don't need you\n\n[Spoken]\nOkay so this is the breakdown bit where we get a little bit funky. Ugh, and I forget about the whole week, you forget about the whole week, the whole weekend. Just forget about everything! 'Cause it's Sunday and we're all gonna get drunk after this and have a very, very good time and I'm not stressed anymore. We're just letting it unwind. I wanna split the room in the middle here. Who's up for that? Not, not, not literally. You don't have to literally divide. It's all good, all good. Peace and love, peace and love and harmony. What was I gonna say? This side, up there, are you with me? This side, up there, are you with me? Everyone scream as loud as you can! (screaming) Okay, so we found out that everyone's voices work. This side, I'm not gonna insult you but you are West Ham, okay? You're West Ham, yeah? You're West Ham Football Club. Get in the geezer mode, yeah? This side, you're Millwall, yeah? You two, you two hate each other. You two are gonna beat each other at whatever you do, no matter what. So if I give you something to sing, you have to sing louder than them. If I give you something to sing, you have to sing louder than them. Are you all up for that? Millwall, are you ready? (yeah!) West Ham, are you ready? (yeah!) Okay, West Ham, you sing this...\n\nYou need me, man, I don't need you\nYou need me, man, I don't need you\nYou need me, man, I don't need you\n\nMillwall, you sing this:\nMy eyes are red!\nYou need me, man, I don't need you\nYou need me, man, my eyes are red!\nYou need me, man, I don't need you\nYou need me, man, (my eyes are red!)\n(You need me, man, I don't need you)\n(You need me, man, my eyes are red!)\nYou need me, man, I don't need you\nMillwall are winning I think\n\n[Verse 5]\nI seem to find myself talking to the powers that be\nAwaking the shade and shadowed under towering trees\nAdmiring the scene, inhaling fumes of flowers that breathe\nJet lagged eyes are begging for an hour to sleep\nAlthough my bloodshot whites and irises they never find any\nClock stops at times where the sun shine can blind many\nAlthough my eyes are heavy, they won't be closing soon\nCause I heard that time waits for nobody, I suppose it's true\nWe make corrosive tunes with acid tabs and vocal booths\nTo see the flashing lights at photo shoots, we make our motive moves\nI say whatever I feel to vent a rhyme\nSo I can still invent the lines and stay close to the friends of mine\nCause real recognise real is what my father says\nAnd I'll be sticking to this phrase until I pass away\nOverworking, no sleep is just another way to die slow\nBut I'll just keep going strong and never let my eyes close\n\nYou need me, man, I don't need you\nYou need me, man, I don't need you\nYou need me, man, I don't need you\n\n[Interlude]\nI got my friend, very good friend Random Impulse. He's gonna come up and he's gonna spit a few bars on the beat. Everyone give it up for Random Impulse!\n\n[Verse 6: Random Impulse]\nYo!\nIn this game, I am my own damn man, no restriction, post or boundaries\nSpouting heat, hungry and my circle always round to eat\nCrossing circles, counting thousands at a thousand feet\nCounting sheep and he's sound asleep\nSummoned from the deep, now I float, to sink my boat, you'll need a thousand fleets\nWalk on any beat and stomp it like a thousand feet\nTalk is cheap, so I could treat you to my words for free\nNow that I'm out, man, I ain't playing like I hurt my knee\nIt's common courtesy, I left you for a minute\nNow I'm back and packing punches like I'm Popeye popping spinach\nEating every course... lunch, I ain't forgotten dinners\nPlay guitars as well as bars so you ain't rocking with beginners\nSorry, time's ticking, I can't mess with up-and-comers\nNational lottery business, only winners have my numbers\nMan I'm nothing like you fronters, show you how it is\nI can't really do nothing for you 'less you got something to give, Ed!\n\n[Chorus]\nCause you need me, I don't need you\nYou need me man, my eyes are red\nYou need me man, I don't need you\nYou need me man, my eyes are red\nAnd you need me, I don't need you\nYou need me man, my eyes are red\nYou need me man, I don't need you\nYou need me\n\n[Verse 7]\nI'll keep my last name forever keep the genre pretty basic\nGonna be breaking into other peoples tunes when I chase it\nAnd replace it with the elephant in the room with a facelift\nInto another rappers shoes using new laces\nSelling CD's from my rucksack aiming for the papers\nSelling CD's from my rucksack aiming for the majors\nNationwide tour with just jack, still had to get the bus back\nClean cut kid without a razor for the mustache\nI hit back when the pen hurts me\nI'm still a choir boy in a Fenchurch tee\nI'm still the same as a year ago\nBut more people hear me though\nAccording to the MySpace and YouTube videos\nI'm always doing shows if I'm not I'm in the studio\nTruly broke, never growing up call me Ruffio\nMelody music maker\nReading all the papers\nThey say I'm up and coming like I'm fucking in an elevator\nLater!\nThank you... thank you so much! See you soon!", "image": "https://images.genius.com/301f6bdd0968cba37fcf18de23b60240.300x300x1.jpg"}], "artist": "Ed Sheeran"}