{"songs": [{"title": "Nina", "album": "× (Multiply)", "year": "2014-06-20", "lyrics": "[Verse 1]\nI met you when I was a teen but then you were one as well\nAnd I could play a guitar just like ringing a bell\nSometimes I wonder, in any other summer\nCould you have been my part time lover to me listening to Stevie Wonder?\nUnder the covers where we used to lay\nAnd RE: Stacks is what the speakers played\nI'd be on tour almost every day\nWhen I was home, up in my flat is where we used to stay\nJust watching a DVD, smoking illegal weed\nGetting high as two kites when we needed to breathe\nWe used each other's air just for the people to see\nAnd stay up all night like when we needed to sleep\nWe go anywhere, our minds would take us\nAnd I'll say you are beautiful without your make-up\nAnd you don’t even need to worry about your weight cause\nWe can all be loved the way that God made us\nAnd time's the only reason that we could break up\nCause you would always tell me I'm away too much\nDistance is relative to the time that it takes\nTo get on a plane or make a mistake, so say it again\n\n[Chorus]\nOh Nina\nYou should go, Nina\nCause I ain't never coming home, Nina\nOh, won't you leave me now?\nAnd I've been living on the road, Nina\nBut then again you should know, Nina\nCause that’s you and me both, Nina\nOh, won't you leave me now, now?\n\n[Verse 2]\nAnd every weekend in the winter you'd be wearing my hoodie\nWith drawstrings pulled tight to keep your face from the cold\nTaking day trips to the local where we'd eat on our own\nCause every day when I was away we'd only speak on the phone\nWatching Blue Planet, creating new habits\nActing as if we were two rabbits and then you'd vanish\nBack to the burrow with all the Celtics\nI disappear, you call me selfish\nI understand but I can’t help it\nI put my job over everything except my family and friends\nBut you'll be in between forever so I guess we'll have to take a step back\nOverlook the situation\nCause mixing business and feelings will only lead to complications\nAnd I'm not saying we should be taking a break\nJust re-evaluate quick before we make a mistake and it’s too late\nSo we can either deal with the pain or wait to get on a plane\nBut in a day we'll have to say it again\n\n[Chorus]\nOh Nina\nYou should go, Nina\nCause I ain't never coming home, Nina\nOh, won't you leave me now?\nAnd I've been living on the road, Nina\nBut then again you should know, Nina\nCause that’s you and me both, Nina\nOh, won't you leave me now, now?\n\n[Bridge]\nLove will come and love will go\nBut you can't make it on your own\nSing that song, go\nOh won't you leave me now?\nPeople grow and fall apart\nBut you can't mend your broken heart\nTake it back, go\nOh won't you leave me now?\n\n[Chorus (Extended)]\nOh Nina\nYou should go, Nina\n(Love will come and Love will go)\nCause I ain't never coming home, Nina\n(But you can make it on your own)\nOh, won't you leave me now?\n(Sing that song, go oh won't you leave me now)\nAnd I've been living on the road, Nina\n(People grow and fall apart)\nBut then again you should know, Nina\n(But you can mend your broken heart)\nCause that’s you and me both, Nina\n(Take it back, go oh won't you leave me now)\nOh, won't you leave me now, now?\nOh Nina\nYou should go, Nina\n(Love will come and Love will go)\nCause I ain't never coming home, Nina\n(But you can make it on your own)\nOh, won't you leave me now?\n(Sing that song, go oh won't you leave me now)\nAnd I've been living on the road, Nina\n(People grow and fall apart)\nBut then again you should know, Nina\n(But you can mend your broken heart)\nCause that’s you and me both, Nina\nOh, won't you leave me now, now?\n\n[Produced by Jake Gosling]", "image": "https://images.genius.com/36b79bdfcd745feefb97bf07d12aed55.939x939x1.jpg"}], "artist": "Ed Sheeran"}