{"songs": [{"title": "One Night", "album": "Loose Change", "year": "2010-07-02", "lyrics": "[Verse 1]\nLying in a bedroom, lighting up a Benson\nFace hair is growing, so I cut it with a vengeance\nHey, did I mention as she makes an entrance?\nSaid I had a tendency to finish off a sentence\nOh well, she’s a local girl\nNo make-up cause she knows me well\nHair tied up in elastic band\nWith a kiss on the cheek for her one-night man\nIt's like the fast food, I’ll regret it after\nAnd I needed money but I’m too shy to ask her\nSo she buys me chips and cheese\nAnd I tell her that I love her and she’s all I need\nI take it with a cold glass of the fruit and the barley\nShe’s still a sucker for the apple and Bacardi\nHeading to the party, sitting in the car seat\nB.E.P. on radio, it makes me feel naughty and lastly\nShe knows me well\nBit of a catch to have a local girl\nHair tied up in elastic band\nWith a kiss on the cheek for her one-night man\n\n[Pre-Hook]\nI don’t wanna go alone\nI don’t wanna go alone\nNo, I don't wanna go alone\n\n[Hook 1]\nTell her that I love her, tell her that I need her\nTell her that she’s more than a one-night stand\nTell her that she turns my cheeks the colour of my hair\nAll I wanna do is be near\nTell her that I want her, tell her that I need her\nTell her that she’s more than a one-night stand\nTell her that I love her more than anyone else\nIf you don’t, I’ll tell her myself\n\n[Verse 2]\nAnd we’ve got that love in us and we're the drink killers\nWe’re gonna dance all night to the floor fillers\nIf we talk outside, say \"Hey what's new?\"\nI don’t really dance so I’ll just watch you\nAre you taking me back tonight? Tell me if that’s alright\nI don’t wanna be here, I’m not the sofa type\nTell me if you have a toothbrush you don’t mind sharing\nShe said I wanna take off what you’re wearing\n\n[Pre-Hook]\n\n[Hook 1]\n\n[Bridge]\nShe’s like the fast food, I’ll regret it after\nAnd I needed money but I’m too shy to ask her\nBut she buys me chips and cheese\nSo I tell her that she’s all I need\n\n[Hook 2]\nTell her that I, tell her that I\nTell her that she’s more than a one-night stand\nTell her that she turns my cheeks the colour of my hair\nAll I wanna do is be near\nTell her that I, tell her that I\nTell her that she’s more than a one-night stand\nTell her that I love her more than anyone else\nIf you don’t, I’ll tell her myself\n\n[Hook 1]", "image": "https://images.genius.com/28925f055d97f6d86e25c4bcce427f8a.600x600x1.png"}], "artist": "Ed Sheeran"}