{"songs": [{"title": "Nothing on You", "album": "No.6 Collaborations Project", "year": "2019-07-12", "lyrics": "[Verse 1: Ed Sheeran]\nI feel it, can you feel it tonight?\nI feel the fire between you and I\nI mean it, don't you turn off the light\nThough I don't wanna leave you ever, no\nShe was like \"Damn¨\nBoy, I never took you for a one night stand\nSo don't make plans\nFor nothing but me and a lil' romance,\" hey\nYou and I, whiskey on ice\nMaybe later we can turn down all the lights\nSo keep 'em on with nothing on\nOoh-my-my-my\n\n[Chorus: Ed Sheeran & Paulo Londra]\nI was rolling up something with you\nKickin' back in a way that we do\nI got everything I need in this room\nSmoke clouds and a scent of perfume\nAnd all my friends are in the club\nAnd they keep ringin' my phone (Prr)\nBut they ain't got nothing on you (Ah, ah)\nAnd you ain't got nothing on you (Leones Con Flow)\n\n[Verse 2: Paulo Londra]\nMami, suelo acobardarme pero hoy tomo alcohol, ah\nQuiero comentarle que no sé qué pasó, ah\nDesde que salimo' por la tarde lo' do'\nA besarno' lo' do', hasta hacer el amor\nAhora tengo tu olor, ven a la habitación\nLo que hacemo' lo' do' no se puede igualar\nParecemo' ficción cuando entramo' en acción\nEsta peli de amor no se puede acabar, yeh (Yo'; ¡wuf!)\nPero lo que mata e' que esta noche no' vemo' ya en mi casa (Ey; wuh)\nY sé lo que te gusta y te atrapa\nQue te diga que no te voy a soltar\n\n[Chorus: Ed Sheeran & Paulo Londra]\nI was rolling up something with you (¡Wuh!)\nKickin' back in a way that we do\nI got everything I need in this room\nSmoke clouds and a scent of perfume\nAnd all my friends are in the club\nAnd they keep ringin' my phone (Prr)\nBut they ain't got nothing on you\nAnd you ain't got nothing on you\n\n[Verse 3: Dave]\nLook, take the lead, follow me, what's it gonna be?\nHow you playin' hard to get when you hollered me?\nI take Chanel to Chanel for a shopping spree\nHome girl, only right she in a proper tee\nWhat I want and need, you and a sofa\nI fly in a spaceship, I gotta land the Rover\nCasa Cruz, Casa Blanca, Casanova\nI'm a fashionista, she in Fashion Nova\nAnd a mad persona when I had her over\nThe outfit, it cost bread, I got the matching loafers\nWhy? 'Cause that's suttin' to do\nI got a million and two but they're nothin' on you, nah\n\n[Chorus: Ed Sheeran]\nI was rolling up something with you\nKickin' back in a way that we do\nI got everything I need in this room\nSmoke clouds and a scent of perfume\nAnd all my friends are in the club\nAnd they keep ringin' my phone (Brrt)\nBut they ain't got nothing on you\nAnd you ain't got nothing on you\n\n[Outro: Ed Sheeran]\nShe was like \"Damn¨\nBoy, I never took you for a one night stand\"\nShe was like \"Damn¨\nBoy, I never took you for a one night stand\"\nWant to be your man\n\"Boy, I never took you for a one night stand\"\nShe was like \"Damn¨\nAnd you ain't got nothing on you", "image": "https://images.genius.com/6196b7c0f50b8fa903a94272202e8e72.300x300x1.jpg"}], "artist": "Ed Sheeran"}