{"songs": [{"title": "Nightmares - + Random Impulse + Sway + Wretch 32", "album": null, "year": null, "lyrics": "They tell me you can only dream when you fell asleep\nBut now I'm working to achieve, but sleep is the only thing I never see\nAnd I vowed that my breathing with never cease\nTo the retrieve then I can't let them be\nI won't let 'em leave and I had the same feeling since 17\nBut I wasn't ready then like a lemon screen?\nNow I'm in the magazines almost every week\nCause I'm getting heat like in Tenerife\nRight now it's better than it's never been\nNever fade like a plant that's evergreen\nSo I hope to my heart, but my self doubts are getting me\nAfraid for my cross, getting dump for the day and I'm getting weak\nCause I'm new, I'm that boy that starts it\nThey chase dreams together like a slumber party\nAnd now I'm on my own, even though I'm smooth sailing\nI'm scared to sing, cause my nightmare is fading\n\nChorus:\nWhen the darkness creeps in\nI feel my nightmares watching me\nAnd when my dreams are sleeping\nI feel my nightmares watching me\nOh, oh, oh!\nI feel my nightmares watching me\n\nYou better wake up cause I am making moves\nAnd even when I'm dozing I'm breaking rooms\nI'm only hitting the sack when I'm training\nToo busy trying to keep up with the latest snooze\nMade my bed and that's where I'm heading\nI fly straight with the best man I embed 'em\nMarried to the game was a quiet wedding, then I had to fight to get her\nNow I'm taking control of my inception\nCause they try to hit misses with my direction\nSee they better marry donna cause when I strike, strike\nNot even Maradonna is gonna cry, I'm awake at night\nThe haters know where the family lives\nTell me what I catch, but you're playing knock door ginger\nJust gonna lose a lot more, than I need it\nThey say sleep is the cause of death\nBut I hear shit because I am deaf\nGang signs I'm N/A reading\nI'm a CEO, man you suckers are next\n\nChorus:\nWhen the darkness creeps in\nI feel my nightmares watching me\nAnd when my dreams are sleeping\nI feel my nightmares watching me\nOh, oh, oh!\nI feel my nightmares watching me\nThey watching me! They watch me sleep!\n\nLet me go!\nI fell asleep on sofa, walk up in reality\nAnd daydream about losing my sanity\nI've been rhyming forever got a blind flow\nSo I can see an off note with my eyes closed\nBut to achieve the dreams you can't doze off cos your dream a sleep\nI ain't nodding off but I'm nodding to the beat\nI be shocking in my sheets, when I should have been asleep\nSee, all the dreams I'm fonder\nYou placed me in the team insomnia\nNow, I Mr hard worker\nIn my nightmares I Mr can't turn up\nAnd I missed my chance worst luck\nTrying to hit women I Mr I turn up\nYeah, and I walked from ish\nThinking it will put me to rest on my mattress\n\nChorus:\nWhen the darkness creeps in\nI feel my nightmares watching me\nAnd when my dreams are sleeping\nI feel my nightmares watching me\nOh, oh, oh!\nI feel my nightmares watching me\nWatching me!", "image": "https://images.genius.com/1ff6b6189e1a78e497e09c90c1f6692e.1000x1000x1.jpg"}], "artist": "Ed Sheeran"}