{"songs": [{"title": "Lego House (Gosling Remix)", "album": "Lego House (Remixes)", "year": "2011-11-13", "lyrics": "(P Money)\n[Verse 1]\nI feel like I had plastic surgery, cause today I looked in the mirror an' realised I'm faced with neglection\nFeeling like I'm in the belly of the beast, trying to get out, I don't even think it knows that it's pregnant\nStuck in the dream of deception, similar to a scene from Inception\nLooking at reviews from the last show baffled, thinking \"how come I didn't even get a mention?\"\nShocking. I think somebody put too many plugs in my extension\nI signed to music for twenty-three years, now I'm wondering why it doesn't want an extension\nI'm being ignored, even the crowds just staring, I see the tension\nNow I'm on the stage feeling like a mobile phone in the basement, cause I got no reception\nAh, no bars, get it?\nNow I'm choking, no bars, get it?\nIt turned cloudy, no stars, get it?\nI hit the ground so hard, headache\nAh, it's mad\nI should be proud right now but I'm sad\nCause me and the world are out of touch, like the relationship between me and my dad\n\n(Ed Sheeran)\n[Hook]\nI'm out of touch, in a cold December\nNow\nKeep Me Warm\nI'm out of sight\nWith all these things I've done\nDon't hold me down\nIt's more than I can take\nNow\nI'm out of sight\nIn a cold December\n\n(P Money)\n[Verse 2]\nUh, my mum walks past me. my brother Prays asking why I have left them?\nI didn't know I broke up with my girlfriend 'til I saw her with someone else in Beckton\n(Wow)\nI text her, \"you dissed it\". She don't reply like it's none of my business\nMy mind goes round in circles, it keeps on rolling, rolling more than Limp Bizkit\nWhy'd you do me so wicked? Something must've happened, how did I miss this?\nLove turns to pain, expressed with rage. I want justice but I got no witness (help)\nNow I'm powerless. Probably why I'm fascinated with Misfits\nI guess I'm single, not happy, cause my heart doesn't feel like triplets\nAh, FREE, nobody understands but me\nI don't think I got no-one but myself, so when I'm broke I still say \"I got P\"\nAh, it's mad. I should be proud right now but I'm sad\nCause me and the world are out of touch, like the relationship between me and my dad\n\n(Ed Sheeran)\n[Hook]\nI'm out of touch, in a cold December\nNow\nKeep Me Warm\nI'm out of sight\nAll these things I've done\nDon't hold me down\nIt's more than I can take\nNow\nI'm out of sight\nIn a cold December\n\n(P Money)\n[Verse 3]\nSo many thoughts battle me, got me holding my head in agony\nTrying to put the pieces together and figure out if this nightmare is really reality\nSo many turning their back on me\n(wait)\nIt's slowly coming back to me\nAll I can see is the word tragedy, but I didn't think there was a fatality\nUh, damn, I think I know why I don't see my dad\nI think I know why my mum walks past\nAnd why me and my girlfriend don't chat\nSee, all this time I thought I was mad\nI know why I'm not proud and why I'm sad\nI'm out of sight and touch, cause back in March I don't think I survived that crash\n\n(Ed Sheeran)\n[Hook]\nI'm out of touch, in a cold December\nNow\nKeep me warm\nI'm out of sight\nWith all these things I've done\nDon't hold me down\nIt's more than I can take\nNow\nI'm out of sight\nIn a cold December\nCold December (repeat till fade)", "image": "https://images.genius.com/83b8265f3f181533e3ffadfae3d5da72.953x953x1.jpg"}], "artist": "Ed Sheeran"}