{"songs": [{"title": "Nando’s Skank", "album": null, "year": "2011-03-03", "lyrics": "[Ed Sheeran]\nI said, oi, you, are you gonna bang doe?\nNo, I want some fucking Nando's\nWanna eat up with chicken and chips\nEvery nun knows I freestyle like this\nWhen I freestyle on the beat about chicken\nYou know it's finger lickin'\nAnd now I'm gonna pass it over to Example now\nHe's gonna freestyle and he's gonna show you how\n\n[Example]\nChicken, chicken wings\nThey're my favourite things and I love to sing\nI say chicken, chicken wings\nIf you give me them I will eat them things\n\n[Ed Sheeran]\nYo, and we eat chicken for free\nCause he's got a black card you see\nHe made a song about chicken from Nando's\nAnd are you gonna bang yo?\nYes please I want some chicken right now\nPlease I want to put it in my stomach yes\nIt tastes so good I wanna eat the chicken\nWith the fucking breasts and the wings\nAnd the thighs and the chips and the...\n\n[Example]\nAnd all them things that are nice\n[One sec, keep going]\nNando's from me, fat chance I gotta black card\nIf you come to me and ask for chicken you'll get a fat scar\nIn your left cheek I eat Nando's every week\nSometime on a Tuesday, sometime on a Thursday (yo)\nI get free drinks, refillable even when I'm thirsty\nOn a Thursday I eat chicken in the worst ways\n\n[Ed Sheeran]\nYeah, I said we are on tour, saw him\nI'm like get out the store, yo!\nCause you are a whore\nEat Nando's for free everyday on tour, yo!\nAnd it's a par, I ate Nando's from your car\nCan't freestyle cause you'll see me starve\nI slap you in the face cause like I'm like Febreeze ya!\n\n[Example]\nChicken on the phone\nChicken on the phone\nChicken on the phone\nChicken on the phone\nChicken on the phone\nI eat chicken off the floor\nI eat chicken off the bone\nChicken on the phone\nChicken on the phone\nChicken on the phone\nChicken on the phone\nChicken off the floor\nChicken off the sky\nChicken off the bone\nI eat chicken off the bone\n\n[Example & Ed Sheeran]\nI love Nando's more than your mum does\nMore than your mum does\nNando's (I say oh)\nI love Nando's\nMy tongue is on fire\nI wanna say Elliot (yes Ed?)\nNando's I desire (I'll give it to you anytime you want babe)\nI want some free Nando's from your black card\n\n[Example]\nYou ain't getting in my wallet\nAin't getting in my wallet\nI'm on it, I'm on it (I wanna take your black card)\nYou ain't getting my wallet\n\n[Ed Sheeran]\nCause I need them pounds every time I go there to eat my food\nAnd you're so fucking rude you don't fucking buy it for me\nSo I want Nandos for free\nAnd you look like you put your fingers in electricity sockets\nTo get your hair up like this\n\n[Example]\nYou're never touching my card, this is my card\nYou're never touching my card, this is my card\nYou come to me, play your guitar\nStep to me hard, you ain't getting my card star\n\n[Example & Ed Sheeran]\nI want some Nando's\nI want some Nando's\nI want some Nando's (right now)\nI want some Nando's right now", "image": "https://images.genius.com/1ff6b6189e1a78e497e09c90c1f6692e.1000x1000x1.jpg"}], "artist": "Ed Sheeran"}