{"songs": [{"title": "Wake Me Up (Live at the Bedford)", "album": "Live at the Bedford", "year": "2010-09-07", "lyrics": "[Intro]\nOn the last few days of LA, I got taken into this guy's house and he was sponsored by an alcohol company---quite a few actually---and uh-- got pretty wasted, umm-- all times and I was sitting underneath a tree with my phone just putting in lyrics, \"Bah! This is how I feel. Bah!\" And uh... I came up with this song and it is called \"Wake Me Up\"\nBecause I was really pissed, it is quite silly. Bear that in mind\n\n[Verse 1]\nI should ink my skin with your name\nAnd take my passport out again\nAnd just replace it\nSee I could do without a tan\nOn my left hand\nWhere my fourth finger meets my knuckle\nAnd I should run you a hot bath\nFill it up with bubbles\n\nCause maybe you're loveable\nMaybe you're my snowflake\nAnd your eyes turn from green to gray\nAnd in the winter I'll hold you in a cold place\nAnd you should never cut your hair\nCause I love the way you flick it off your shoulder\n\n[Chorus]\nAnd you will never know\nJust how beautiful you are to me\nBut maybe I'm just in love\nWhen you wake me up\n\n[Verse 2]\nAnd would you ever feel guilty if you did the same to me\nCould you make me a cup of tea\nTo open my eyes in the right way\nAnd I know you love Shrek\nBecause we've watched it 12 times\nAnd maybe we're hoping for a fairytale too\nAnd if your DVD breaks today\nYou should've got a VCR\nBecause I've never owned a blue ray, true say\n\nI know I've always been shit at computer games\nBecause your brother always beats me\nAnd if I lost, I go across and chuck all the controllers at the TV\nAnd then you laugh at me\nAnd be asking me\nIf I'm gonna be home next week\nAnd then you lie with me till I fall asleep\nAnd flutter eyelash on my cheek between the sheets\n\n[Chorus]\nAnd you will never know\nJust how beautiful you are to me\nBut maybe I'm just in love\nWhen you wake me up\n\n[Verse 3]\nAnd I think you hate the smell of smoke\nYou always try to get me to stop\nBut you drink as much as me\nAnd I get drunk a lot\nSo I take you to the beach\nAnd walk along the sand\nAnd I'll make you a heart pendant\nWith a pebble held in my hand\nAnd I'll carve it like this necklace\nSo the heart falls where your chest is\nNow a piece of me is a piece of the beach\nAnd it falls just where it needs to be\nAnd rests peacefully\nSo you just need to breathe to feel my heart against yours now\nAgainst yours now\nMaybe I'm just in love when you wake me up\nMaybe I'm just in love when you wake me up\n\n[Interlude: (Gyptian - \"Hold Yuh\")]\nGirl me wann fi hold yuh\nPut me arms right around ya\nGirl you give me the tightest love me eva get seen in my life\nGirl me just wann fi  squeeze yah\nPut me arms right around ya\nGirl you give me the tightest love me eva get seen in my life\nOh in my life, oh\nOh in my life, oh\nOh in my life, ooh oh\n\n[Outro]\nMaybe I'm just in love when you wake me up\nMaybe I'm just in love when you wake me up\nMaybe I fell in love when you woke me up", "image": "https://images.genius.com/301f6bdd0968cba37fcf18de23b60240.300x300x1.jpg"}], "artist": "Ed Sheeran"}