{"songs": [{"title": "Move On", "album": "Want Some?", "year": null, "lyrics": "[Verse 1: Ed Sheeran]\nNow it seems I’ve been young, dug my hole in the ground\nTo me there’s only up, there ain’t no point in looking down\nHowever hard I try, I only get weaker\nSeems my lies and worries got my mind in a sleeper hold\n\n[Bridge 1: Ed Sheeran]\nWhat you gotta do is never get yourself down\nBastards do that for you, get you deeper in the ground\nKeep out of trouble, ain’t no trouble being pure\nSeems like all you bastards gave me something to ignore now\n\n[Hook: Ed Sheeran]\nMove on, forget it\nNow move on, forget it\n\n[Verse 3: ALONESTAR]\nWhen I first started this rapping shit I felt pressure from haters\nBecame invaded with sadists and just developed a hater radar\nAnd made for the stars, kept my grind in the dark\nAnd then appeared with a remedy kicking rhymes with a melody\nHennesey shots and Glocks, all these fools on the block\nWho said you gotta be a gangster now to raise to the top?\nI'm just a normal, casual, usual, everyday type of guy\nWith my head in the sky\nEd Sheeran, Urban Angel coming ready to die\nSo see the signs, stand to the side\nOpen your eyes and take a look and realise\nThe resurrection's arrived\nAnd as the mist clears, homie I arise\nFrom my tomb in disguise\nI'm all alone, Alonestar\nUrban Angel rising from the ashes\nSurprising all haters, guiding, advising them all to steady move\nNow back up\n\n[Hook]\nMove on, forget it\nNow move on, forget it\n\n[Verse 4: ALONESTAR]\nAll I want in this cold world is to make music and use it\nNot to abuse it and get affected, infected with the who's who of music\nWho did it, who is it, who's in it, who…what the fuck does it matter?\nChitter chatter, don't matter, yidder, yidder, yadder\nIt don't matter to me\nAll I want is a bit of dignity in me to battle this industry freely\nTo be me in this seedy, needy world, can you hear me?\nYeah, yeah, can you hear me?\n\n[Bridge 2: Ed Sheeran]\nKeep out of trouble, ain’t no trouble being pure\nSeems like all you bastards gave me something to ignore now\n\n[Hook: Ed Sheeran]\nMove on, forget it\nNow move on, forget it", "image": "https://images.genius.com/0b0266eaaf811902ed364cdd0bd8cb41.600x600x1.png"}], "artist": "Ed Sheeran"}