{"songs": [{"title": "You", "album": "No. 5 Collaborations Project", "year": null, "lyrics": "[Verse 1: Wiley]\nThe thoughts I have could be clear ones, they can seem vivid\nThe goals I reach are not near ones, the further the limit\nI block her out so when I'm looking though my mind she ain't in it\nCan I be free for a minute? Can I be me for a minute?\nThe thoughts I have can be dark ones, even be smart ones\nI know I'm gonna have a couple straight from the heart ones\nTell you what I think, I will until I depart mum\nIt's you that I live for, I'm the first and the last one to love you lots\nWhat's better than thinking about the ones you love?\nNothing much when you're thinking about the ones you love\nI feel the same when I'm on the floor, see the sun above\nUnconditional like bills payed when I've run 'em up\nNo one here to help you pay now you're gonna moan\nNo one here to save the day now you're all alone\nWish I was born with a golden spoon in my mouth\nFact is, I wasn't so I'm coming from a quarter zone\n\n[Hook: Ed Sheeran]\nAnd when the sun falls down I'll be up again, and never close my eyes\nAnd if the dawn might break I'll see nothing when, nothing when\nMy thoughts are only you, and my mind is over you\nMy thoughts are over you, and these words are all for you now, for you\n\n[Verse 2: Wiley]\nI wanna see you happy, I wanna see you smile\nCause you've been trespassing and you won't leave my mind\nNow I've been thinking about this, you told me say \"Yes Nan\"\nI'm 31 now, I'm still saying \"Yes Nan\"\nYou had to replace my mum, dad, two parents in one\nI know you're proud staring at your grandson, I found a job I like\nGot the flat, the cars to buy got the quad I like\nAnd cause of you and Kylie it's in every single song I write\nHad a golden life, wanted people to honour mine\nTell 'em while I'm here cause one day I'm gonna die\nAnd when I'm gone I want my music to play\nAnd when my people listen to this track it's gonna make 'em wanna cry\nI ain't gonna lie, I think about the scene I made\nI say the game's better, it's a must now I've gotta fly\nMy talents gonna shine real shortly, fam i know it\nI work round the clock I don't stop at night\n\n[Hook x2]", "image": "https://images.genius.com/97b67ed332a10b7e1dab779c744bdf50.300x292x1.jpg"}], "artist": "Ed Sheeran"}