{"songs": [{"title": "Drunk in Love/ 1 + 1", "album": null, "year": null, "lyrics": "[Verse 1]\nI've been drinking, I've been drinking\nI get filthy when that liquor get into me\nI've been thinking, I've been thinking\nWhy can't I keep my fingers off it, baby? I want you, na-na\nWhy can't I keep my fingers off it, baby? I want you, na-na\nCigars on ice, cigars on ice\nFeeling like an animal with these cameras all in my grill\nFlashing lights, flashing lights\nYou got me faded, faded-faded, baby, I want you, na-na\nYou got me faded, faded-faded, baby, I want you, na-na\nDrunk in love, I want you\n\n[Bridge]\nWe woke up in the kitchen saying\n\"How the hell did this shit happen?\"\nOh baby, drunk in love\nWe be all night, last thing I remember is our\nBeautiful bodies grinding up in that club, drunk in love\n\n[Hook]\nAnd we be all night, love, love\nWe be all night, love, love\nWe be all night, love, love\nWe be all night, love, love\n\n[Verse 2]\nWe be all night, and everything all right\nNo complaints from my body, so fluorescent under these lights\nBoy, I'm drinking, park it in my lot, 7-11\nI'm rubbing on it, you rubbing on it, if you scared, call that reverend\nBoy, I'm drinking, get my brain right, gangster wife\nLouis rags, he sweat it out, he sweat it out, I'm with that\nBoy, I'm drinking, now I'm on the mic to my boy's toys\nThen I fill the tub up halfway then ride it with my surfboard\nSurfboard, surfboard\nGraining on that wood, graining, graining on that wood\nI'm swerving on that, swerving, swerving on that\nBig body just graining on that wood-wood-wood-wood-woooood\n\n[Bridge]\nWe woke up in the kitchen saying\n\"How the hell did this shit happen?\"\nOh baby, drunk in love\nWe be all night, last thing I remember is our\nBeautiful bodies grinding up in that club, drunk in love\n\n[Hook]\nNow we be all night, love, love\nWe be all night, love, love\nWe be all night, love, love\nWe be all night, love, love\n\n[Verse 3]\nI don't know much about love but I - know I've been shot by you\nI don't know much about Algebra but I know 1+1 is two\nCause we ain't got nothing without love\nAnd baby you got enough for the both of us\n\n[Hook]\nCause we be all night, love, love\nWe be all night, love, love\nWe be all night, love, love\nWe be all night, love", "image": "https://images.genius.com/1ff6b6189e1a78e497e09c90c1f6692e.1000x1000x1.jpg"}], "artist": "Ed Sheeran"}