{"songs": [{"title": "Goodbye to You", "album": "No. 5 Collaborations Project", "year": "2011-01-07", "lyrics": "[Intro: Ed Sheeran]\nHey, can you hear me\nI just wanted to let you know, hmm\n\n[Verse 1: Dot Rotten]\nI hope you can hear what I write to you\nHow could I say goodbye to you?\nWhen I'm a life that came out of the inside of a life that was inside of you\nI gotta respect the way you provided food, for the whole fam\nYou came over a moon rush supporting a mar jays old man\nCold double 8, 8 kids bare wheels\nPlus racists full of hatred in your own plant\n3 jobs in a day\nRest in life in you working but you were never stress free\nJust locked in a cage slaving\nThey said they were gold in the pavements\nBut you came and saw the road to amazement\nBroke your heart\nBut still you were prone to last and your sorrow was over fast\nI hope your listening right\nI still think of you every Sunday\nNo one can top your chicken and rice\nEven through the darkness times\nYou held us all up because your vision was bright\nI knew your strength was your wisdom inside\nYou never let anyone see your heartache\nYou just got on with it\nAnyone tells me that they knew you said you were beautiful\nAnd your words you would stand strong with it\nCause they were like warmth on a winter night\nBut I was just too young to go on with it\nAnd there somethings I could try to do\nBut it's an impossible task for me to even try to say goodbye to you\nI couldn't do that, I owe my life to you\n\n[Hook 1: Ed Sheeran (Dot Rotten)]\nAnd of the pieces of my soul\n(Because I need a sign, I hope this pain will heal in time)\nYou know I never want to be alo-oh-oh-one\nI can see the stars as a cold wind greets the air\nAnd will you think of me up there?\nCan I say goodbye to you?\nAnd paint the stains of the teardrops down my face\nOr feel the chill of your warm embrace?\nCan I say goodbye to you? Ohh\n\n[Verse 2: Dot Rotten]\nI think you phoney\nI was younger with the knowledge of things that I know now\nI would be by your side when you needed me\nInstead of asking you \"Nan can I go out?\"\nStanding in a road with the gangs that I know now\nEveryone's missing you loads, Jessica's grown up\nWarreen, Lauren and Alex are fine and I'm living with hope\nIt's been a while since I've seen C and the mouths\nI miss seeing a family, being a family\nAnd us agreeing with smiles how it used to be as a child\nBut as time goes by, the bridge seems longer\nFamily problems have never been funny\nIn my heart the only one that dissed me was Sonia\nShe took all our inheritance money\nLeft the rest of us to pick up the pieces\nI never forgive the way she betrayed us\nThere ain't a big enough reason\nBefore I sell out my fam I'll be giving up breathing\nBut I guess that everyone's different\nOr should I say no one's perfect?\nShe had happiness in front of her\nBut chose to ride the wave that no ones surfing\nSince you gone the foundations crumbled\nSo building it back up is my next step\nI got all the bricks and the cement but\nIt's hard when it's done, I don't know what to expect\nSo give me the strength that I need to perform this task\nMake it right, I must do\nAnd I ask cause I trust you\nIt goes way beyond a song when I say I love you\n\n[Hook 1]\nAnd of the pieces of my soul\n(Because I need a sign, I hope this pain will heal in time)\nYou know I never want to be alo-oh-oh-one\nI can see the stars as a cold wind greets the air\nAnd will you think of me up there?\nCan I say goodbye to you?\nAnd paint the stains of the teardrops down my face\nOr feel the chill of your warm embrace?\nCan I say goodbye to you? Ohh\n\n[Verse 3: Ed Sheeran]\nIt's just for now so I should hush\nI'll never get enough, I'll see you when I see you but\nI miss you, oh how I miss you\nIt's just for now so I should hush\nI'll never get enough, I'll see you when I see you but\nI miss you, oh how I miss you\n\n[Verse 4: Dot Rotten]\nThere ain't enough words to describe\nHow sorry I am for the pain that I caused\nSorry for when I stuck up my own blood\nWe were young and he said it was raping his broad\nAnd for the day police came to the door\nI'm sorry for being such a bad youth\nStealing from your purse and making you mourn\nI never been able to say this before\nCause I was so inconsiderate\nYou loved me unconditionally\nAnd I took advantage of it like a idiot\nNot seeing the pure soul that I was living with\nI really hope that you can forgive me\nYou going away was a punishment\nBut I won't let go I'm holding you with me\nBut I still fight the emotions within me\n\n[Hook 2: Ed Sheeran]\nI can see the stars as the cold wind greets the air\nAnd will you think of me up there?\nAnd can I say goodbye to you?\nAnd paint the stains of the teardrops down your face\nFeel the chill of your warm embrace?\nAnd can I say goodbye to you?\nI can see the stars as a cold wind greets the air\nAnd will you think of me up there?\nCan I say goodbye to you?\nAnd paint the stains of the teardrops down my face\nOr feel the chill of your warm embrace?\nCan I say goodbye to you?", "image": "https://images.genius.com/97b67ed332a10b7e1dab779c744bdf50.300x292x1.jpg"}], "artist": "Ed Sheeran"}