{"songs": [{"title": "Drown Me Out", "album": "No. 5 Collaborations Project", "year": null, "lyrics": "[Verse 1: Ghetts]\nI'm in so deep\nOmar Epps could relate to my situation on a real\nPain ain't the emotion I want to feel, but I'm thriving off it\nSo it's only right I like this topic, I be on a hill\nKeeping my head above water\nI can't afford to ever get caught in a corner\nSo I move with the force of a sorcerer\nIt's dark when I'm about, just me, myself and my shadow\nAnd I'm parro, running out of ammo\nAnd it seems like everyone around me's on the same path so it's narrow\nThe less then the better\nMore proof for the last one left\nSo they want to leave me as wet as an umbrella\nI play fool to catch wise, how they ever gonna guess I'm clever?\nHow can I be at my best with this pressure?\nI've got a lot to lose\nSo when I watch the news, my minds infected with terror\nNo wonder I'm under stress\nI got my door kicked down by a bunch of feds\nAnd when they left, it looked like I'd had a rave\nAnd invited more than a hundred guests\nI shoulda bust the back door and jumped the fence\nIt's easier when you look back shoulda, woulda, coulda\nBut I bet you can't bring should, woulda could back\nBack to 15, [?]\nI said to myself that I'm more than a hoodrat\n\n[Hook: Ed Sheeran]\nOoo, you can drag me in the deep ends\nOoo, but you will never drown me out\nOoo, you can drag me in the deep ends\nOoo, but you will never drown me out, out, out\nYou won't drown me out, out, out\nYou won't drown me out\n\n[Verse 2: Ghetts]\nYou can never drown me out, the water supply's too low\nAnd I'm round about 6-1, 10 stone\nI've never seen someone drown without\nA sufficient amount of liquid in their lungs\nAnd I'm an MC, my mouth can vouch\nDo I sound like I'm choking?\nSeriously, do I sound like I'm joking? I'm floating\nEven though they want to send me to the bottom of the ocean\nBut I am a ship that sunk many years, blud, I'm maintaining\nPlain sailing, no commotion\nLike a dolphin when it's in motion\nNothing can't break me, so why would I show them I'm broken?\nNo real stress, no, my skin ain't close to corrosion\nFuck them all, this ain't tug of war, still they'll get roped in the open\nI don't want to reveal my violent side, but I swear that I will soon\nIf the Lord above don't provide a sign, then I'mma kill you\nArm for arm, eye for eye\nI just want to live my life\nBut they don't want to see this guy survive\n\n[Hook x2]", "image": "https://images.genius.com/97b67ed332a10b7e1dab779c744bdf50.300x292x1.jpg"}], "artist": "Ed Sheeran"}