{"songs": [{"title": "Feliz Navidad", "album": "Spotify Singles - Christmas", "year": "2018-11-19", "lyrics": "[Intro: Daniel Seavey, Zach Herron, Jonah Marais, Corbyn Besson]\nOh yeah, (oooh)\nOooh, ooh!\n(Wooah), oh yeah\nYou got me feeling all cheerful (yeah yeah, yuh, hey)\nYo, Santa Claus is comin' to town man\nThat kick kinda hard though\nAye, he coming down your chimney\nSanta Claus, you got any presents for me man?\nYo, I need a hot chocolate\nAye, come through, come through, come through\n(Here we go, here we go, here we go)\n(Let's go)\n\n[Chorus: Zach Herron, Jonah Marais, Corbyn Besson, Daniel Seavey,]\nFeliz Navidad (Hey, skrt skrt)\nFeliz Navidad (Ooh, aye)\nFeliz Navidad (Feliz, Feliz)\nPróspero Año y Felicidad (Oo-ooh)\n\n[Chorus: Jack Avery, Zach Herron, Daniel Seavey, Corbyn Besson]\nFeliz Navidad (Feliz Navidad)\nFeliz Navidad (Feliz Navidad)\nFeliz Navidad\nPróspero Año y Felicidad (Ooh, what?)\n\n[Hook: Corbyn Besson, All]\nI wanna wish you a Merry Christmas (Oo-oh)\nI wanna wish you a Merry Christmas (Oo-oh)\nI wanna wish you a Merry Christmas\nFrom the bottom of my heart (Achy breaky heart)\n\n[Hook: Jonah Marais, Zach Herron, Jack Avery]\nI wanna wish you a Merry Christmas (Merry Christmas)\nI wanna wish you a Merry Christmas (Merry Christmas)\nI wanna wish you a Merry Christmas (Merry Christmas)\nFrom the bottom of my heart (Aye, 1, 2, 3, let's go)\n\n[Verse: Daniel Seavey & Jack Avery, Zach Herron, All]\nIt's like ooh, I feel so great now (I feel so great now)\nFly over the moon, like I'm flying Santa's sleigh now (Santa's sleigh)\nI been counting all my blessings, it's Christmas all I think I need is socks now\nSnow is falling, but my heart is warmer than a hot cup of cocoa, oh well (Sip it)\nI got 1, 2, 3, 4, 5 golden rings\nI give 'em all to you if you make me your king\nI'm hanging with Santa, he told me that I was on your wish list\nSo why don't we give it a shot? Baby let me just kiss you this Christmas\n\n[Chorus: Zach Herron, Daniel Seavey, Corbyn Besson, All]\nFeliz Navidad (Feliz Navidad)\nFeliz Navidad (Feliz Navidad, ooh)\nFeliz Navidad\nPróspero Año y Felicidad (Everybody come through, let's go, let's go)\n\n[Hook: Zach Herron, All]\nWe wanna wish you a Merry Christmas (We wanna wish you a m-)\nWe wanna wish you a Merry Christmas (Merry Christmas)\nWe wanna wish you a Merry Christmas\nFrom the bottom of our hearts (Hey!)", "image": "https://images.genius.com/670d64c0e37568642cca79a817c7e7b6.640x640x1.jpg"}], "artist": "Why Don’t We"}