{"songs": [{"title": "Table", "album": null, "year": "2016-10-14", "lyrics": "[Verse 1: Kehlani]\nI will say I'm a believer in letting people be people\nIf you're humble or conceited, I'll still see you as an equal\nI don't be taking offenses to how the devil be working\nI know that God is my witness, fulfilling my purpose\nI've been a real down to Mars chick, at the bar chick\nI'll pick up your 3 A.M. call chick\nLove and Basketball chick\nI move your car chick\nLate night trips to Target\n\n[Chorus: Kehlani]\nI know what I bring, to the table, to the table\nI know what I bring, to the table, to the table\n\n[Verse 2: Kehlani]\nI know I'm not no messiah, and I am far from a prophet\nBut if the earth set on fire, I think I know how to stop it\nI'm not afraid of opinion, I know the devil be working\nI just keep up with my focus and keep my nose in these verses\nI've been a real down to earth chick, never surface\nI pick a backpack over a purse chick\nNever at ya service, here for your worstest\nHa, don't I sound perfect?\n\n[Chorus: Kehlani]\nI know what I bring, to the table, to the table\nI know what I bring, to the table, to the table\n\n[Verse 3: Little Simz]\nI try my best to be lovin' and give my all when it's needed\nI make the most of my time, and try to learn all the teachings\nDon't take my kindness for weakness\nSteady dealing with madness\nSo I pick up my chalice, 'cause what's life without balance?\nToo much shit on my mental, don't pretend like you get it\nYou would call me a medic, if you knew where my head is\nDamn, if you knew where this led-ed, all my vices are deaded\nIf you know what I'm going through, why the fuck would you stress me?\nTake me back to the basics\nUnderstanding what's worth chasing\n'Cause time is of the essence, get me out the matrix\nI pick my battles and win\nYou can't relate where I've been\nI don't say much, 'cause I don't need much in this world full of sin\nBody and soul is detached, and my heart's got a patch\nYou can't drive without looking and then expect not to crash\nBut I know what gave me purpose\nI'll take my title as king\nAnd I'll take a seat at the table, because I know what I bring\nKnow what I bring...to the table\nTo the table...to the table", "image": "https://images.genius.com/c592b5cb151f9c84fa9c15beb80b9dbc.500x500x1.jpg"}], "artist": "Kehlani"}