{"songs": [{"title": "Champion", "album": null, "year": "2015-06-22", "lyrics": "[Intro: Myles Parrish]\nP-P-P-Lo, time to bring the bass back\n\n[Verse 1: Kehlani]\nWelcome to the Bay, it's the land of the real\nThe home of the honest, the home of no chill\nAnd we don't take no L's we just run up the bills\nLeave a fuck nigga on these hills\nNever seen a scraper on less than dubs\nNever seen a hater with a section at the club\nYoung heartbreaker but the world show me love\nOnly after paper, gotta get it while I’m young\nSteph Curry for the win, boy\nAnd I'm Curry with the pimp, boy\nNever miss a shot of a verse that’s a sin, boy\nAll across the board, yeah the Bay is on ten, boy\nGang goin' up, team goin' up\nAnd this beat goin' up, streets goin' up\nAyy, gang goin' up, team goin' up\nAnd this beat goin' up, streets goin' up\n\n[Chorus: Iamsu! & G-Eazy]\nMan, they put me in the game, so I'ma play\nI'ma do it one time for the Bay\nFrom the place where they say it can’t be done\nMake no mistake, I’m a champion\nChampion, a champion, a champion\nYeah, yeah, yeah, yeah, yeah\nChampion, a champion, a champion (Heartbreak Gerald, yeah)\nYeah, yeah, yeah, yeah, yeah Yee!\n\n[Verse 2: G-Eazy]\nThe whole Bay is goin' up now\nIt's champagne in my cup now\nCause at the top it's just us now\nThey want a favor like what's up now\nIt's funny everybody gives a fuck now\nSummer Jam, made 30 bands\nAnd I'm still in a flannel, ripped jeans, and some dirty Vans\nAnd I'll still hit the furly dance\nThey got faith in me same way they do in Steph Curry's hands\nNow they think it's a fluke like we lucked up\nNo no, bitch you got me fucked up\nLook, it's me and Baelani\nI'm hella clean and I'm shining\nBitch, I was dipped when you saw me\nYou thirsty, you need Dasani\nNow, why not us, then became a world champion\nNo one saw it coming, everybody said it can’t be done\nHome of the hyphy ones, bruh I come from the land of them\nChill cause I hang with OGs, now they stampin' him\nEazy\n\n[Chorus: Iamsu!]\nMan, they put me in the game, so I'ma play\nI'ma do it one time for the Bay\nFrom the place where they say it can’t be done\nMake no mistake, I’m a champion\nChampion, a champion, a champion\nYeah, yeah, yeah, yeah, yeah\nChampion, a champion, a champion\nYeah, yeah, yeah, yeah, yeah\n\n[Verse 3: Lil B]\nYesssssss!\nYou already know, man\nIt’s your boy, Lil B (Figaro!)\nNow everybody know about the Based God\nBut my name Lil B, MVP\nAll I do is splash like I'm Klay Thompson\nGuns in the back, look how the Bay rockin' (Yeah!)\nCame off the bench like Iguodala\nEvery time I shoot, the crowd get louder\nCall me Draymond cause I'm 'bout green\nEveryday I go dumb, you know what I mean (Yesssss!)\nRIP to The Jacka and Mac Dre (Mac Dre)\nLight up the weed when this song play (song play)\nKeep it positive but these suckas watchin'\nI'll bust a nigga head if it's no option\nI'll see you with the hands 'fore I use a gun\nI'm a warrior, I don't gotta run\nDojo niggas do the one on one (Yesssss!)\nIf you don't fight fair, I'ma play dirty\nCross a nigga fast like Steph Curry (Based God!)\nI got too much swag, I don't flick my wrist (Nope!)\nDo the cookin' dance when I fuck a bitch (Yesssss!)\nCount a couple grand when I hit a lick (Hit a lick)\nEverybody scream 'Lil B', bitch\nEverybody scream 'Lil B', bitch!\nHaters in the back, you can get whacked\nWhere I'm from? The Bay, you don't need a map\n\n[Chorus: Iamsu!]\nMan, they put me in the game, so I'ma play\nI'ma do it one time for the Bay\nFrom the place where they say it can’t be done\nMake no mistake, I’m a champion\nChampion, a champion, a champion\nYeah, yeah, yeah, yeah, yeah\nChampion, a champion, a champion\nYeah, yeah, yeah, yeah, yeah", "image": "https://images.rapgenius.com/833e58d50331290e4ceedbf8057e69b8.600x600x1.jpg"}], "artist": "Kehlani"}