{"songs": [{"title": "Letter to Pat Leonard", "album": null, "year": null, "lyrics": "Dear Pat\n\nSorry it's taken me so long to get back to you. I recieved your letter in NY but I had to leave for Mich, which is where I am right now. I have thought long and hard about what I want to do with our songs, my record, the sound, the vibe etc. I had always intended to do a portion of the record with Nellie Hooper because I like the sound of all of his records and I think he has really good instincts. Then I thought about doing the rest of the record with you not really thinking what the divide would be. This is where my head was at when I left Miami. Then I started thinking about how I didn't want a record that sounds like two different producers worked on it. I allready had that nightmare experience. Then i started leaning towards Nellie doing the whole thing because he's not a song writer and I thought he would treat all songs fairly without favortism and ego involved. I sent all my demos to Nellie to listen to and while he gave it up to a few he made some disturbing remarks about how he was going to have to change the music so much he would want a writers credit. Which of course made me sick. EGO-EGO-EGO!!!! When I was in NY I had to meet with William Orbit which has you know we're trying to do a deal with and he played me more tracks that blew my mind and I mentioned that I would like to write with him and he said he had studio time and why not tomorrow? To make a long story short we ended up doing several tracks together that I absolutely adore and more importantly I love his sound. Suddenly i felt like he knew what direction I wanted to go musically (sonically). I haven't formally asked him to produce my album but I'm going to and I wanted you to know first. I know he will be gobsmacked and humble and eager to please which is not to say that you aren't but I really feel strongly about taking a new direction and William's sound is a complete departure. After making so many records it's what I need to get my blood boiling. I hope you will not be insulted or take offense by this decision. I loved working with you again. You're a brilliant musician/songwriter and I have the utmost respect for you. On top of all that I adore you. You did say you were cool with any decision I made. Obviously if we use any of your programs you will be compensated. I may use a rough vocal or two and I haven't decided if I will use all the songs we wrote. I will keep you posted on everything. I will probably be working all of July and August and September. In any case these are my thoughts for now. I'll be in LA on Monday if you want to write or call\n\nTake care\n\nLove\n\nMadonna", "image": "https://images.genius.com/e976e2c129781fb6a14dbc2cea188539.1000x1000x1.jpg"}], "artist": "Madonna"}