{"songs": [{"title": "Billboard “Woman of The Year” Speech", "album": null, "year": "2016-12-10", "lyrics": "First of all I wanna uhm, I wanna say thank you to Labyrinth, that was an amazing, amazing performance. Can I put this down? Sorry, seriously. It's better this way. Ahh, I always feel better with something hard between my legs.\n\nI stand before you as a doormat. Oh, I mean, as a female entertainer. Thank you for acknowledging my ability to continue my career for 34 years in the face of blatant misogyny, sexism, constant bullying and relentless abuse. When I started there was no internet, so people had to say it to my face. There were very few people I had to clap back at because life was simpler then.\n\nWhen I first moved to New York, I was a teenager. It was 1979 and New York was a very scary place. In the first year I was held at gunpoint, raped on a rooftop with a knife digging into my throat and I had my apartment broken into and robbed so many times I just stopped locking the door. In the years to follow, I lost almost every friend I had to AIDS or drugs or gunshot. People were dying of AIDS everywhere. It wasn’t safe to be gay, it wasn’t cool to be associated with the gay community.\n\nAs you can imagine, all these unexpected events not only helped me become the daring woman that stands before you, but it also reminded me that I'm vulnerable. And in life there is no real safety except self-belief. And an understanding that I'm not the owner of my talents. I'm not the owner of anything. Everything I have is a gift from God. And even the shitty fucked up things that happened to me, that still happen to me, are also gifts to teach me lessons and make me stronger.\n\nI'm receiving an award for being woman of the year, so I ask myself \"what can I say about being a woman in the music business? What can I say about being a woman?\".\n\nWhen I first started writing songs, I didn't think in a gender-specific way. I didn't think about feminism. I just wanted to be an artist. I was of course inspired by Debbie Harry and Chrissie Hynde and Aretha Franklin, but my real muse was David Bowie. He embodied male and female spirit and that suited me just fine. He made me think there were no rules. But I was wrong. There are no rules - if you're a boy.\n\nIf you're a girl, you have to play the game. What is that game? You're allowed to be pretty and cute and sexy. But don’t act too smart. Don’t have an opinion. Don't have an opinion that is out of line with the status quo at least. You are allowed to be objectified by men and dress like a slut, but don’t own your sluttiness. And do not, I repeat do not, share your own sexual fantasies with the world. Be what men want you to be, but more importantly, be what women feel comfortable with you being around other men. And finally, do not age. Because to age is a sin. You will be criticized. You will be vilified. And you will definitely not be played on the radio.\n\nWhen I first became famous, there were nude photos of me in Playboy and Penthouse magazine. Photos that were taken from art schools where I posed for back in the day to make money.  They weren't very sexy. In fact I looked quite bored. I was. But I was expected to feel ashamed when these photos came out, but I was not. And this puzzled people.\n\nEventually I was left alone because I married Sean Penn, and not only would he would bust a cap in your ass, but I was off the market. So for a while I was not considered a threat. Years later, divorced and single - sorry, Sean - I made my Erotica album and my Sex book was released. I remember being the headline of every newspaper and magazine. And everything I read about myself was damning. I was called a whore and a witch. One headline compared me to Satan. I said, \"Wait a minute, isn't Prince running around with fishnets and high heels and lipstick with his butt hanging out?' Yes, he was. But he was a man. This was the first time I truly understood that women really did not have the same freedom as men.\n\nI remember feeling paralyzed. It took me a while to pull myself together and get on with my creative life. Get on with my life. I took comfort in the poetry of Maya Angelou, and the writings of James Baldwin, and in the music of Nina Simone.\n\nI remember wishing that I had a female peer I could look to for support. Camille Paglia, the famous feminist writer, said that I set women back by objectifying myself sexually. \"Oh\", I thought, \"so if you're a feminist, you don't have sexuality, you deny it.\" So I said \"fuck it. I'm a different kind of feminist. I'm a bad feminist.\"\n\nPeople say that I'm so controversial. But I think the most controversial thing I have ever done is to stick around. Michael is gone. Tupac is gone. Prince is gone. Whitney is gone. Amy Winehouse is gone. David Bowie is gone. But I'm still standing. I'm one of the lucky ones and every day I count my blessings.\n\nWhat I would like to say to all women here today is this: Women have been so oppressed for so long, they believe what men have to say about them. And they believe they have to back a man to get the job done. And there are some very good men worth backing, but not because they're men - because they're worthy. As women, we have to start appreciating our own worth and each other's worth. Seek out strong women to befriend, to align yourself with, to learn from, to be inspired by, to collaborate with, to support, to be enlightened by.\n\nAs I said before, it's not so much about receiving this award as it is having this opportunity to stand before you and really say thank you, as a woman, as an artist, as a human. Not only to the people who have loved and supported me along the way, you have no idea... you have no idea how much your support means.\n\nBut to the doubters and naysayers and everyone who gave me hell and said I could not, that I would not, that I must not - your resistance made me stronger, made me push harder, made me the fighter that I am today. Made me the woman that I am today. So thank you.", "image": "https://images.genius.com/e976e2c129781fb6a14dbc2cea188539.1000x1000x1.jpg"}], "artist": "Madonna"}