{"songs": [{"title": "Pour It Up (Remix)", "album": null, "year": null, "lyrics": "[Intro: Young Jeezy]\nSay, Rih-Rih, let’s take this shit to the street one-time, you know? (it's the remix)\nThrowin’ hundreds like loose change, still got my money (AY)\nGot your broad in that Mulsanne, that Bentley homie (haha)\nSeats whiter than cocaine, that .40 on me (yeah)\nGot me and Chi-Chi, bring broads, mane - she like my homie (let's go!)\n\n[Young Jeezy]\nI’m King Tut with my gold chain (gold chain), my partner with me, he the dope mane (yeeeah)\nStraight gas nigga, that BP on that E-40, that OG (AY)\nThese bitch niggas be actin' up, these hoes niggas be actin' foul (CHEA)\nThey’ll grind with you, they’ll shine with you, be  pointin’ fingers off at your trial (daaamn)\nMy Rolls Royce with my driver in it, gettin’ fucked up ‘cause I ain’t got to drive (yeeah)\nThat Kendrick on them bottles came, poured a Swimming Pool, now we 'bout to dive (that's right)\nGot one room, got three bitches nigga damn right that’s where they’re supposed to be (yeeeah)\nTwo Glock .40s at all time gon' shoot back a nigga shooting me, you know it\nHaha, yeah...\n\n[Hook: Rihanna]\nOh-ohhhhhh-ohhh-oh-oh-oh\nAll I see is signs, all I see is dolla' signs\nOh-ohhh-ohhh-ohhh-oh-oh-oh\nMoney on my mind, money-money on my mind\nThrow it-throw it up, watch it fall out from the sky\nThrow it up-throw it up, watch it all fall out\nPour it up-pour it up, that's how we ball out\nThrow it up-throw it up, watch it all fall out\nPour it up pour it up, that's how we ball out\nThat's how we ball out\nThat's how we ball out\nThat's how we ball out\n\n[Rick Ross over Hook]\nIt's the biggest nigga in the game\nSexy bitches world wide, whassap?\nFuck with me huh? Yeah (M-M-M-M-Maybach Music)\n\n[Rick Ross]\nMy foreign cars, domestic beefs (HUH)\nPeter Luger’s, the better seats\nDollar after dollar (dollar) bottle after bottle (bottle)\nLate for you haters even though my plane charter\nSuede Bally shoes, true rude boy\nFerrari 400 horses, we do it for cool points (HAHA)\nBaby, do the math, I’m coppin’ Chanel bags\nTalkin’ Belle Harbour, cigars by Hermes (WOOOO...)\nKnow we ran the streets, eatin’ cold bully beef (HUH)\nNow we at the Grammys, Tom Ford to my feet (AH-HAH)\nBoss on the avi, Rihanna screensaver\nWhenever you see fat boy, I know it mean paper\nM-M-Maybach Music\n\n[Juicy J]\nWe trippy mane.. uh\nJuicy J pourin’ up codeine, Benz all white, no chlorine\nBad chick with me got ass and titties, freaky bitch gon’ fuck the whole team (yeah ho!)\nZiplock bag full of OG, I go in like a door key\nYour girlfriend down on both knees, she catch more balls than a goalie\nPurple all in my sprite, I’m high as Denzel on Flight\nScared money don’t make no money, you niggas shaky like dice\nI’m in the bed with your wife - we poppin’ pills, we goin’ hard\nWhen she with you she a church girl, when she with me she a pornstar\nSmokin’ on doobies like cigarettes, which one these strippers give head the best?\nPussy so good that I think I’m in love; what am I saying? It must be the drugs (drugs, drugs)\nPour it up, pop that ass, I make it rain ho (yeah ho!)\nI’ll make it flood, shorty, you might need a raincoat\n\n[Rihanna]\nStrip clubs and dolla' bills - still got mo' money\nPatron shots can I get a refill - still got mo' money\nStrippers going up and down that pole - still got mo' money\n4'o clock and we ain't going home cause I still got mo' money\nMoney make the world go round - still got mo' money\nBands make you girl go down - still got mo' money\nLot more where that came from - still got mo' money\nThe look in your eyes, I know you want some - still got mo' money\n\n[Interlude: Rihanna]\nPour it up-pour it up, that's how we ball out\nThat's how we ball out\nThat's how we ball out\nThat's how we ball out\n\n[T.I. & (Rihanna)]\nAight Rih, let get it baby\nTURN UP!\n\nI catch a case and I go to jail (still got mo' money)\nI came home and went back, oh well (still got mo' money)\nI’m multiplying everything I spend (still got mo' money)\nThese trap niggas I represent (still got mo' money)\nIt’s Hustle Gang and we poppin’, got big bank rolls in our pockets\nHoppin’ out a foreign vehicle (what), throwin’ forty Gs, ain’t no issue, bitch, bitch!\nI’m thorough as it get, official, bitch, bitch!\nBetter watch your pussy poppin’ - I might wanna come and get you, bitch\nNow everywhere you may see me surrounded by bad bitches like Rih-Rih\nGot them booty shots, look like Nicki, face and toes pretty, I’m picky\nSee these trap niggas, they honor me and these rap niggas up under me\nAin’t nothin’ for me to get a hundred keys and then stimulate the economy, like..\nYUP, HEY, YUP, YUP, HEY, YUP\nOkay, okay\n\n[Hook: Rihanna]\nOh-ohhhhhh-ohhh-oh-oh-oh\nAll I see is signs, all I see is dolla' signs\nOh-ohhh-ohhh-ohhh-oh-oh-oh\nMoney on my mind, money-money on my mind\nThrow it-throw it up, watch it fall out from the sky\nThrow it up-throw it up, watch it all fall out\nPour it up-pour it up, that's how we ball out\nThrow it up-throw it up, watch it all fall out\nPour it up pour it up, that's how we ball out\nThat's how we ball out\nThat's how we ball out\nThat's how we ball out", "image": "https://images.genius.com/f04bd56a5e79ac5d18b9978f9ede6b72.500x500x1.jpg"}], "artist": "Rihanna"}