{"songs": [{"title": "Here", "album": null, "year": "2015-06-17", "lyrics": "[Verse 1]\nI'm sorry if I seem uninterested\nOr I'm not listenin', or I'm indifferent\nTruly I ain't got no business here\nBut since my friends are here, I just came to kick it\nBut really I would rather be at home all by myself\nNot in this room with people who don't even care about my well-being\nI don't dance, don't ask\nI don't need a boyfriend\nSo you can go back\nPlease enjoy your party, I'll be here\nSomewhere in the corner under clouds of marijuana\nWith this boy who's hollering I can hardly hear\nOver this music I don't listen to, and I don't wanna get with you\nSo tell my friends that I'll be over here\n\n[Chorus]\nOh-oh-oh here, oh-oh-oh here\nOh, I ask myself, what am I doin' here?\nOh-oh-oh here, oh-oh-oh here\nAnd I can't wait 'til we can break up outta here\n\n[Verse 2]\nExcuse me if I seem a little unimpressed with this\nAn anti-social pessimist, but usually I don't mess with this\nAnd I know you mean only the best\nAnd your intentions aren't to bother me\nBut honestly I'd rather be somewhere with my people\nWe can kick it and just listen to some music with a message, like we usually do\nAnd we'll discuss our big dreams\nHow we plan to take over the planet\nSo pardon my manners\nI hope you'll understand that I'll be her\nNot there in the kitchen with the girl who's always gossiping about her friends\nSo tell them I'll be here\nRight next to the boy who's throwin' up 'cause he can't take what's in his cup no more\nOh, God, why am I here?\n\n[Chorus]\nOh-oh-oh here, oh-oh-oh here\nOh, I ask myself, what am I doin' here?\nOh-oh-oh here, oh-oh-oh here\nAnd I can't wait 'til we can break up outta here\n\n[Bridge]\nHours later, congregatin' next to the refrigerator\nSome girl talkin' 'bout her haters, she ain't got none\nHow did it ever come to this?\nI shoulda never come to this\nSo holla at me, I'll be in the car when you're done\nI'm stand-offish\nDon't want what you're offerin'\nAnd I'm done talkin'\nAwfully sad it had to be that way\nSo tell my people when they're ready that I'm ready\nAnd I'm standin' at the TV with my beanie low\nYo, I'll be over here\n\n[Chorus]\nOh-oh-oh here, oh-oh-oh here\nAsk myself, what am I doin' here?\nOh-oh-oh here, oh-oh-oh here\n\n[Outro]\nHmm\nOh-oh-oh here, here\nHmm\nHere, here\nAre we over here?", "image": "https://images.genius.com/4e0b19bdca3bdc0650b446a6db41b2a0.1000x563x1.jpg"}], "artist": "Dua Lipa"}