{"songs": [{"title": "I Taste Like a Cherry", "album": "Unreleased", "year": null, "lyrics": "[Verse 1]\nSweet as a jezebel dancing on your tongue\nLike a sugar rush buzz, makes the bass feel numb\nThere's a line down the corner where the boys stand in order\nWith their pockets full of quarters 'cause they're all so sprung\nSo take off my boots if you wanna get you some\nShow me some of them moves, let's get dumb\n\n[Pre-Chorus]\nYou gotta work on me tonight\nYou gotta work to taste what's ripe\nDon't make me wait, don't take too long\nYou gotta step it up or sleep alone\nYou gotta work on me tonight\n\n[Chorus]\n'Cause I taste like a cherry, oh, I taste like a cherry\nOh, I taste like a cherry, on the beat, your cherry on top\nOh, I taste like a cherry, oh, I taste like a cherry\nTongue tied, stem in a knot, I'll be your cherry on top\n\n[Verse 2]\n'Cause I'm rough like Jackie going down on the rocks\nDo you talk the talk? Or do you walk the walk?\nI'm Elvis, bitches I rock around the clock\nTennessee on your ass, stop\nSo take off my boots, if you wanna get you some\nShow me some of them moves (One, two, three, four, dancefloor)\n\n[Pre-Chorus]\nYou gotta work on me tonight (Work, work, work, work)\nYou gotta work to taste what's ripe (Work, work, work, work)\nSo get up off your lazy bones\nYou gotta step it up or sleep alone\nYou gotta work on me tonight (Work, work, work, work)\n\n[Chorus]\n'Cause I taste like a cherry, oh, I taste like a cherry\nOh, I taste like a cherry, make me your cherry on top\nOh, I taste like a cherry, oh, I taste like a cherry\nTongue tied, stem in a knot, make me your cherry on top\nI'll be your cherry on top\n\n[Verse 3]\nYou give me thrills, so take a bite\nInto my skin, must savor love\nLet's knock some shit over\nLike we've never been sober\nCome into my kitchen, I'll feed you pie\n\n[Chorus]\n'Cause I taste like a cherry, oh, I taste like a cherry\nOh, I taste like a cherry, make me your cherry on top\nOh, I taste like a cherry, make me your cherry on top\nOh, I taste like a cherry, oh, I taste like a cherry\nTongue tied, stem in a knot, make me your cherry on top\nI'll be your cherry on top\n\n[Outro]\nCherry cola (Cherry Cola) cherry pop (Cherry pop)\nYou wanna little sip? (Taste like a cherry)\nA little taste of love (Oh, it tastes so hot)\nOoh, cherry cola (Cherry Cola) cherry pop (Cherry pop)\nYou wanna little sip? (Taste of your cherry)\nA little taste of my love (Oh, it tastes so hot)\nCherry cola (On your red motorcycle)\nCherry pop (In your red hot pants)\nYou wanna little sip? (Of your cherry wine)\nA little taste of love (Oh, your tongue's so good)\nCherry cola (Lights turn red) cherry pop (Red wine)\nYou wanna little sip? (Tie me up with that lace)\nA little taste of love (Standing in the red ring)\nCherry cola, cherry pop, you wanna little sip?\nA little taste of love", "image": "https://images.genius.com/e2db25b94d7af8017f31453877323e49.700x700x1.jpg"}], "artist": "Kesha"}