{"songs": [{"title": "Dinosaur (Demo)", "album": "Unreleased", "year": null, "lyrics": "[Intro]\nHittin' on me, boy\n\n[Chorus]\nD-I-N-O-S-A you are a dinosaur\nA D-I-N-O-S-A you are a dinosaur\nAn O-L-D M-A-N, you're an old man\nHittin' on me, boy, you need a CAT scan\n\n[Verse 1]\nOld man, why are you starin' at me?\nMack on me and my friend, it's kinda creepy\nYou should be prowlin' around the old folk's home\nCome on, brother, leave us alone\nAt first I thought that it was kinda funny\nThat you're the age of my grandpa, pappy\nBut for real, I know you got lots of money\nBut I still won't get down with you, honey\n\n[Chorus]\nD-I-N-O-S-A you are a dinosaur\nA D-I-N-O-S-A you are a dinosaur\nAn O-L-D M-A-N, you're an old man\nHittin' on me, boy, you need a CAT scan\n\n[Verse 2]\nNot long 'til you're a senior citizen\nAnd you can strut around with that sexy bag of oxygen\nHoney, your toupee is fallin' to your left side\nGet up and go, brother, save yourself a little pride\nYou sit down, buy me a martini\nWon't go away, my hints aren't sinking\n\"Hey,\" you say, \"wanna come with me?\"\nI'm about to barf, seriously\n\n[Verse 3]\nHey, buddy, are those teeth real?\nYeah, how many times have you been married?\nSeriously, I mean are you wearing your diapers?\nKesh, they're called Depends\nHoney, it's bingo night, you're missing bingo night\nWell, Kesh, it's not even that, it's past his bedtime anyway\nHe needs to go home and get tucked in\nAnd take his teeth out and take all those pills\nTotally, I mean what skeezy old guy just hangs around a bar\nAnd hits on cute young girls, anyway?\nHe must have amnesia and lost his way and somehow wandered in here\nAw, he must think that, like, we're his grandkids\nNo, no sir, no we're not\nBingo night's that way\nTurn around, okay\nNo skeezy old guys for us\nThank you, thanks, have a good night\nHave a good night, buddy, see ya\n\n[Chorus]\nD-I-N-O-S-A you are a dinosaur\nA D-I-N-O-S-A you are a dinosaur\nAn O-L-D M-A-N, you're an old man\nHitting on me, boy, you need a CAT scan\nD-I-N-O-S-A you are a dinosaur\nA D-I-N-O-S-A you are a dinosaur\nAn O-L-D M-A-N, you're just an old man\nHittin' on me boy", "image": "https://images.genius.com/1d0456403577b67c8a7335ee25a96e4e.400x400x1.jpg"}], "artist": "Kesha"}