{"songs": [{"title": "Spaceship", "album": "Rainbow", "year": "2017-08-11", "lyrics": "[Verse 1]\nI always said when I'm gone, when I’m dead\nDon't lay me down with the dirt on my head\nYou won't need a shovel, you don’t need a cold headstone\nYou don't need to cry, I'm gon' be going home\n\n[Chorus]\nI'm waiting for my spaceship to come back to me\nIt's coming back for me\nI don't really care if you believe it's coming back for me, yeah\nLiving in a lonesome galaxy\nBut in my dreams, I see them come ’n rescue me\nLook up in the sky and there they’ll be\nI bet you'll think of me then\nYou’re gonna say, \"Ooh, look at that, oh yeah, yeah\"\nDamn, if it ain't true\nThey're coming back for me, they're coming back for me, yeah\n\n[Verse 2]\nI knew from the start I don’t belong in these parts\nThere's too much hate, there's too much hurt for this heart\nLord knows this planet feels like a hopeless place\nThank God I'm going back home to outer space\n\n[Chorus]\nI'm waiting for my spaceship to come back to me\nIt's coming back for me\nI don't really care if you believe it's coming back for me, yeah\nLiving in a lonesome galaxy\nBut in my dreams, I see them come 'n rescue me\nLook up in the sky and there they'll be\nI bet you'll think of me then\nYou're gonna say, \"Ooh, look at that, oh yeah, yeah\"\nDamn, if it ain't true\nThey're coming back for me, they're coming back for me, yeah\n\n[Chorus]\nI'm waiting for my spaceship to come back for me\nAnd I don't really care if you believe me\nLiving in a lonesome galaxy\nBut in my dreams, I see them come 'n rescue me\nLook up in the sky and there they'll be\nI bet you'll think of me then\nYou're gonna say, \"Ooh, look at that, oh yeah, yeah\"\nDamn, if it ain't true\nThey're coming back for me, they're coming back for me, yeah\n\n[Outro]\nAs I leave this Earth and sail into the infinite cosmic universe, the wars, the triumphs, the beauty, and the bloodshed, the ocean of human endeavor, it all grows quiet, insignificant. I'm nothing more than recycled stardust and borrowed energy, born from a rock, spinning in the aether. I watch my life backwards and forwards and I feel free. Nothing is real, love is everything, and I know nothing.", "image": "https://images.genius.com/2d38f67d979eeef72827af914c8e9733.939x939x1.jpg"}], "artist": "Kesha"}