{"songs": [{"title": "Warrior Interrogation", "album": null, "year": "2012-12-04", "lyrics": "Interrogator: Let's start with the hard ones first, shall we?\n\nKe$ha: What do you wanna know?\n\nInterrogator: I want to know your full name.\n\nKe$ha: Ke$ha. With a dollar sign.\n\nInterrogator: What's your date of birth?\n\nKe$ha: March 1st, 1987.\n\nInterrogator: Is it true your mother was an alien?\n\nKe$ha: How do you know that?\n\nInterrogator: Just answer the question.\n\nKe$ha: Yes.\n\nInterrogator: What about your father? What was he? Alice Cooper?\n\nKe$ha: Kind of.\n\nInterrogator: Is it true that your song \"Gold Trans Am\" is about you hoo-ha?\n\nKe$ha: Yes, that is true. I admit fully that it is. Cause my vagina's gold. It's glittery too. It smells like candy.\n\nInterrogator: So if I asked the question, \"Do you eat glitter on a daily basis?\" What's your answer to that one?\n\nKe$ha: I do. That's fair. That's fine. I do.\n\nInterrogator: Mr. Peep$. Oh yeah. Your cat. When did you last speak to it?\n\nKe$ha: Everyday. All day long. And I'm psychic, and I can talk to him in my mind, every second.\n\nInterrogator: What's he doing right now?\n\nKe$ha: Right now, he's climbing up a tree. He thinks you're a big asshole.\n\nInterrogator: Have you got codenames for you male conquests?\n\nKe$ha: Yeah.\n\nInterrogator: Give me an example.\n\nKe$ha: Captain Dick'n'balls. DJ Fucktard.\n\nInterrogator: Do you know a Baby Spoon?\n\nKe$ha: Oh... Why are you bringing him into this? Why are you bringing the Baby Spoon here?\n\nInterrogator: Do you know him?\n\nKe$ha: Yeah! He liked to spoon. So, he wanted to be the baby spoon. And I thought that was super lame.\n\nInterrogator: You've got a track called \"Past Lives\" on your new album. Oh yeah. And it's about Elvis Presley. Is that right.\n\nKe$ha: No, it's about Liberace. Cause apparently I was Liberace in my past life. I really like capes.\n\nInterrogator: He's the guy with the glitter, isn't he?\n\nKe$ha: Yeah.\n\nInterrogator: Do you speak Dinosaur?\n\nKe$ha: I do. Do you wanna hear? Do you speak Dinosaur?\n\nInterrogator: No, I don't speak Dinosaur. Thank you.\n\nKe$ha: *speaks in Dinosaur*\n\nInterrogator: Are you talking to ghosts was we speak?\n\nKe$ha: No, I'm talking in Dinosaur! I'm talking to Mr. Peeps in Dinosaur. It's our secret language.\n\nInterrogator: Are you able to--\n\nKe$ha: *speaks in Dinosaur*\n\nInterrogator: So, let's talk tattoos. Shall we?\n\nKe$ha: I got some tattoos.\n\nInterrogator: Tattoos. Ah! You got more than one?\n\nKe$ha: Uh-huh.\n\nInterrogator: Tell me about the other ones.\n\nKe$ha: They're all really terrible. *shows inner lip tattoo* I got that one in prison.\n\nThat one was supposed to be a feather, but it looks like a leaf.\n\nThat one says, \"Yeah!\"\n\nInterrogator: Is it true you got one on your queen mum?\n\nKe$ha: What?\n\nInterrogator: Your queen mum.\n\nKe$ha: My mom?\n\nInterrogator: Cockney? Queen mum? Bum?\n\nKe$ha: Oh, my butt! No. *laughs* I'm wasted. No I'm not. *speaks Dinosaur*\n\nInterrogator: Do you prefer to record naked?\n\nKe$ha: Yeah.\n\n*Die Young Chorus*", "image": "https://images.genius.com/35589d0cffb642d113be2095d5389001.400x400x1.jpg"}], "artist": "Kesha"}