{"songs": [{"title": "Love it or Leave it Alone/Welcome to Jamrock (Unplugged)", "album": "Unplugged", "year": "2005-10-07", "lyrics": "[Alicia Keys]\nC'mon!\n\n[music begins]\n\n[Mos Def]\nYes yes yes...\nUh, a yes yes y'all (freak freak y'all)\nA-freak freak y'all!\nFreak freak y'all - fifteen!\n(Ohh!) A yes yes y'all\n[Put them hands in the air, y'all!]\n[Yo, now put them hands in the air y'all]\nWaddup, Brook-LYYYYYYYYYYYYYN!!\n\n[Common]\nAnd just clap your hands y'all\nA freak freak y'all - and ya don't stop\nA to the beat y'all - and ya don't stop\nA freak freak y'all - and ya don't stop\nA to the beat (y'alllllllllll!!!)\n\n[Common]\nYo, mad love for the culture\nSince the days of Adidas and hip-hop posters\nNow I host with Mos and just to boast to brag\nA bit about it, 'cause I cain't live without it\nSeen her on the streets when I was like ten\nEspecially's of a lagged and young black man\nDo backspins in backyards cause we rap harder\nPeople that lack {?}, now we black stars\nGift from God - they said we must be crazy\nNow they sayin Common, Nasir, and Jay-Z\nLeaders of tomorrow, follow the steps of\nAfricans rap in the ghettos makin it spressed up\nYo we bring the light, we do it tonight\nAlicia Keys and Mos Def bring it right\nWe come down and bam, and rock who I am\nCom Sense, yo; I'm wit the fam, yo\n\n[Chorus 2X - sung in tune of Brand Nubian's \"Love it or Leave It Alone\"]\nYou gotta love it, or leave it alone\nYou gotta love it, or leave it alone\nYou gotta love it, or leave it alone\nYou gotta love it, or leave it alone\n\n[Mos Def]\n(Mos Def) Yo, peep it out while I tell you like this\nA fresh to the soil, be sure you don't miss\nIt's the, true for ya, true feature\nI could go on for days about it screamin \"Alicia!\"\nWalkin down the block with brother Com Sense\nComrade Com Sense, so what the heck so I -\nShow this fresh girl that you always sure\nBefore and then my heart should be adored and\nCain't front, another ignore\nIt's Aquarius love and highly secure\nDaje Mahal, and really gettin in\nAnd fantasize of my life for a one or two winners\nAnd my man Com Sense just stopped and said\n\"Yo stop frontin' and use your head!\"\nA-said \"Yo stop frontin' and use your head!\"\nA-said \"Yo stop frontin' and use your FUCKIN head..\" (OHHHHH!!)\n\n[Chorus 2X with ad-libs]\n\n[Alicia Keys - interlude]\nRight about now, I wanna thank everybody for comin out\nAnd rockin with me tonight\nI wanna give a big-up, to my man Mos Def\nMy man Common Sense, my man Krucial\nMy man Ills, the whole M.B.K. fam\nThe whole Krucial Keys fam, and MTV\nAnd everybody out th-ere say \"yeah!!\" {*crowd cheers*]\nYeah!\nSaid everybody out th-ere say \"yeah!!\"\n(YEEEEEAHHH)\nC'mon, and alright\nI need y'all to give it up, for Pablo on percussion\nFor Paul John on drums, Onree Gill on M.D\nAnaysha, Sara, Jermaine, AND, Denise on backgrounds\nSteve on the bass, oh\nArtie on the gee-tar (yaaaay), Jeff's on the horns (oh)\nAYE-YAY-YAY, and the string quartets\nRay Chew and, the Crunks\nOh, oh (one-two), you know\n\n[Chorus 2X with ad-libs and variations]\n\nUh, WE WOOOOOOOOON!!\n\n[music changes to Damian \"Jr. Gong\" Marley's \"Welcome to Jamrock\"]\n\n[Alicia Keys - Intro]\nOh, oh, oh.. I wanna bring Damian Marley to the spot..\nUp in the streets, they call it murrrrrr-derrrr!\n\n[Damian \"Jr. Gong\" Marley]\nWelcome to Jamrock, camp where the thugs dem camp at\nTwo POUND ah weed inna van back\nIt inna your hand bag, your knapsack, it inna your backpack\nThe smell ah give your girlfriend con -\nSome bwoy nuh notice, dem only come around like tourist\nOn the beach with a few club sodas\nBedtime stories, pose like dem name Chuck Norris\nDon't know the real hardcore\nCause Sandals ah nuh Backtoo, the thugs dem will do when dem got to\nAnd WON'T think twice to shot you\nDon't make dem spot you, unless you carry guns a lot too\nA bare tuff tings come at you\nWhen, New York man stop laugh and lock-off traffic\nThen dem wheel AND pop off and dem start clap it\nWith the pin file dung an it ah beat drop it\nPolice come inna Jeep and dem can't stop it\nSome say them ah playboy ah Playboy Rabbit\n?Socialize? or get dropped like a bad 'abit\nSo nuh bodah pose tuff if you don't have it\nRastafari stands alone!\n\n[Chorus - with ad-libs]\nWelcome to Jamrock!\nWelcome to Jamrock!\n\n[Alicia] Up in the streets, they call it murrrrrr-derrrr!\n\n[Damian \"Jr. Gong\" Marley]\nJamaica, Jamaicaaaa, yeah\nJamaica, Jamaicaaaa, yeah\nJamaica, Jamaicaaaa, yeah\nJamaica, Jamaica! (Chi-Town)\n\n[Common]\nChi-Town, Chi-Town, and we gets down\nChi-Town, Chi-Town, and we gets down\nChi-Town, Chi-Town, and we gets down\nIt's Chi-Town, gettin all down c'mon\n\n[Alicia Keys (Mos Def)]\nNew York, New YOOOO-OO-ORK (New York, NEW YOOOORK)\nNew York, New YOOOO-OO-ORK (New York, NEW YOOOORK)\nNew York, New YOOOO-OO-ORK (New York, NEW Yooork)\nNew York, New YOOOO-OO-ORK (Brook-lyn!)\n\n[Damian \"Jr. Gong\" Marley with variations]\nSay wel-come to Jamrock...\nA-wel-come to Jamrock...\nWel-come to Jamrock...\n\n[Alicia Keys]\nUp in the streets, they call it MURRRRR-DERRRRRRRRRRAH!!\n\n[crowd cheers loudly]\n\n[Keys - outro]\nYeeeeeeeeAAAAAAAAAhhhhhh!!! (BOK BOK BOK BOK!)\nDamian Marley, ladies and gentlemen\nCommon Sense, Mos Def\nWE LOVE YOU, and we thank you, for rockin wit us!\nMuch LOOOOVE to the people, eh-haha ha...\nHahaha...BROOKLYYYYYYYN...\n\n[crowd cheers wildly as song fades]", "image": "https://images.genius.com/6f7227b56571735eefddf16380bbebb7.1000x1000x1.jpg"}], "artist": "Alicia Keys"}