{"songs": [{"title": "Unthinkable Remix (Lloyd Banks)", "album": null, "year": null, "lyrics": "[Lloyd Banks]\nHuh, you wondering how everything would look\nIf we do things our way, don't bother to read the book\nCause everything about you right, but I’ll be wrong\nKnow I’ll be dipping back and forth still stringing your heart along\nNew perspective,same song, yet I can’t help but have you\nGrab the love right out of you, and turn right around to stab you\nCause I’ve been stabbed too, crossed more than box cut feeling buried\nDeep in a box that I keep locked up. Shady past but you can brighten up my view\nCause when I’m standing next to you. Ain’t nothing I can’t do but\nYou deserve to have me with you like you with me\nThrough thick and thin ?\nSix feet, more than loyal ?\nHeard a couple about you too, but I ain't flipping out on you\nNever mind the jealous focus on what we do\nThrough tall waters, you're the mask I breathe through, I need you\n\n[Verse One - Alicia Keys]\nMoment of honesty\nSomeones gotta take the lead tonight\nWhose it gonna be?\nI’m gonna sit right here\nAnd tell u while it comes to me\nIf u have something to say\nU should say it right now (you should say it right now) (are you ready)\n\nU give me a feeling that I never felt before\nAnd I deserve it, I know I deserve it (let it go)\nIts become something that’s impossible to ignore\nAnd I can’t take it\n\n[Hook - Alicia Keys]\nI was wondering maybe\nCould I make you my baby\nIf we do the unthinkable will it make us look crazy (crazy)\nIf you ask me I’m ready\nIf you ask me I’m ready\n\n[Verse - Two - Alicia Keys]\nI know u said to me\n“This is exactly how it should feel when its meant to be”\nTime is only wasting so why wait for eventually\nIf we gonna do something about it\nWe should do it right now (we should do it right now)\n\nU give me a feeling that I never felt before\nAnd I deserve it, I know I deserve it\nIts become something that’s impossible to ignore\nIts what we make it\n\n[Hook - Alicia Keys]\nI was wondering maybe\nCould I make you my baby\nIf we do the unthinkable will it make us look crazy\nOr would it be so beautiful either way I’m sayin\nIf you ask me I’m ready\nIf you ask me I’m ready\n\n[Bridge - Alicia Keys]\nWhy give up before we try\nFeel the lows before the highs\nClip our wings before we fly away\nI can’t say I can’t compare\nI’m suspended it the air\nWon’t u come be in the sky with me\n\n[Hook - Alicia Keys]\nI was wondering maybe\nCould I make you my baby\nIf we do the unthinkable will it make us look crazy (crazy)\nOr would it be so beautiful either way I’m sayin\nIf you ask me I’m ready\nIf you ask me I’m ready", "image": "https://images.genius.com/38a105840763b3cef597180a5f426321.441x441x1.png"}], "artist": "Alicia Keys"}