{"songs": [{"title": "Try Sleeping With A Broken Heart (Remix)", "album": null, "year": null, "lyrics": "(Maino)\n\nYea, yea, yea yea, like photos in my mind, you the vision in my dreams, and what I see is perfect, I picture you my queen. staring at your\nFinger got me picturing the ring, you my 50 inch plasma the picture in my screen, but something ain't adding up, my math ain't equaling, you looking for the love, im selfish with my feelings eh. pushing for commitment im running from commitment, scared to open up and you wonder why im distant, trying to push away, youre the only one that knows me, feelings in the air. im afraid you might expose me, I don't mean to leave you heartbroken sleepless but im scared to give you my heart and you keep it\n\n(Alicia Keys)\n\nEven if you were a million miles away\nI could still feel you in my bed\nNear me, touch me, feel me\nAnd even at the bottom of the sea\nI could still hear inside my head\nTellin' me, touch me, feel me\nAnd all the time you were tellin' me lies\n\nSo tonight, I'm gonna find a way to make it without you\nTonight I'm gonna find a way to make it without you\nI'm gonna hold on to the times we had tonight\nI'm gonna find a way to make it without you\n\nHave you ever tried sleeping with a broken heart?\nWell, you could try sleeping in my bed\n\nLonely, on me nobody ever shut down it down like you\nYou want a crown\nYou made my body feel heaven bound\nWhy don't you hold me\nNear me, I thought you told me\nYou'd never leave me\n\nLooking in the sky I could see your face\nAnd I know right where I fit in\nTake me, make me\nYou know that I'll always be in love with you right til the end OOh\n\nSo tonight, I'm gonna find a way to make it without you\nTonight I'm gonna find a way to make it without you\nI'm gonna hold on to the times we had tonight\nI'm gonna find a way to make it without you\n\nAnybody could've told you right from the start\nIt's bound to fall apart\nSo rather than hold on to a broken dream\nWe'll just hold on to love\nAnd I could find a way to make it\nDon't hold on too tight\nI'll make it without you tonight\n\nSo tonight, I'm gonna find a way to make it without you\nTonight I'm gonna find a way to make it without you\nI'm gonna hold on to the times we had tonight\nI'm gonna find a way to make it without you", "image": "https://images.genius.com/38a105840763b3cef597180a5f426321.441x441x1.png"}], "artist": "Alicia Keys"}