{"songs": [{"title": "You Don’t Know My Name (Remix)", "album": null, "year": null, "lyrics": "[Raekwon]\nRead the fish, get the red lobster, tilt your glass, seen shorty ass\nThat's what's happenin', son, pass the hot sauce\nStraight vibes, corner to corner, me and my mans glanced at her\nThe look, sure do prove she a woman\nYo, good morning, mamma, what you ordering, right now, some water\nAnd it hit me, mami was a dime and a quarter\nThirty five cent, thirty five dollars or thirty five bricks\nThat's live, then I seen her eye and blew a kiss\n[Alicia Keys]\nBaby, baby, baby, from the day I saw you\nI really, really wanted to catch your eye\nThere's something special 'bout you\nI must really like you\nCause not alotta guys are worth my time\nOooh baby, baby, baby, it's gettin kinna crazy\nCause you are takin' over my mind\n\n[Hook: Alicia Keys]\nAnd it feels like, OooOooooOOo...\nYou don't know my name, I swear\nIt feels like, OooOooooOOo...\nYou don't know my name\nRound and round and round we go\nWill you ever know?\n\n[Alicia Keys]\nOh! Baby, baby, baby\nI see us on our first date\nYou doin everything that makes me smile\nAnd when we had our first kiss\nIt happened on a Thursday\nOoh, it set my soul on fire\nOh, baby, baby, baby\nI can't wait for the first time\nMy imaginations runnin' wild\n\n[Hook: Alicia Keys]\nAnd it feels like, OooOooooOOo...\nYou don't know my name\nAnd I swear it, baby\nIt feels like, OooOooooOOo...\nYou don't know my name\nRound and round and round we go\nWill you ever know?\n\n[Interlude: Alicia Keys]\nI'm sayin'\nHe don't even know what he's doin to me\nGot me feelin' all crazy inside\nI'm feelin' like... OH!\n\n[Polite]\nYo, yo, I met you in the restaraunt, see you every wednesday\nFly little waiter, so we exchanged data\nIt took a while, I ain't even think you would call\nYou used to walk by, you once said nothing at all\nI ordered a special, know that every time that I do\nI ordered the chocolate, a soda, just reminds me of you\nSo you holla out of the blue (damn), gotta catch a flight\nWhen I touchdown, shorty, I'mma holla at you\n\n[Alicia Keys]\nI'm doin nothn I've ever done, for anyone's attention\nTake notice of what's in front of you, cause did I mention? (OH!)\nYou about to miss a good thing\nAnd you'll never know how good it feels to have\nAll of my affection\nAnd you'll never get a chance to experience\nMy lovin (OH!)\nCause my lovin' feels like...\n\n[Hook: Alicia Keys]\nOooOooooOOo...\nYou don't know my name\nRound and round and round we go (and I swear)\nWill you ever know? (it feels like)\nOooOooooOOo...\nYou don't know my name\nRound and round and round we go\nWill you ever know?\nWill you ever know it? No, no, no, no, no\nWill you ever know it?\n\n[Interlude: Alicia Keys]\nWell I'mma have to just gon head and call this boy\nHello? Can I speak to... to Michael? Oh, hey how you doin'\nI feel kinna silly doin' this but uh, this is the waitress\nFrom the coffee house on 39th and Lenox\nYou know the, one with the braids?\nYeah... well I see you on Wednesdays all the time\nYou come in every Wednesday on your lunch break, I think\nAnd you always order the special, with the hot chocolate\nLook man, I mean, I know girls don't usually do this\nBut I was wonderin' if maybe we could get together\nOutside the restaurant one day?\nYou know cause I do look...\nA little different outside my work clothes\nWait, hold up my... my cell phone\nBreakin up, hold up\nCan you hear me now?\nYeah so what day did you say?\nOh yeah... Thursday's perfect man\n\n[Hook: Alicia Keys]\nAnd it feels like, OooOooooOOo...\nYou don't know my name\nRound and round and round we go (baby, baby I swear)\nWill you ever know? (it's like)\nOooOooooOOo...\nYou don't know my name\nRound and round and round we go\nWill you ever know?...\n\n[Outro: Polite]\nBaby, be mine, bitch.. hahah", "image": "https://images.genius.com/38a105840763b3cef597180a5f426321.441x441x1.png"}], "artist": "Alicia Keys"}