{"songs": [{"title": "You Don’t Know My Name (Roc-A-Fella remix) (feat. Freeway)", "album": null, "year": null, "lyrics": "Baby, baby, baby\nFrom the day I saw you\nReally, really wanted to catch your eye\nSomethin' special 'bout you\nI must really like you\n'Cause not a lot of guys are worth my time\n\nOh baby, baby, baby\nIt's getting kind of crazy\n'Cause you are taking over my mind\n\n(Chorus)\nAnd it feels like oooooh\nYou don't know my name\nI swear, it feels like ooooooh\nYou don't know my name\n(round and round and round we go, will you ever know)\n\nOh! Baby, baby, baby\nI see us on our first date\nDoing everything that makes me smile\nWhen we had our first kiss\nIt happened on a Thursday\nOoh it set my soul on fire\nOooh Baby, baby, baby\nI can't wait for the first time\nMy imagination's running wild\n\n(Chorus)\nIt feels like oooooh\nYou don't know my name\nAnd I swear it baby, it feels like ooooooh\nYou don't know my name\n(Round and round and round we go, will you ever know)\n\nI'm sayin', he don't even know what he's doing to me\nGot me feelin' all crazy inside\nI'm feelin' like, Oh!\nDoing nothing I've ever done, for anyone's attention\nTake notice of what's in front of me\n'Cause did I mention (oh!) You bout' to miss a good thing\nAnd you'll never know how good it feels\nTo have, all my affection\nAnd you'll never get a chance to experience, my lovin (oh!)\n'Cause my lovin feels like\n\n(Chorus)\nOooooh\nYou Don't Know my name\nAnd I swear it feels like\nOooooooh\nYou Don't my name\n\nWill you ever know it?\nI'm going to have to go ahead and just call this boy\nHello, can I speak to..to Michael\nOh hey, how ya' doin'?\nI feel kinda' silly doin' this, but uh\nThis is the waitress from the coffee house on 39th and Lennox\n(Chuckle) you know the one with the braids?\nYeah\nWell I see you on Wednesday's, all the time\nYou come on every Wednesday on your lunch break I think\nYou always order the special, with the hot chocolate\nLook man I mean, I know girls don't usually do this\nBut I was wonderin'\nIf maybe we could get together outside the restaurant one day\nYou know, 'cause I do look a lot different outside my work clothes\n(Chuckle) Wait a minute, my cell phones breakin' up\nCan you hear me now?\nYeah, so what day did you say?\nOh, Thursday's perfect\n\n(Chorus)\nAnd it feels like oooohhh\nYou Don't Know My name\nAnd I swear on my mother and father it feels like\nOooooooh\nOooooooh\nOh-oh-oh-oh-oh-oh-oh-oh\nWill you ever know?", "image": "https://images.genius.com/38a105840763b3cef597180a5f426321.441x441x1.png"}], "artist": "Alicia Keys"}