{"songs": [{"title": "The Gospel", "album": "HERE", "year": "2016-09-22", "lyrics": "[Intro: Method Man + Raekwon [+ Ghostface]\nOh yeah, coming through with my Shaolin crew\nTwo cent for a case, gimme St. Ide's brew\nIn the midst of broken bottles and crushed up cans\nMethtical's in a jam, oh how dry I am\nWith St. Ides in my system\nCrack another I'm blessed, let's go get the next one\nAnd get over, the object is to stay sober\nLay on the sofa, better yet, dial my chauffeur\nCall me the Wallabee Champ, stretched out, could never be Son\nRicochet daily hit the deli for a cold one\nNaturally blessed, yes, my rap is like a laser beam\nLaser beam, laser beam, laser beam...\n\n[Intro: Alicia Keys]\nUh, uh, uh\nSing\n\n[Verse 1: Alicia Keys]\nSo we all got children, products of the ghetto\nMomma cooked the soup, daddy did the yelling\nUncle was a drunk, cousin was a felon\nWhen he got pitched, he told them he wasn't tellin'\nAuntie was a cook, her husband was a crook\nCause every job he had they be payin' him off the books\nGhetto university, knowledge is all it took\nIn a tenement I was listenin' to the hook\nChange gon' come, the spirit of Sam Cooke\nWhen the feds comin', everybody be shook\nNow we doin' life like Eddie Murphy and Martin\nOn the chain gang, I was singing into the coffin\n\n[Pre-Chorus: Alicia Keys]\nThe roaches and the rats, heroin and the cracks\nCouldn't blame me, I'm just giving the facts\nI'm tryna hit the top, cause' bottom ain't where it's at\nEverybody got a past but you can never go back\n\n[Chorus: Alicia Keys]\nOh, oh, oh, oh\nOh, oh, oh, oh\nSing\nYeah, yeah, yeah, yeah (Sing)\nYeah, yeah, yeah, yeah (Sing)\nYeah, yeah, yeah, yeah (Sing)\nYeah, yeah, yeah, yeah (Sing)\n\n[Verse 2: Alicia Keys]\nTellin' you like it is, how we ever gon' live?\nIf we ain't gettin' money, how we feedin' the kids?\nIt's a revolving door, where brothers be doin' bids\nI know it sound wrong but the door will be what it is\nSurvival of the fittest, this poor girl the illest\nBroke parents and black cats give me heebie-geebies\nLife seems hard but nothin' ever comes easy\nWhatever's in the dark, can always become the light\nIf you ain't in a battle, how you gon' win the fight?\nI gotta speak the truth when I'm up in the booth\nThe streets be flyin' birds but they don't be on the roof\nPoverty is a pain like you pullin' a tooth\nTold the streets don't let me go like I'm Bishop in Juice\n\n[Pre-Chorus: Alicia Keys]\nRoaches and the rats, heroin and the cracks\nCouldn't blame me, I'm just giving the facts\nTryna hit the top, the bottom ain't where it's at\nEverybody got a past but you can never go back\n\n[Chorus: Alicia Keys]\nOh, oh, oh, oh\nOh, oh, oh, oh\nOh, oh, oh, oh\nSing\nYeah, yeah, yeah, yeah (yeah)\nYeah, yeah, yeah, yeah (yeah)\n(Gotta sing)\nYeah, yeah, yeah, yeah (yeah)\nYeah, yeah, yeah, yeah (yeah)\n\n[Outro]\nOh, oh, oh, oh\nOh, oh, oh, oh\n(Sing)\nYeah, yeah, yeah, yeah\n\nYeah, yeah, yeah, yeah\n(Sing)\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah\n(Gotta sing)\nYeah, yeah, yeah, yeah\n\nYeah, yeah, yeah, yeah\n(She's a king)\nYeah, yeah, yeah, yeah (yeah)\nYeah, yeah, yeah, yeah (yeah)\nAnd they sing New York City\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah", "image": "https://images.genius.com/4d46e56b4950d2b18a8a745d1fb4918a.1000x1000x1.jpg"}], "artist": "Alicia Keys"}