{"songs": [{"title": "The Gospel (Short Film)", "album": "HERE", "year": null, "lyrics": "Note: \"MAN 1,\" \"MAN 2,\" and others are not continuous characters between scenes.\n\n[Dialogue begins, all in voiceover]\n\nMAN 1: So my buddy, who was on the job, laughs, true story, he got a call over, or whatever. There's some kid hanging out, they're smoking pot. So he smells and goes, \"what're you doing?\"\n\nMAN 2: (indistinctly) Yeah.\n\nMAN 1: (imitating kid)\"Nothing, nothing.\"\n\nAnd he's like, \"Dude, just like, why you smoking in the hallway? Someone's gonna call us, and you're playing music, you're just doing stupid shit, right?\"\n\nSo he tells his partner, \"just wait right here, I wanna check something.\"\n\nSo he goes behind and he finds the bag. He puts his gun there. So he goes, \"alright, bring the kid down.\"\n\n\"So, uh, am I going to find anything?\"\n\nKid says, \"you know, nah, you're not going to find anything.\"\n\n\"You're sure I'm not going to find anything.\"\n\n(imitating kid)\"No, you're not going to find anything, Officer.\"\n\nHe's being a wise-ass. So he goes behind the plant and he goes, ha, \"Oh, you got pot here? exaggeratedOh, my, and your little fucking weapon?\"\n\n(imitating kid, panicking)\"No, no, that's not mine, Officer, that's not mine!\"\n\nHe goes, \"Holy shit, we gotta call this in, you're going away for a long time.\" Kid starts freaking out.\n\nMAN 2: (over MAN 1, laughing, indistinct) He's shitting his pants.\n\nMAN 1: Oh, and he's shitting his pants. At this point he's like crying, he's not such a tough guy now.\n\n\"You sure this is not yours?\"\n\n(imitating kid, panicking)\"Oh my god, it's not mine!\"\n\n\"Oh, I guess it's mine.\" Puts it back in his holster, takes the bag apart -\n\nMAN 2: (laughing) Probably used it.\n\nMAN 1: Oh, no, he definitely did. He told me. He's like, \"I took it. No big deal.\"\n\nMAN 2: (chuckles) That's awesome.\n\nMAN 1: You know why I tell you this story? You know why?\n\nMAN 2: Why?\n\nMAN 1: Because you have to have a little fun sometimes.\n\n[Dialogue fades, cuts to short rap sample]\n\nALICIA KEYS: (voiceover) This is my New York. These buildings, these hallways, these conversations. They raise me. So much wisdom. So much pain.\nMUSIC CUE: \"The Gospel\"(only partial part of \"The Gospel\")\nCHAPTER ONE: ALL GOD'S CHILDRENALICIA KEYS: (sighs, rustles papers, and then sings gently) Sometimes, you gotta let it go.\n\nALICIA KEYS: (hums, scat-singing) I know...\nMUSIC CUE: \"Pawn It All\"CHILD 1: (over music, shouting) Yeah? Hold up, bro! Let me down, higher!\n\nCHILD 2: I copy!\n\nALICIA KEYS: (voiceover) What's one thing you wish someone would've told you as a child?\n\nMAN 1:  (voiceover) Time's precious. Time is very precious.\n\nWOMAN: (voiceover) Keep your circle small. Real small.\n\nCHILD 2: Know who I am? You know who I am, man?\n\n[Children yelling]\n\nMAN 2: (voiceover) I wish I was taught how to listen. I was taught to listen to the elders, to my parents, like. Like, he lived his life already. My father told me, he said, \"when you get my age, when you get older and have a child, you're gonna be like, damn, I should've listened to this dude.\" And I spend every day of my life like, \"damn. Didn't listen.\"\n\nMAN 3: (voiceover) I wish someone would've told me how fast-paced life goes. It's like, you go to sleep one day, and you wake up the next and you're...30. You're, like, old.\n\nCHILD 3: You know the nigga off a Barbie? The nigga 10?\n\nOTHER CHILDREN: Damn.\n\n[Children banter]\n\nCHILD: 9...8...7...6...5...4...3...2...1!\n\nALICIA KEYS: (voiceover) What's something you wish someone would've told you as a child?\n\nCHILDREN: (yelling, banging on front of police car) Ahh!\n\nOFFICER: (indistinctly, as kids bang on car) Hey! Hey! You shitheads get off the car!\n\nCHILD 4: You want it, officer?\n\nOFFICER: You think you can talk that way? Try that again!\n\nCHILD 5: You can't do shit! You can't do-\n\nOFFICER: (grabbing child's hat and head, grunting)Yeah.\n\nCHILD: Get off of me!\nCHAPTER TWO: SWEET GIRLWOMAN: (voiceover) Why, I wish somebody would've told me about guys when I was like, growing up, you know. Know your worth, like, don't let nobody just come walk all over you, like, you have to know your worth and we're worth a lot.\nMUSIC CUE: \"She Don't Really Care_1 Luv\"WOMAN 1: (over the phone, energized, emphatic) ...all day! I told them no...[indistinguishable]...what? The man came up to me he's like, what's your problem?\n\nMAN 1: (out of car window at WOMAN 1) How you doin', sweetheart? 3-4-7...\n\nWOMAN 1: (looks over at MAN 1, exhales, exasperated)\n\nMAN 1: ...2-9-8...\n\nWOMAN 1: (over the phone) No. I don't have time for nothing else today, seems like -\n\nMAN 1: That's your man? Tellin' him he's supposed to be here -\n\nWOMAN 1: (over the phone) - people's getting on my last nerve, like.  (addresses MAN 1) Hold on. This my mother.\n\nMAN 1: Oh, my fault, my fault. What's up, though, there's 24 hours in a day and I can't get 5 minutes of your fuckin' time?\n\nWOMAN 1: (over the phone) Hold on. (to MAN 1) What? You need to be in the driver's side to talk to me.\n\nMAN 1: (high-pitched, affected) She's crazy! Do you see this? (returns to normal pitch) You have to make me come out this car to come get you...rah! Stop playin' with it.\n\n[Scene cuts to WOMAN 2 walking on street and hitchhiking; WOMAN 2 gets in car]", "image": "https://images.genius.com/4d46e56b4950d2b18a8a745d1fb4918a.1000x1000x1.jpg"}], "artist": "Alicia Keys"}