{"songs": [{"title": "Boys (The Co-Ed Remix)", "album": "Greatest Hits: My Prerogative", "year": "2002-07-29", "lyrics": "[Intro: Britney Spears]\nFor whatever reason\nI feel like I've been wanting you all my life\nYou don't understand?\nI'm so glad we're at the same place at the same time\nIt's over now\n\n[Verse 1: Britney Spears]\nI spotted you dancing, you made all the girls stare\nThose lips and your brown eyes (ooh), and the sexy hair\nI should shake my thang, make the world want you\nTell your boys you'll be back, I wanna see what you can do\n\n[Pre-Chorus 1: Britney Spears]\nWhat would it take for you to just leave with me?\nNot tryna sound conceited\nBut you and me were meant to be\nYou're a sexy guy, I'm a nice girl\nLet's turn this dance floor into our own little nasty world\n\n[Chorus 1: Britney Spears]\nBoys, sometimes a girl just needs one (You know I need you)\nBoys, to love her and to hold (I just want you to touch me)\nBoys, and when a girl is with one\nBoys, then she's in control\n\n[Verse 2: Pharrell Williams & (Britney Spears)]\nPull the girl off the dance floor, whisper her in ear\nMust've said something about me (So, what you say?)\n'Cause now she's looking over here\nYou looking at me, with that sexy attitude\nBut the way your girls moving it, it puts me in the mood\n\n[Pre-Chorus 2: Pharrell Williams & (Britney Spears)]\nWhat would it take for you to just leave with me?\nNot tryna sound conceited, but meeting you was destiny\nI'm from N.E.R.D. (Ooh)\nAren't you Britney? (Don't you know?)\nLet's turn this dance floor into our own little nasty thing\n(Get nasty!)\n\n[Chorus 2: Pharrell Williams & Britney Spears]\nGirls, I can't speak for no one (I get nasty)\nGirls, well, I need her all the time (I get nasty)\nGirls, I don't know 'bout your girl (I get nasty)\nGirls, but I know she's judging mine (You like that?)\n\n[Chorus 1: Britney Spears]\nBoys, sometimes a girl just needs one (I get nasty)\nBoys, to love her and to hold (I get nasty)\nBoys, and when a girl is with one (I get nasty)\nBoys, then she's in control\n\n[Bridge: Britney Spears]\nYou like that?\nHere we go\nHave no fear\nBaby, what you waiting for?\nUh-uh\nLet me see what you can do\n\n[Chorus 1: Britney Spears]\nBoys, sometimes a girl just needs one\nBoys, to love her and to hold (The way that you move)\nBoys, and when a girl is with one (Is kinda turning me on)\nBoys, then she's in control (oh)\n\n[Chorus 2: Pharrell Williams & Britney Spears]\nGirls, I can't speak for no one\nGirls, well, I need her all the time (It's just me and you, baby)\nGirls, I don't know 'bout your girl\nGirls, but I know she's judging mine (Get nasty)\n\n[Outro: Britney Spears & Pharrell Williams]\nBoys\nGirls\nBoys\nGirls\nBoys (Can't live with 'em)\nGirls\nBoys (Can't live without 'em)\nGirls\nGet nasty!", "image": "https://images.rapgenius.com/6e9655a71e2f6d408083568461bf8193.600x600x1.jpg"}], "artist": "Britney Spears"}