{"songs": [{"title": "Boys", "album": "Britney", "year": "2001-11-05", "lyrics": "[Verse 1]\nFor whatever reason\nI feel like I've been wanting you all my life\nYou don't understand?\nI'm so glad we're at the same place at the same time\nIt's over now\nI spotted you dancing\nYou made all the girls stare\nThose lips and your brown eyes (Ooh)\nAnd the sexy hair\nI should shake my thing\nI make the world want you\nTell your boys you'll be back\nI wanna see what you can do\n\n[Pre-Chorus]\nWhat would it take for you to just leave with me?\nNot tryna sound conceited, but me and you were meant to be\nYou're a sexy guy, I'm a nice girl (Don't you know?)\nLet's turn this dance floor into our own little nasty world\n\n[Chorus]\nBoys, sometimes a girl just needs one (You know I need you)\nBoys, to love her and to hold (I just want you to touch me)\nBoys, and when a girl is with one\nBoys, then she's in control\n\n[Verse 2]\nTook the boy off the dance floor\nScreaming in his ear\nMust've said something 'bout me (What you say?)\nBecause he's looking over here\nYou looking at me with a sexy attitude\nBut the way your boys moving it\nIt puts me in the mood (Ow!)\n\n[Pre Chorus]\nWhat would it take for you to just leave with me?\nNot tryna sound conceited, but me and you were meant to be (Don't you know?)\nYou're a sexy guy, I'm a nice girl (Don't you know?)\nLet's turn this dance floor into our own little nasty world\n\n[Chorus]\nBoys, sometimes a girl just needs one (I get nasty)\nBoys, to love her and to hold (I get nasty)\nBoys, and when a girl is with one (I get nasty)\nBoys, then she's in control (You like that? Here we go)\n\n[Bridge 1]\nTonight, let's fly, boy, have no fear (Have no fear)\nThere's no time to lose (What are you waiting for?)\nAnd next week, you may not see me here\nSo, boy, just make your move (Let me see what you can do)\n\n[Chorus]\nBoys, sometimes a girl just needs one\nBoys, to love her and to hold (The way you move)\nBoys, and when a girl is with one (It's gon' turn me on)\nBoys, then she's in control\n\n[Bridge 2]\nCome with me, let's fly into the night\nOh, boy, tonight is ours (It's just you and me, baby)\nKeep loving me, make sure you hold me tight\nLet's head for the stars (Get nasty)\nOw!\n\n[Chorus]\nBoys, sometimes a girl just needs one\nBoys, to love her and to hold (Get nasty)\nBoys, and when a girl is with one (Get nasty)\nBoys, then she's in control\n\n[Outro]\nCan't live with 'em, can't live without 'em", "image": "https://images.genius.com/3395aeb0e2874c0453ed552a579240eb.1000x1000x1.jpg"}], "artist": "Britney Spears"}