{"songs": [{"title": "Haunted", "album": "BEYONCÉ", "year": "2013-12-13", "lyrics": "Part 1: Ghost\n\n[Intro: Young Beyoncé & (Presenter)]\n(The winner is Beyoncé Knowles: female pop vocalist!)\nI would like to thank the judges for picking me\nMy parents who I love, I love you, Houston\n\n[Verse 1]\nAnd I've been drifting off on knowledge\nCat-calls on cat-walks, man these women getting solemn\nI could sing a song for a Solomon or Salamander\nWe took a flight at midnight and now my mind can't help but wonder:\nHow come?\nSpoon-fed pluralized eyes to find the beaches in the forest\nWhen I'm looking off the edge, I preach my gut it can't help but ignore it\nI'm climbing up the walls cause all the shit I hear is boring\nAll the shit I do is boring, all these record labels boring\nI don't trust these record labels, I'm torn\nAll these people on the planet working 9 to 5 just to stay alive\nThe 9 to 5 just to stay alive, the 9 to 5 just to stay alive\nThe 9 to 5 just to stay alive, the 9 to 5 just to stay alive\nThe 9 to 5 just to stay alive, the 9 to 5 just to stay alive\nAll the people on the planet working 9 to 5 just to stay alive, how come?\n\n[Chorus]\nWhat goes up ghost around\nGhost around, around, around, around\nWhat goes up ghost around\nGhost around, around, around, around\nWhat goes up ghost around\nGhost around, around, around, around\n\n[Bridge]\nAround, around, around, around, around, around, around\nAround, around, around, around, around, around, around\nAround, around, around, around, around, around, around\n\n[Outro]\nSoul not for sale\nProbably won't make no money off this, oh well\nReap what you sow\nPerfection is so, mmm\n\nPart 2: Haunted\n\n[Verse 1]\nIt's what you do, it's what you see\nI know if I'm haunting you, you must be haunting me\nIt's where we go, it's where we'll be\nI know if I'm onto you, I'm onto you\nOnto you, you must be on to me\nMy haunted lungs, ghost in the sheets\nI know if I'm onto you, you must be haunting me\nMy wicked tongue, where will it be?\nI know if I'm onto you, I'm on to you\nOnto you, I'm onto you\nOnto you, you must be on to me\n\n[Bridge]\nYou want me? I walk down the hallway\nYou like it? The bedroom's my runway\nSlap me! I'm pinned to the doorway\nKiss, bite, foreplay\n\n[Verse 2]\nMy haunted lungs, ghost in the sheets\nI know if I'm haunting you, you must be haunting me\nMy wicked tongue, where will it be?\nI know if I'm onto you, you must be onto me\nIt's what we see\nI know if I'm haunting you, you must be haunting me\nIt's where we go, it's where we'll be\nI know if I'm onto you, I'm onto you\nOnto you, I'm onto you\nOnto you, you must be onto me\nYou must be onto me\nYou must be onto me\nYou must be onto me\n\n[Outro]\nOn to you, I'm on to you\nOn to you, I'm on to you\nOn to you, I'm on to you\nOn to you, I'm on to you\nMe, me, me", "image": "https://images.genius.com/60bf9993b5085ae2c484e7d0425e88c8.1000x1000x1.jpg"}], "artist": "Beyoncé"}