{"songs": [{"title": "Fighting Temptation", "album": "The Fighting Temptations: Music from the Motion Picture", "year": null, "lyrics": "[Intro - Beyonce]\nFighting temptation\n\n[Missy]\nYo Beyonce, Free, MC Lyte, y'all ready\nLet it put it down for the clubs\n\n[Beyonce + Missy + Free + MC Lyte]\nLadies! HEY! we got that beat that make you jump\nTo my fellas! whoo! I got them cars them ladies love\nParty People! yeah! we gonna party all night\nAnd let yo soul, work! ooo! and let yo soul keep on workin' out\n\n[Verse 1 - Missy] + (Missy, Beyonce, MC Lyte, Free)\nI'm the type of chick, who be fightin' temptation\nMake you wait, before we have a relation\nPlayboy, holla at me lata'\nDon't you know I'm managed by Violator\n(They shootin'), I'm exterminator\nI look good, so hate me hater\nMe and my girls drinkin', where's the waiter\nCheatin' guys, I already played ya\nLadies night don't suffocate us\nIf you touch us, we gonna altercation\nWarn Missy, you's impersonator\nI got so much ice, I even scare Jacob\n(Beyonce, MC Lyte, and Free)\n(Missy, put it down on da beat)\nParty people, it's good sensation\nWe gonna show you, how to fight temptation\n\n[Hook - Beyonce]\nI'm just fighting temptation (Yeah)\nGotta get more control (Control, yeah)\nYet it's very tempting when you ask to take me home (Home)\nYou know you want my love (Love)\nI don't think the time is right (No)\nCall when I'm ready, but it won't be tonight\n\n[Verse 2 - Free]\nWe in the club, Free gully no doubt\nSee this real deal playa, starin' dead in my mouth\nHe got his crew, but I got mine too\nSend a note to my table like, what you gonna do\nEye game got him spreadin' me out\nIn my ear dry tears, how he left his spouse\nAnd oh, the nice cars, and impressive house\nHe want to run up in, I ain't no regular route (Hoooo!)\nMe and the girls, we ain't stressin' out\nWe ain't birds, we ain't headin' south (Noooo!)\nThem one nighters, that's sad and doubt\nThat little talk on da creep ,what you said is out\nI gets cheddar, to help me do what ever\nNo beef with Dennis Edwards, but I fight temptation\nI'm not sayin' I don't like temptation\nI'm just lookin' for da right temptation, ya kno'\n\n[Hook]\n\n[Verse 3 - MC Lyte]\nYeah, party liked I never partyed before\nI hit the door, all the dudes hit the floor\nSweet, they messin' wit the brown sugar queen\nFightin' temptation, like Layla Ali\nWit the 1, 2, let me show you what the hon' do\nWhen I come through, wit the butta dip crew\nNow, show me that you got my back\nLove me from, where you at\nI got eyes up, over my shoulder\nIf you should decide, to get closer (Hooo!)\nWell then this dance, is straight over\nI'm gone, and Missy's Testaroasa\n\"Be cool\", thay what Free say\nB. say, \"Keep it clean but give them lee way\"\nAll I know, it's a crazy sensation\nYou fine, but I'm fightin' temptation\n\n[Hook]\n\n[Outro - Beyonce] + (Missy) + {Free}\nWooooooo\n(We goin' show you how to fight temptation)\nMy love, yeah\n{I'm jus' lookin for da right temptation}\n{[*Cut and Stratch - \"Fight temptation*]}\nWooooo, yeah, yeah, yeah\n(We goin' show you how to fight temptation)\n{I'm jus' lookin for da right temptation}\n{[*Cut and Stratch - \"Fight temptation*]}\nYeah, yeah, yeah, woooooo\n\n[Beyonce + Missy + Free + MC Lyte]\nW-w-what you gonna do (Hoo-hoo)\nW-w-what you gonna do (Hoo-hoo)\nW-w-what you gonna do (Hoo-hoo)", "image": "https://images.genius.com/55b47f78ca0815c9cb370253ee0b33cb.220x220x1.jpg"}], "artist": "Beyoncé"}