{"songs": [{"title": "Beyoncé VMA’s 2014", "album": null, "year": "2014-08-25", "lyrics": "MUSIC CUE: MINE\n\nI've been watching for the signs\nTook a trip to clear my mind\nNow I'm even more lost\nAnd you're still so fine, oh my oh my\nBeen having conversations about breakups and separations\nI'm not feeling like myself since the baby\nAre we gonna even make it? Oooh\nCause if we are, we're taking this a little too far\nMe being wherever I'm at, worried about wherever you are\nWe're taking this a little too far\n\n[Background Vocals: Drake]\nKnow you wanna roll with a good girl?\nDo it big do it all for a good girl\nOne time, this is a song for the good girl\nDon't sleep when you know you got it good girl\nOne time, this is a song for the good girl\nWanna roll, wanna roll with a good girl\nOne time, this is a song for the good girl\nAnd I still keep it hood, still treat you like I should\nWassup\n\nOn my mind up past my bedtime, no rest at the kingdom\nAlone in my place, my heart is away\nAll that I can think of is, we should get married\nWe should get married\nLet's stop holding back on this and let's get carried away\n\nStop making a big deal out of the little things\nCause I got big deals and I got little things\nGot everything I'm asking for but you\nStop making a big deal out of the little things, let's get carried away\nCome right now, you know where I stay\n\nI just wanna say, you're mine, you're mine\nI just wanna say, you're mine, you're mine\nFuck what you heard, you're mine, you're mine\n\nMTV Welcome to my world!\n\nMUSIC CUE: GHOST\n\nReap what you sow\nPerfection is so... Mm\n\n[Background Vocals]\nThe 9 to 5, just to stay alive\nThe 9 to 5, just to stay alive\nThe 9 to 5, just to stay alive\nThe 9 to 5, just to stay alive\nThe 9 to 5, just to stay alive\nThe 9 to 5, just to stay alive\n\nMUSIC CUE: PRETTY HURTS\n\n[Background Vocals]\nWhat is your aspiration in life?\nMy aspiration in life would be... to be happy\n\nMUSIC CUE: HAUNTED\n\n(What goes up, ghost around)\nIt's what you do\nIt's what you see\nI know if I'm haunting you\nYou must be haunting me\nIt's where we go\nIt's where we'll be\nI know if I'm on to you, I'm on to you\nOn to you, you must be on to me\n\nYou want me?\nI walk down the hallway\nYou're lucky\nThe bedroom's my runway\nSlap me!\nI'm pinned to the doorway\nKiss, bite, foreplay\n\nMUSIC CUE: NO ANGEL\n\nRide around\nWe ride around in that H-town\nIf there's candles near your bed, no need for a spell\nStop acting so scared, just do what I tell\nFirst go through my legs, go back on your head\nAnd whatever you want, yeah baby I'll bet it comes true\n\nBaby put your arms around me\nTell me I'm the problem\nKnow I'm not the girl you thought you knew and that you wanted\nUnderneath the pretty face is something complicated\nI come with a side of trouble\nBut I know that's why you're staying\n\nBecause\nYou're\nNo\nAngel\nEither, baby\n\nMUSIC CUE: JEALOUS\n\nSometimes I want to walk in your shoes\nDo the type of things that I never ever do\nSo I take one look in the mirror and I say to myself\n\"Baby girl, you can't survive like this.\"\n\nNo, no, no\n\nAnd I hate you for your lies and your covers\nAnd I hate us for making good love to each other\nAnd I love making you jealous but don't judge me\nAnd I know that I'm being hateful but that ain't nothing\nThat ain't nothing\nI'm just jealous\nI'm just human\nDon't judge me\n\nIf you keeping your promise, I'm keeping mine\n\nMUSIC CUE: BLOW\n\nMust be good to you\n(Keep me coming, keep me going), keep me coming, keep me going\n(Keep me humming, keep me moaning), keep me humming, keep me moaning\n(Non-stop love until the morning), Non-stop love until the morning\n(Non-stop screaming, freakin, blowin') Blow-o-o\n\nI can't wait till I get home so you can tear that cherry out, (turn that cherry out, turn that cherry out)\nI can't wait till I get home so you can tear that cherry out, (turn that cherry out, turn that cherry out)\nI want you to\n(Turn that cherry out, turn that cherry out)\n\nMUSIC CUE: DRUNK IN LOVE\n\nI've been drinking, I've been drinking\nI get filthy when that liquor get into me\nI've been thinking, I've been thinking\nWhy can't I keep my fingers off it, baby?\nI want you, na na\nWhy can't I keep my fingers off it, baby?\nI want you, na na\n\nDrunk in love, we be all night\n\nLast thing I remember is our beautiful bodies grinding up in the club\nDrunk in love\n\nWe be all night, love, love\nWe be all night, love, love\n\nThen I fill the tub up halfway then ride it with my surfboard, surfboard, surfboard\nGraining on that wood, graining, graining on that wood\nI'm swerving on that, swerving, swerving on that big body\nBeen serving all this, swerve, surfing all in this good, good\n\nWe be all night, love, love\nWe be all night, love, love\n\nYeah, MTV!\n\nMUSIC CUE: ROCKET\n\nLet me sit this ass on you\nShow you how I feel\nLet me take this off\nWill you watch me?\nThat's mass appeal\nDon't take your eyes\nDon't take your eyes off it\nWatch it, babe\nIf you like you can touch it, baby\nDo you, do you wanna touch it, baby?\n\nHard rock, steady rock\nHard rock, steady rock\nHard rock, steady rock-rock\n\nMUSIC CUE: PARTITION\n\nDriver, roll up the partition, please\nI don't need you seeing Yoncé on her knees\nTook 45 minutes to get all dressed up\nWe ain't even gonna make it to this club\n\nOh, there daddy, daddy didn't bring the towel\nOh, baby, baby be better slow it down\nTook 45 minutes to get all dressed up\nAnd we ain't even gonna make it to this club\n\nTake all of me\nI just wanna be the girl you like (girl you like)\nThe kinda girl you like (girl you like)\nTake all of me\nI just wanna be the girl you like, girl you like\nThe kinda girl you like is right here with me\nRight here with me\nRight here with me\nRight here with me\n\nMUSIC CUE: SUPERPOWER\n\n[Background Vocals:Chimamanda Ngozi Adichie]\nWe teach girls to shrink themselves\nTo make themselves smaller\nWe say to girls:\n\"You can have ambition\nBut not too much\nYou should aim to be successful\nBut not too successful\nOtherwise you will threaten the man.\"\nFeminist: the person who believes in the social, political, and economic equality of the sexes.\"\n\nMUSIC CUE: ***FLAWLESS\n\nH, H-town, town, I’m coming down\nC-Coming down, drippin' candy on the ground\n\nI know when you were little girls\nYou dreamt of being in my world\nDon't forget it, don't forget it\nRespect that, bow down bitches (Crown!)\n\nBow down bitches, bow bow down bitches (Crown)\nBow down bitches, bow bow down bitches (Crown)\nH-Town vicious\nH, H-Town vicious\nI'm so crown, crown, bow down bitches\n\nI'm out that H-town, coming, coming down\nC-Coming down, drippin' candy on the ground\n\nHow you all wake up this morning?\nI said: \"how did you wake up this morning?\"\nYou flawless? Sing\n\nYou wake up, flawless\nPost up, flawless\nRidin' round in it, flawless\nFlossin' on that, flawless\nThis diamond, flawless\nMy diamond, flawless\nThis rock, flawless\nMy rock, flawless\nI woke up like this\nI woke up like this\nWe flawless, ladies tell 'em\nSay I look so good tonight\nGod damn, God damn, God damn\n\nMUSIC CUE: FLAWLESS (REMIX)\n\n[Background Vocals]\nOf course sometimes shit go down\nWhen it's a billion dollars on an elevator\nOf course sometimes shit go down\nWhen it's a billion dollars on an elevator\nHa, ha, God damn, God damn, God damn\n\nMUSIC CUE: YONCÉ\n\nDrop the bass, mayne, the bass get lower\nRadio say, \"Speed it up,\" I just go slower\nI sneezed on the beat and the beat got sicker\nYoncé all on his mouth like liquor [×4]\nLike, like liquor, like, like, like liquor\n\nMUSIC CUE: HEAVEN\n\n[Background Vocals: Melissa Vargas]\nPadre Nuestro\nQue estás en el cielo\nSantificado sea tu Nombre\nVenga tu reino\nHágase tu voluntad\nEn la tierra como en el cielo\nAmén\n\nMUSIC CUE: BLUE\n\nSometimes these walls seem to cave in on me\nWhen I look in your eyes, I feel alive\nMake it last forever\nCome on baby won't you hold on to me, hold on to me\nYou and I together\nCome on baby won't you hold on to me, hold on to me, Blue\n\nHold on to me, hold on\nCould you hold on to me, hold on to me\n(Mommy mommy mommy! Can we see daddy?)\nYou and I forever, come on baby won't you hold on to me, hold on to me, Blue\n(Can we see daddy?)\n\nThis next song is for all my incredible fans.If it wasn't for you, I would not be here on this stage. Imma gonna sing and you gonna repeat after me, you ready ?\n\nMUSIC CUE: XO\n\nYour love is bright as ever 2x\nEven in the shadows 2x\nSo baby, kiss me 2x\nBefore they turn the lights out 2x\nBaby love me lights out\n\nIn the darkest night hour (in the darkest night hour)\nI'll search through the crowd (I'll search through the crowd)\nYour face is all that I see\nI'm gonna give you everything\nBaby, love me lights out\nEverybody on your feet 2x\nSing ! Imma say\nOooooh ooooh ooooh ooooh 2x\n\nNow put your hands together\n\nYou love me like XO\nYou love me like XO\nYou kill me boy XO\nYou love me like XO\nAll that I see\nI'm gonna give you everything\nBaby, love me lights out\n\nThank you so much, I love you all", "image": "https://images.genius.com/995535bff9a0a15e5f1840990707d61d.399x399x1.jpg"}], "artist": "Beyoncé"}