{"songs": [{"title": "Summertime", "album": "Speak My Mind (Mixtape)", "year": "2003-10-28", "lyrics": "[Intro: P. Diddy]\nYeah\nThere's three things I like about the summertime\nDrop tops, long hot nights and summer love\nYeah\nHey yo, B\nTell 'em what time it is\nLet' s go\n\n[Verse 1: Beyonce]\nOut of all the guys that approached me\nWalking up to me like they know me\nYou were the one that stayed aside\nWaited a while and took your time\nYou don't know how impressing\nYour curiousity was to me\nIt was the fourth day of July\nLooked in my eyes and saw that I\n\n[Bridge: Beyonce]\nI wanted more than just a man (man)\nI needed a friend (I want a friend)\nSomeone I can talk to (oh)\nSomeone who'll really listen (yeah)\nWhen you touched my hand (yeah yeah)\nThe sun got brighter then (brighter then)\nTrusting you I closed my eyes\nAnd felt our love begin\n\n[Hook: Beyonce]\nIt was the summertime (when we fell in love)\nIt was the summertime (when heaven shined on us)\nIt was the summertime (baby there is nothing like the)\nSummertime, summertime (ohh)\n\n[Verse 2: Beyonce]\nNow it's been a year and we're closer\nFall in love again when I hold ya\nI know that God set you aside\nFor me and now you are my prize\nWanna grow old with ya\nFill a house with ya pictures\nHave a son for you, a little girl for me\nTogether we'll raise a family\n\n[Bridge: Beyonce]\nI wanted more then just a man\nI needed a friend\nYou are my best friend (yeah)\nSomeone I could talk to\nSomeone who'll really listen (yeah)\nWhen you touched my hand (yeah)\nThe sun got brighter then (brighter then)\nTrusting you I closed my eyes\nAnd felt our love begin\n\n[Hook]\n\n[Verse 3: P. Diddy]\nYo let me holla at you for a sec\nSo what's in gonna be, him or me? (yeah)\nWe can cruise the world for pearls\nAnd bare boots for girls\nSummertime in the linen, fresh fruit\nLivin the life that's forbidden for just you (let's go)\nNo worries you ain't gotta be stressed out\nNo hurries you ain't gotta be rushed out\nSit back relax ma take your time\nNow have a taste of the finest wine\nEvery minute that we have's a blessing to me\nAnd in your heart you's a \"Child of Destiny\" (that's right)\nThem hot summers that we had especially\nLove who you is girl, you bring out the best of me\nAnd it's like that, you know it's like that (that's right)\nAnd that's your plan, where's your hand let me ice that\nYou my heart ain't no chance you could fight that\nThe summertime, when you hot baby take that, take that\nYeah..\n\n[Hook]", "image": "https://images.genius.com/c8a2ba97f1a7a4f7dd98c04eda3a9235.640x640x1.jpg"}], "artist": "Beyoncé"}