{"songs": [{"title": "Cards Never Lie", "album": "MTV’s Hip Hopera Soundtrack: Carmen", "year": null, "lyrics": "[Beyonce]\nThe cards never lie, my last breath a sigh\nAnd now I think about if it's my time to die\nI don't know what I was thinking, steady wasting time with Hill\nAnd I need to live my life because my time is unforgiven\n\nI can't understand how my life changed around\nManifest my destiny, is it the brown underground?\nBlue skies are turning gray it's the point of indecision\nBelieving in the cards you must respect its every vision\n\n[Wyclef]\nGirlfriend, get your mind on line\nDon't spend your time cause you can't waste your time\nEveryday like it's your last, but you must feel divine\nIntervention comes and snatch up all your dreams from behind\n\nLove!\nYou feel it and you got to let them know it\nLove!\nYour heart and that's the feeling that you go with\nIf you have a dream you need to go and let them know it\nCause you could wake up in the morning and it could be over\n\n[Beyonce]\nNo, No, No, No\nI don't wanna, I don't wanna\nI don't wanna go\nJust, Just, Just let me stay home\nLet me live my dream, let me see another dawn\n\nNo, No, No, No\nI don't wanna, I don't wanna\nI don't wanna go\nJust, Just, Just let me stay home\nLet me live my dream, let me see another dawn\n\n[Rah Digga]\nCarmen, don't listen cause the cards have deceit\nJust slide him the money, we don't need a receipt\nTruth only exists within the eyes of the beholder\nPlus he's kind of young for fortune telling\nHe probably should be older\n\n[Wyclef]\nBut the cards never lie, I thought I told you\nNow it's her turn to try, to reach her goals before she reaches the sky\n\n[Beyonce]\nThis is love\nIt's like I'm trying to throw my life away\nSometimes love is all you got and other times it makes you pay\n\n[Wyclef]\nWell when you finally rise\nThen you'll realize\n\n[Beyonce]\nThe windows to the soul are not the hips but the eyes\n\n[Wyclef]\nOh You could wish on the stars but they're dead, just a lie\n\n[Beyonce]\nBut they shine just as bright as they did their entire life\n\nNo, No, No, No\nI don't wanna, I don't wanna\nI don't wanna go\nJust, Just, Just let me stay home\nLet me live my dreams, let me see another dawn\n\nNo, No, No, No\nI don't wanna, I don't wanna\nI don't wanna go\nJust, Just, Just let me stay home\nJust let me live my dreams, let me see another dawn", "image": "https://images.genius.com/a21fc00220b7775c1c2cedae44552434.497x497x1.jpg"}], "artist": "Beyoncé"}