{"songs": [{"title": "Naughty Girl (Remix)", "album": "Live at Wembley", "year": "2003-05-18", "lyrics": "[Verse 1: Lil' Kim]\nThis is ladies night, once again it's on!\nYa man actin' up? Then leave him home!\nIt's the girl the industry call the rap Madonna\nMore dangerous than a tank full of piranhas\nCourvoisier in my left arm, glass in my other hand\nWhile I rock that coochie like a rubber band\nI'm feelin' sexy in my million dollar Vicki bra\nAy yo Beyonce, how you feelin' ma?\n\n[Verse 2: Beyoncé]\nI'm feelin' sexy, I wanna hear you say my name boy\nIf you can reach me, you can feel my buring flame\n(I'm feelin' kinda N-A-S-T-Y, I just wanna take you home with me)\nBaby, the minute I feel your energy, the vibe is just taking over me (Ahhhhhhhhh) I start feelin' so crazy, babe\nLately, I feelin' been comin' over me, I don't know what's gotten into me\nThe rhythm got me feelin' so crazy, babe\n\n[Chorus: Beyoncé]\nTonight, I'll be your naughty girl (Uhhhhhhhh)\nI'm callin' all my girls\nWe gon' turn this party out, I know you want my body\nTonight, I'll be your naughty girl\nLike, callin' all my girls\nI see you look me up and down, and I came to party\n\n[Verse 3: Beyoncé]\nYou're so sexy, tonight I am all yours, boy\nThe way your body, moves across the floor!\n(I'm feelin' kinda N-A-S-T-Y, I juss wanna take you home with me)\nBaby, the minute I feel your energy, the vibe is just taking over me (Ahhhhhhhhh) I start feelin' so crazy, babe\nLately, I feelin' been comin' over me, I don't know what's gotten into me\nThe rhythm got me feelin' so crazy, babe\n\n[Chorus: Beyoncé]\nTonight, I'll be your naughty girl (Uhhhhhhhh)\nI'm callin' all my girls\nWe gon' turn this party out, I know you want my body\nTonight, I'll be your naughty girl\nLike, callin' all my girls\nI see you look me up and down, and I came to party\n\n[Break: Beyoncé]\nI love to love you baby (I love to love you baby)\nI love to love you baby (I love to love you baby)\nI love to love you baby (I love to love you baby)\nI love to love you baby (I love to love you baby)\n\n[Verse 4: Lil' Kim]\nYou know I, rep the stuy when I chef the pie\nI'm back in the kitchen with the flame on high\nI see you lookin', baby whats cookin?\nYeah, I'm lookin' like something to eat\nYour man there lookin' like something to freak\nLickin' on his lips like I'm somethin' sweet\nLil' Kim and Beyonce just tryin to keep the flame lit\nAnd warm it up like Big Daddy Kane did\n\n[Chorus: Beyoncé]\nTonight, I'll be your naughty girl (Uhhhhhhhh)\nI'm callin' all my girls\nWe gon' turn this party out, I know you want my body\nTonight, I'll be your naughty girl\nLike, callin' all my girls\nI see you look me up and down, and I came to party", "image": "https://images.genius.com/4dd46e29b13fa13e0b8e3e1d4d79bfa6.538x536x1.jpg"}], "artist": "Beyoncé"}