{"songs": [{"title": "Resentment", "album": "B’Day", "year": "2006-09-04", "lyrics": "[Verse 1]\nI wish I could believe you, then I'd be alright\nBut now everything you told me really don't apply to the way I feel inside\nLoving you was easy, once upon a time\nBut now my suspicions of you have multiplied\nAnd it's all because you lied\n\n[Chorus]\nI only give you a hard time\n'Cause I can't go on and pretend like I haven't tried to forget this\nBut I'm much too full of resentment\n\n[Verse 2]\nJust can't seem to get over the way you hurt me\nDon't know how you gave another who didn't mean a thing\nThe very thing you gave to me\nI thought I could forgive you, and I know you've changed\nAs much as I wanna trust you, I know it ain't the same\nAnd it's all because you lied\n\n[Chorus]\nI only give you a hard time\n'Cause I can't go on and pretend like I haven't tried to forget this\nBut I'm much too full of resentment\n\n[Bridge]\nI may never understand why\nI'm doing the best that I can\nAnd I tried, and I tried to forget this\nBut I'm much too full of resentment\n\n[Verse 3]\nI'll always remember feeling like I was no good\nLike I couldn't do it for you like your mistress could\nAnd it's all because you lied\nLoved you more than another, more than my own life\nBut that part of me I gave you, it was sacrificed\nAnd it's all because you lied\n\n[Chorus]\nI only give you a hard time\n'Cause I can't go on and pretend like I haven't tried to forget this\nBut I'm too damn full of resentment\n\n[Outro]\nI know she was attractive, but I was here first\nBeen riding with you for six years\nWhy did I deserve to be treated this way by you?\nI know you're probably thinking, \"What's up with B?\"\nI been crying for too long, what did you do to me?\nI used to be so strong, but now you took my soul\nI'm crying, can't stop crying\nCan't stop crying\nYou could've told me you wasn't happy\nI know you didn't wanna hurt me\nBut look what you've done to me now\nI gotta look at her in her eyes and see she's had half of me\nHow could you lie?", "image": "https://images.genius.com/d387cb06366b81a9a44bd80857e959a8.1000x1000x1.jpg"}], "artist": "Beyoncé"}