{"songs": [{"title": "Déjà Vu (Homecoming Live)", "album": "HOMECOMING: THE LIVE ALBUM", "year": "2019-04-17", "lyrics": "[Intro: Jay-Z & Beyoncé]\nCoachella, if you havin' a good time tonight, make some noise\nGive it up for Hova\n\n[Verse 1: JAY-Z & & Beyoncé]\nCome on\nI used to run base like Juan Pierre\nNow I run the bass hi-hat and the snare\nI used to bag girls like Birkin Bags\nNow I bag Bey, boy, you hurtin’ that\nBrooklyn Baby where they birthed me at\nNow I be everywhere, the nerve of rap\nThe audacity to have me with them curtains back\nMe and Bey, she about to sting, stand back\n\n[Verse 2: Beyoncé & JAY-Z]\nBaby (Yeah), seem like everywhere I go, I see you (Yeah)\nFrom your eyes your smile, it's like I breathe you (That's right)\nHelplessly, I reminisce, don’t want to (Uh huh)\nCompare nobody to you (Take 'em uptown)\n\n[Pre-Chorus: Beyoncé & JAY-Z]\nBoy, I try to catch myself, but I'm outta control (Take 'em uptown)\nYour sexiness is so appealing, I can't let it go (Let's go)\n\n[Chorus: Beyoncé & JAY-Z]\nKnow that I can't get over you (Hey, uh)\n'Cause everything I see is you (Oh whoa, that’s right)\nAnd I don’t want no substitute (That's right)\nBaby, I swear it’s déjà vu (Come on)\nKnow that I can't get over you (Uh huh)\n'Cause everything I see is you (Uh huh)\nAnd I don't want no substitute (Yeah, yeah, yeah, yeah)\nBaby, I swear it’s déjà vu\n\n[Verse 3: Jay-Z]\nYeah, Hova's flow so unusual\nBaby girl, you should already know\nIt's H-O, light up the dro\n'Cause you gonna need the help tryna study my bounce\nFlow, blow, what's the difference?\nOne you take in vein while the other you sniffin'\nIt's still dope, po-po try to convict him\nIt's a no-go, my dough keep the scales tippin'\nLike 4-4s, like I'm from the H-O-U-S-T-O-N\nBlow wind, so Chicago of him\nIs he the best ever? That's the argu-a-ment\nI don't make the list, don't be mad at me\nI just make the hits like a factory\nI'm just one of one, nothin' after me\nNo Déjà Vu, just me and my\n\n[Bridge: Beyoncé]\nBaby, I can't go anywhere\nWithout thinking that you're there\nSeems like you're everywhere, it's true (Yeah)\nGotta be having Deja Vu\n'Cause in my mind I want you here\nGet on the next plane, I don't care\nIs it because I'm missin' you\nThat I'm having déjà vu?\n\n[Post-Chorus: Beyoncé]\nBoy, I try to catch myself, but I'm outta control\nYour sexiness is so appealing, I can't let it go\n\n[Chorus: Beyoncé]\nBaby, I swear it's déjà vu\nKnow that I can't get over you\n'Cause everything I see is you\nAnd I don't want no substitute\nBaby, I swear it's déjà vu\nKnow that I can't get over you\n'Cause everything I see is you\nAnd I don't want no substitute (Here we go)\nBaby, I swear it's déjà vu\n\n[Post-Chorus: Beyoncé]\nBoy, I try to catch myself, but I'm outta control\nYour sexiness is so appealing, I can't let it go\n\n[Outro]\nGo, go, go, go\nGo, go, go, go\nGo, go, go, go\nGo, go, red light, green light", "image": "https://images.genius.com/86527286e5623e09de9082461be09538.1000x1000x1.jpg"}], "artist": "Beyoncé"}