{"songs": [{"title": "Suga Mama", "album": "B’Day", "year": "2006-09-04", "lyrics": "[Intro]\nDamn, that was so good,  I wanna buy him a short set\n\n[Verse 1]\nI’ma be like a jolly rancher that you get from the corner store\nI’ma be like a waffle cone that’s dripping down to the floor\nThe way you do it for me, I can’t lie (Lie!)\nAbout to be up in the mall all night (Yes!)\nWhatever I get you putting it on (Yes!)\nDon’t give me no lip, let mama do it all\n\n[Chorus]\nLet me be, I wants to be, gots to be\nYour suga, give mama some suga mama\nSuga ma-ma, ma-ma\nI’m your suga mama (Suga mama)\nLet me be, I wants to be, gots to be\nI don’t want no baby on my waist\n'Cause I’m a suga ma-ma-ma-ma\nI’m your suga mama (Suga mama, hey, hey)\nSit on mama lap, hey!\nCome sit on mama lap, hey!\nCome sit on mama lap, hey, hey!\nCome sit on mama lap, hey!\n\n[Verse 2]\nIt’s so good to the point that I’d\nDo anything to keep you home (On the phone)\nBaby, what you want me to buy?\nMy accountant’s waiting on the phone (On the phone)\nJust the thought of making love to you (You!)\nDropping everything that’s what I’ll do (I'll do!)\nWhatever I get, you putting it on (Oh!)\nNow, take it off while I watch you perform\n\n[Chorus]\nLet me be, I wants to be, gots to be\nYour suga, give mama some suga mama\nSuga ma-ma, ma-ma\nI’m your suga mama (Suga mama)\nLet me be, I wants to be, gots to be\nI don’t want no baby on my waist\n'Cause I’m a suga ma-ma-ma-ma\nI’m your suga mama (Suga mama, hey, hey)\nSit on mama lap, hey!\nCome sit on mama lap, hey!\nCome sit on mama lap, hey, hey!\nCome sit on mama lap, hey!\n\n[Verse 3]\nAnd I’ve always been the type to take care of mine\nI know just what I’m doing\nDon’t you worry it’s cool and everything is steady\nGot you you on my taxes already, yeah, yeah, yeah, yeah\nI promise I won’t let no bills get behind\n'Cause every touch, every kiss and hug\nYou best believe it’ll be on time\nSuga mama, mama, mama, yeah, yeah, yeah\n\n[Chorus]\nLet me be, I wants to be, gots to be\nYour suga, give mama some suga mama (I give you all my money, baby)\nSuga ma-ma, ma-ma (Turn me out, boy, something crazy)\nI’m your suga mama (Suga mama)\nLet me be, I wants to be, gots to be (Take my credit cards, take my house, take my car)\nI don’t want no baby on my waist (Don't forget to give mama some sugar)\n'Cause I’m a suga ma-ma-ma-ma (Some sugar, when you walk out that door)\nI’m your suga mama (Suga mama, hey, hey)\nSit on mama lap, hey, hey! (yes)\nCome sit on mama lap, hey! (yes)\nCome sit on mama lap, hey, hey! (yeah)\nCome sit on mama lap, hey, hey! (yeah, yeah)\nSit on mama lap, hey, hey!\nCome sit on mama lap, hey!\nCome sit on mama lap, hey, hey!\nCome sit on mama lap, hey!", "image": "https://images.genius.com/d387cb06366b81a9a44bd80857e959a8.1000x1000x1.jpg"}], "artist": "Beyoncé"}