{"songs": [{"title": "Love Drought", "album": "Lemonade", "year": "2016-04-23", "lyrics": "[Verse 1]\nTen times out of nine, I know you‘re lying\nBut nine times out of ten, I know you're trying\nSo I'm trying to be fair\nAnd you're trying to be there and to care\nAnd you're caught up in your permanent emotions\nAnd all the loving I've been giving goes unnoticed\nIt's just floating in the air, lookie there\nAre you aware you're my lifeline, are you tryna kill me?\nIf I wasn't me, would you still feel me?\nLike on my worst day? Or am I not thirsty, enough?\nI don't care about the lights or the beams\nSpend my life in the dark for the sake of you and me\nOnly way to go is up, skin thick, too tough, mmm\n\n[Chorus]\n'Cause you, you, you, you and me could move a mountain\nYou, you, you, you and me could calm a war down\nYou, you, you, you and me could make it rain now\nYou, you, you, you and me could stop this love drought\n\n[Verse 2]\nNine times out of ten, I'm in my feelings\nBut ten times out of nine, I'm only human\nTell me, what did I do wrong?\nFeel like that question has been posed, I'm movin' on\nI always been committed, I been focused\nI always paid attention, been devoted\nTell me, what did I do wrong?\nOh, already asked that, my bad\nBut you my lifeline, think you tryna kill me\nIf I wasn't B, would you still feel me?\nLike on my worst day? Or am I not thirsty, enough?\nI don't care about the lights or the beams\nSpend my life in the dark for the sake of you and me\nOnly way to go is up, them old bitches so wack\nI'm so tough, wassup?\n\n[Chorus]\n'Cause you, you, you, you and me could move a mountain\nYou, you, you, you and me could calm a war down\nYou, you, you, you and me could make it rain now\nAnd you, you, you, you and me will stop this love drought\n\n[Outro]\nYou, you, you, you and me will stop this love drought\nYou, you, you, you and me will stop this love drought", "image": "https://images.genius.com/33238a0dbe6470fde82c5fea51ff69e2.1000x1000x1.jpg"}], "artist": "Beyoncé"}