{"songs": [{"title": "“Self-Titled” Part 2 . Imperfection", "album": null, "year": null, "lyrics": "There's a moment where things click. When I was in the studio I was threading the songs together and I...thought of this performance which was a really defining moment in my life as a child. In my mind we would perform on Star Search, we would win; we would get a record deal and that was my dream at the time. There's no way in the world I would ever imagine losing as a possbility. You know, I was only 9 years old so, at that time, you don't realise that you could actually work super hard and give everything you have and lose! It was the best message for me. When I put Ed MacMahon introducing us as \"the Hip-Hop rapping Girls' TYME\" it clicked something in my mind. I feel like something about the aggression of Bow Down and the attitude of Flawless - the reality is, sometimes you lose. And you're never too good to lose, you're never too big to lose, you're never too smart to lose; it happens, and it happens when it needs to happen. And you have to embrace those things\n\n\n\nI was scrolling through videos about feminism on YouTube and I ran across this video of this incredible Nigerian author, Chimamanda Ngozi Adichie. Everything she said is exactly how I feel\n\nMy message behind this album is finding the beauty in imperfection. I had this image of this trophy and me accepting these awards and kind of training myself to be this champion. And at the end of the day when you go through all of these things, is it worth it? I mean, you get this trophy and you're like, 'I basically starved, I have neglected all of the people that I love, I've conformed to what everybody else thinks I should be and I have this trophy. What does that mean?'. The trophy represents all of the sacrafices I made as a kid. All of the time that I lost, being on the road/ in the studios as a child. And, I just wanna throw that shit up\nI have a lot of awards and I have a lot of these things that I'm amazing and I'm - I worked my ass of, I worked harder then probably everybody I know to get those things but nothing feels like my child saying 'Mommy'. No, nothing feels like when I look at my husband in the eyes, nothing feels like when I'm respected, when I get on the stage and I see I'm changing people's lives. Those are the things that matter and, at this point in my life, that's what I'm striving for. Growth, love, happiness, fun; enjoying your life, it's short - that's the message", "image": "https://images.genius.com/995535bff9a0a15e5f1840990707d61d.399x399x1.jpg"}], "artist": "Beyoncé"}