{"songs": [{"title": "Lemonade Film (Script)", "album": "Lemonade", "year": "2016-04-23", "lyrics": "MUSIC CUE: \"PRAY YOU CATCH ME\"PART 1: IntuitionEXT. BAYOU SHACK\n\nTitle is displayed from monochromatic low angle; camera near tree root. Wooden outhouse in background about fifteen feet away. Cut to pale female next to wooden cabin, looking in the other direction. Food lies on the table in the background.\n\nBEYONCÉ (V.O.): I tried to make a home outta you.\n\nCut to shot of woods from view of wooden cabin porch.\n\nBEYONCÉ (V.O.): But doors lead to trapdoors. A stairway leads to nothing.\n\nCut to black, then to a shot facing upwards, shot filled with tree branches covered in a whitish, bunched up cloth material. Camera moves forward.\n\nBEYONCÉ (V.O.): Unknown women wander the hallways at night.\n\nCut to shot of at least twelve black middle-aged women in a pavilion-type wooden structure, all dressed in elaborate white gowns. At least four are sitting with their legs hanging over the side on the floor of the pavilion, and at least eight are standing. Camera pans behind women, who are perfectly still.\n\nBEYONCÉ (V.O.): Where do you go when you go quiet?\n\nCut to shot of a black woman wearing a dress with an elaborate black bodice with red-tinting, her left shoulder emblazoned with a tattoo reading “Dream Big”. She holds onto the railing of a wooden fence-like structure with her left hand.\n\nBEYONCÉ (V.O.): You remind me of my father, a magician. Able to exist in two places at once.\n\nCut to shot of black woman in green dress, sitting on a set of wooden steps, eyes closed.\n\nBEYONCÉ (V.O.):  In the tradition of men in my blood you come home at 3AM and lie to me.\n\nCut to shot of woman dressed in white, about ten feet away, rocking in rocking chair. In the foreground, the leaves of a plant block the face of the woman in the rocking chair.\n\nBEYONCÉ (V.O.): What are you hiding? The past, and...\n\nCut to shot under the table, with backside of woman sitting at wooden porch steps in view, picking at something.\n\nBEYONCÉ (V.O.): ...the future merge to meet us here.\n\nCut to Beyoncé in an archaic tub in a brick room lighted by natural lighting and a few meager candles in the background, face calm, legs up.\n\nBEYONCÉ (V.O.): What luck. What a fucking curse.\nMUSIC CUE: \"PRAY YOU CATCH ME\"BEYONCÉ is submerged in water, unclear.\nPART 2: DenialTitle is displayed over a zoom in on her chest area, the golden zipper on her black jacket being undone by her left hand. Unzipping the jacket reveals a nude-colored dress.\n\nBEYONCÉ (V.O.): I tried to change, closed my mouth more.\n\nCut to BEYONCÉ trying to swim submerged in the water.\n\nBEYONCÉ (V.O.): Tried to be soft, prettier.\n\nCut to BEYONCÉ's face behind a curtain of bubbles, drowning.\n\nBEYONCÉ (V.O.): Less...awake.\n\nCut to various shots: one underneath a mass of fabric, another of BEYONCÉ floating inside a decked out, regal bedroom completely submerged in water. Close up shots of her calm face come, then, and one of her sleeping on the floor emerges.\n\nBEYONCÉ (V.O.): Fasting for…\n\nCut to BEYONCÉ looking downwards.\n\nBEYONCÉ (V.O.): ...60 days. Wore white.\n\nCut to two BEYONCÉs, one wearing the outfit from the previous shot and looking towards the right of the screen, body upright, and the other laying down with a maroon tarp over her body, oriented towards the left of the screen but eyes closed.\n\nBEYONCÉ (V.O): Abstained from mirrors.\n\nCut to BEYONCÉ sleeping by herself on the bed, holding onto the bedpost with her right hand.\n\nBEYONCÉ (V.O.): Abstained from sex.\n\nCut to a closeup of BEYONCÉ's face, camera from above. BEYONCÉ looks left and then right.\n\nBEYONCÉ (V.O.): Slowly did not speak another word.\n\nCut to BEYONCÉ blowing massive air bubble in water, which consumes the visibility of her face.\n\nBEYONCÉ (V.O.): In that time my hair grew…\n\nBeyoncé’s sleeping body begins floating upwards.\n\nBEYONCÉ (V.O.): ...past my ankles. I slept on a mat on the floor. I swallowed a sword.\n\nCut to close up shot of just BEYONCÉ’s mouth from a side angle lipsyncing the following words. Air bubbles come freely out of her mouth.\n\nBEYONCÉ (V.O.): I levitated...\n\nCut to BEYONCÉ's body flipping around erratically. Back to shot of body floating upwards towards light source above.\n\nBEYONCÉ (V.O.): ...into the basement, I confessed my sins and was baptized in a river.\n\nCut to BEYONCÉ's covered by maroon tarp, in prayer position, legs crossed, floating slightly above mattress of bed.\n\nBEYONCÉ (V.O.): Got on my knees and said, “Amen.” And...\n\nCloseup from under BEYONCÉ’s face, her fingers together at the base of the shot, her hair streaming upwards. Air bubbles float into her nose instead of out of it.\n\nBEYONCÉ (V.O.): ...I said Ameen. I whipped my own back and asked for dominion at your feet.\n\nViolent succession of shots, some of which it appears BEYONCÉ is screaming. Shot of her body floating upwards, eyes covered by bubbles, mouth slightly open, body language open and vulnerable. Her head pivots, mouth closing.\n\nBEYONCÉ (V.O.): I threw myself into a volcano, I…\n\nClose up shot of just her mouth, hair, and part of her nose, lipsyncing next words.\n\nBEYONCÉ （V.O.): I drank the blood and drank the wine.\n\nMore violent successions of shots, body warping quickly. Shot from side profile, BEYONCÉ is praying, hands together, eyes closed, head slowly tilting upwards. The bubbles start moving into her nose instead of out of it.\n\nBEYONCÉ (V.O): I sat alone and begged and bent at the waist for God.\n\nShot from behind her, maroon tarp floating freely in water.\n\nBEYONCÉ (V.O.): I crossed myself and thought I saw the devil.\n\nCut to BEYONCÉ looking upwards, hands still together in prayer. Light source shines directly on her face.\n\nBEYONCÉ (V.O.): I grew thickened skin on my feet.\n\nShot from behind BEYONCÉ, her head towards the camera, legs kicking.\n\nBEYONCÉ (V.O.): I bathed...in bleach and plugged my menses with...\n\nCut to shot from above of a thick, black-covered book labeled “HOLY BIBLE” in silver text and a silver cross on it with white pages floating down towards floor.\n\nBEYONCÉ (V.O.): ...pages from the Holy Book. But...\n\nCut to BEYONCÉ swimming out of the bedroom through a doorway into the rest of the presumed building, a stone staircase in sight through the doorway.\n\nBEYONCÉ (V.O.): ...still inside me coiled deep was…\n\nCut to BEYONCÉ, face completely covered by an upwards floating thick stream of bubbles. Her face penetrates the curtain of bubbles as the shot progresses forward.\n\nBEYONCÉ (V.O.): ...the need to know. Are you cheating? Are you cheating on me?\n\nCut to BEYONCÉ exiting large stone building in yellow dress, water flowing underneath her feet as she goes down steps.\nMUSIC CUE: \"HOLD UP\"EXT. CITY STREET - DAY\n\nCars line the street on either side. A monster truck enters left and begins crushing the line of cars on the far side of the street. Cut to BEYONCÉ at the wheel of the monster truck, then cut back to a full view of the monster truck as it smashes more vehicles. Cut to left-panning shot of a suburban neighborhood.\nPART 3: ANGEREXT. SUBURBAN STREET - DAY\n\nTitle sits over four men in a marching band full regalia, performing in a parade. Cut to the women, marching along in equally flashy getup. They perform different gymnastic moves as they proceed.\n\nBEYONCÉ (V.O.): If this what you truly want, I can wear  her skin...over mine.\n\nCut to a group of women in dresses with too-long sleeves standing together in a parking lot. They are writhing in unison. Water droplets fall from the ceiling, but the footage is reversed to make it appear they are falling upward.\n\nBEYONCÉ (V.O.): Her hair, over mine.\n\nCut to a closeup of the writhing women.\n\nBEYONCÉ (V.O.): Her hands as gloves.\n\nCut to a staircase in an abandoned building.\n\nBEYONCÉ (V.O.): Her teeth as confetti.\n\nCut back to a closeup of the women, then to a wider shot, then back to a closeup.\n\nBEYONCÉ (V.O.): Her scalp, a cap. Her sternum, my bedazzled cane.\n\nCut back to the stairs. Pan below the upward flight to reveal the downward flight into darkness.\n\nBEYONCÉ (V.O.):We can pose for a photograph. All three of us, immortalized. You and your perfect girl.\n\nCut back to a closeup of the women. With their hands above their heads, they all bend backwards in unison. Cut to a flickering lightbulb.\n\nBEYONCÉ (V.O.): I don't know when love became elusive. What I know is no one I know has it.\n\nCut to BEYONCÉ, staring into the back window of a vehicle. She is dressed in fur and her hair is in cornrows.\n\nBEYONCÉ (V.O.): My father's arms around my mother's neck. Fruit too ripe to eat.\n\nCut to a Black woman sitting at a drum set. She is looking backwards over her shoulder at the camera.\n\nBEYONCÉ (V.O.): I think of lovers as trees...\n\nCut to a distorted image of three women from behind, walking down the ramp of a parking garage.\n\nBEYONCÉ (V.O.): ...growing to and from one another.\n\nCut to a clip of the drummer girl playing in slow motion.\n\nBEYONCÉ (V.O.): Searching for the same light.\n\nCut to a Black woman lying on the hood of a car, then cut to BEYONCÉ at the side of the same car, walking towards the camera in slow motion.\n\nBEYONCÉ (V.O.):Why can't you see me? Why can't you see me? (Why can't you) Why can't you see me? Everyone else can.\nMUSIC CUE: \"DON'T HURT YOUSELF\"INT. PARKING GARAGE\n\nDrummer girl is pictured to the left of the frame, sitting at her drum set. She is motionless. The lights flicker on and off.\nPART 4: ApathyINT. SUBWAY\nMUSIC: Pyotr Tchaikovsky \"Scene from Swan Lake\"\n\nTitle sits over a closeup of the inside of a subway car. Lights are reflecting off of its surface.\n\nBEYONCÉ (V.O.): So what are you gonna say at my funeral now that you've killed me?\n\nCut to an assembly of feet lining the seats of the subway car. Cut to reveal the feet belong to a group of Black women, their faces painted in different white designs. They are swaying left to right in unison, and then begin to perform a choreographed dance.\n\nBEYONCÉ (V.O.): Here lies the body of the love of my life, whose heart I broke without a gun to my head. Here lies the mother of my children both living and dead. Rest in peace, my true love, who I took for granted, most bomb pussy, who because of me, sleep evaded. Her shroud is loneliness.\n\nCut to a single person sitting alone in the subway car. Their face is obscured by a rimmed hat.\n\nBEYONCÉ (V.O.): Her God is listening.\n\nCut to BEYONCÉ, sitting beside the group of painted girls.\n\nBEYONCÉ (V.O.): Her heaven would be a love without betrayal.\n\nCut to an extreme closeup of lights playing off the roof of the subway car.\n\nBEYONCÉ (V.O.):Ashes to ashes...dust to side chicks.\n\nCut to an upward view of trees in the sunlight, then to the front of a manor surrounded by gardens.\nMUSIC CUE: \"SORRY\"EXT. FIELD - DAY\n\nA group of five Black women are walking naked through the field. The camera follows them from behind, moving through the grass.\n\nBEYONCÉ (V.O.): She sleeps all day...dreams of you in both worlds.\nPART 5: EmptinessEXT. UNKNOWN STREET - NIGHT\n\nTitle sits in front of a streetlight viewed from below. Zoom on the streetlight until the light consumed the entire frame. Cut to a forward panning shot of a wet concrete floor doused in orange light.\n\nBEYONCÉ (V.O.): Tills the blood in and out of uterus. Wakes up smelling of zinc.\n\nCut to a closeup of the fabric of a red dress.\n\nBEYONCÉ (V.O.): Grief, sedated by orgasm.\n\nCut to a rear view of BEYONCÉ's head. She is wearing the red dress.\n\nBEYONCÉ (V.O.): Orgasm heightened by grief.\n\nReturn to the upward panning shot on concrete. A wide shot reveals BEYONCÉ is sitting surrounded by flames. Slow zoom on BEYONCÉ.\n\nBEYONCÉ (V.O.): God was in the room when the man said to the woman, \"I love you so much. Wrap your legs around me and pull me in, pull me in, pull me in.\" Sometimes when he'd have her nipple in his mouth, she'd whisper, \"Oh my God.\" That, too, is a form of worship.\n\nCut to a closeup bust of BEYONCÉ. She is wearing an ornate gold head adornment  consisting of chains and spikes, and a patterned gold collar.\n\nBEYONCÉ (V.O.): Her hips grind pestle and mortar, cinnamon and cloves, whenever he pulls out.\n\nCut to black, then to a narrow hallway veiled in red light. There is a square of white light at the far end. Slow zoom towards the white square.\n\nBEYONCÉ (V.O.): Loss. Dear moon, we blame you for floods...for the flush of blood...for men who are also wolves. We blame you for the night, for the dark, for the ghosts.\nMUSIC CUE: \"6 INCH\"After the first few bars of the song, the music stops. Cut to a room lit with the same red light as the hallway. BEYONCÉ is swinging a wire with a light bulb at the end in circles over her head.\n\nBEYONCÉ: Every fear...\n\nCut to three other women who are also in the room. They are sitting side-by-side on a couch.\n\nBEYONCÉ (V.O.): Every nightmare...anyone has ever had.\nMUSIC CUE (RESUME): \"6 INCH\"EXT. BURNING BUILDING - NIGHT\n\nCloseup of BEYONCÉ. Red lights flash across her face. Slow zoom out to reveal she is standing in front of a burning building with four other women. They stand motionless in the smoke. Cut to a bayou, and then to a bedroom in a manor on the bayou.\nPART 6: AccountabilityEXT. MANOR - DAY\n\nTitle sits over a downward view from the balcony of the manor. A young girl is walking through the manor's courtyard Cut to a second-floor hallway in the manor.\n\nBEYONCÉ (V.O.): You find the black tube inside her beauty case.\n\nTwo girls walk up the stairs and into the hallway.\n\nBEYONCÉ (V.O.): Where she keeps your father's old prison letters. You desperately want to look like her.\n\nCut to two girls sitting on a bed, talking. One has her back turned and the other is facing the camera.\n\nBEYONCÉ (V.O.): You look nothing like your mother.\n\nCut to a closeup of the girls' hands. The girls are making dolls.\n\nBEYONCÉ (V.O.): You look everything like your mother.\n\nCut to a different girl, jumping on a bed.\n\nBEYONCÉ (V.O.): Film, star, beauty.\n\nCut to closeup of a young girl, pictured left. She is staring at BEYONCÉ, pictured right, who is fixing her hair.\n\nBEYONCÉ (V.O.): How to wear your mother's lipstick.\n\nCut to an upward shot of three girls coming down the stairs of the manor.\n\nBEYONCÉ (V.O.): You go to the bathroom to apply the lipstick.\n\nCut to a room in the manor. On the left is a small table with a flower pot and a sculpture of a face atop it. In the middle is a chair. On the right is an empty crib.\n\nBEYONCÉ (V.O.): Somewhere no one can find you.\n\nCut to an adolescent girl standing sideways. She is staring at herself in a mirror.\n\nBEYONCÉ (V.O.): You must wear it like she wears disappointment on her face.\n\nCut to an blurred extreme closeup of a young girl. Another young girl sits behind her, facing sideways.\n\nBEYONCÉ (V.O.): Your mother is a woman.\n\nThe blur effect shifts so the girl in the foreground is clear and the girl in the background is blurry. Cut to an elderly woman, sitting in a chair. She is staring at the camera.\n\nBEYONCÉ (V.O.): And women like her can not be contained.\n\nCut to an extreme closeup of a car window from the inside. Condensation has collected on the exterior.\n\nMALE VOICE (V.O.): I even met the president one time, man. I ain't tell you that? Yeah, I met the president, you know. Before I met him, you dig...\n\nCut to a side view closeup of the driver, a Black male in modern attire.\n\nMALE VOICE (V.O.): I didn't see myself going nowhere. I mean, really. I ain't...you know...I ain't really cared if I lived or died.\n\nCut to grainy footage of the stoop of an apartment. A young girl is standing on the stoop in her pajamas. A pregnant women is standing in front of the stoop, looking at a young man. The young man is sitting on the hood of his car. He is sifting through a stack of cash.\n\nMALE VOICE (V.O.): Now I feel like I gotta live, man, for my kids and stuff, you know? He...he from the hood just like me. He from Chi-Raq, you know. I'm from New Orleans.\n\nCut back to a closeup of the driver.\n\nMALE VOICE (V.O.): You know, that give me inspiration on I can be whatever I wanna be, like, you know, whatever I wanna be.\n\nCut to a stormy sky over an open field in the day.\n\nMALE VOICE (V.O.): You know, I'll probably be the next Spike Lee and shit, or something. You understand what I'm saying?\n\nCut to a closeup of leaves, and then to a puddle rippling with falling rain.\n\nBEYONCÉ (V.O.): Mother dearest, let me inherit the Earth.\n\nCut to a grainy extreme closeup of a young girl's face.\n\nBEYONCÉ (V.O.): Teach me how to make him beg. Let me make up for the years he made you wait.\n\nCut to grainy footage of a home from across the street. A large tree stands directly beside it. Cars pass by in front of it.\n\nBEYONCÉ (V.O.): Did he bend your reflection?\n\nCut to a closeup of a paper boat floating in a puddle.\n\nBEYONCÉ (V.O.): Did he make you forget your own name?\n\nCut to grainy footage of a disheveled man waving his hand around, then to a bridal figurine, then to a woman putting a Band-Aid on a young girl's finger and kissing it.\n\nBEYONCÉ (V.O.): Did he convince you he was a God?\n\nCut to an adolescent girl walking down the street.\n\nBEYONCÉ (V.O.): Did you get on your knees daily?\n\nCut to an upward view of an angry woman, yelling at an unknown figure.\n\nBEYONCÉ (V.O.): Do his eyes close like doors? Are you a slave to the back of his head?\n\nCut to a young boy resting against the hood of a car, then to a closeup of a young girl staring blankly into the camera.\n\nBEYONCÉ (V.O.): Am I talking about your husband or your father?\nMUSIC CUE: \"DADDY LESSONS\"Music stops. Cut to grainy footage of DADDY and CHILD BEYONCÉ sitting next to each other on a pink couch.\n\nDADDY: You wish your grandmother and grandfather was here with us?\n\nCHILD BEYONCÉ: Yes.\n\nDADDY: Tell 'em.\n\nA baby cries in the background.\n\nCHILD BEYONCÉ: I wish they was here with us.\n\nDADDY: Why? What would we do?\n\nCHILD BEYONCÉ: What?\n\nDADDY: What would we do, if they were here with us?\n\nCut to a clip of DADDY when he is older, jumping on a bed. A small girl jumps onto the bed after him.\n\nCHILD BEYONCÉ: Have fun.\n\nDADDY: Have fun?\n\nCHILD BEYONCÉ: Yes.\n\nDADDY: What would we do to have fun? Give me a kiss.\n\nCut back to DADDY and CHILD BEYONCÉ sitting on the pink couch. CHILD BEYONCÉ kisses DADDY.\n\nDADDY: Love you.\n\nCHILD BEYONCÉ:  I love you too.\nMUSIC CUE (RESUME): \"DADDY LESSONS\"Cut to a parking garage\n\nEXT. FOOTBALL STADIUM\n\nA woman stands on a balcony in the stadium seats. She is facing away from the camera, looking down at the field. Cut to BEYONCÉ, lying on her side on the field. Pan out to reveal her arm draped over her stomach.\n\nBEYONCÉ (V.O.): He bathes me...\n\nCut to BEYONCÉ in the parking garage, staring at the camera angrily.\n\nBEYONCÉ (V.O.): ...until I forget their names...and faces.\nPART 7: ReformationEXT. MANOR PORCH - NIGHT\n\nTitle sits over the porch. The left side of the porch is cloaked in shadow. The far right side is illuminated with light. A woman stands in the light, looking out over the railing. Cut to BEYONCÉ laying on her side in bed. Her eyes are closed.\n\nBEYONCÉ (V.O.): I ask him to look me in the eye when I come...home.\n\nBEYONCÉ opens her eyes.\n\nCut to a view of the manor's field through sheer drawn shades.\n\nBEYONCÉ (V.O.): Why do you deny yourself heaven?\n\nCut to an extreme closeup of moss growing on the railings of the manor's porch.\n\nBEYONCÉ (V.O.): Why do you consider yourself undeserving?\n\nCut to an upward view of the trees surrounding the manor.\n\nBEYONCÉ (V.O.): Why are you afraid of love? You think it's not possible for someone like you.\n\nCut back to BEYONCÉ lying on the football stadium field. She is staring at the camera as it pans out to a wide shot of the field.\n\nBEYONCÉ (V.O.): But you are the love of my life...love of my life...the love of my life...the love of my life.\nMUSIC CUE: \"LOVE DROUGHT\"PART 8: ForgivenessEXT. BEACH\n\nTitle is displayed over open ocean waters viewed from the shore.\n\nBEYONCÉ (V.O.): Baptize me...\n\nCut to an upside down shot of two black females laying naked on the beach with their backs to the camera. They are looking at each other.\n\nBEYONCÉ (V.O.): ...now that reconciliation is possible.\n\nCut to BEYONCÉ’s lower body. She is lying on the beach, parallel to the water, wearing a sheer dress. The waves are lapping at her body.\n\nBEYONCÉ (V.O.): If we're gonna heal, let it be glorious.\n\nCut to an upward sweeping shot of trees. Immediately cut to nine black females in sheer dresses. They are standing in the shallow water, hand-in-hand, with their arms raised above their heads in unison.\n\nBEYONCÉ (V.O.): One thousand girls raise their arms.\n\nCut to BEYONCÉ’s upper body. She is lying as before, looking out at the water.\n\nBEYONCÉ (V.O.): Do you remember being born?\n\nCut to a fire, burning in an open fireplace. Two wooden rocking chairs sit on either side of the flames.\n\nBEYONCÉ (V.O.): Are you thankful?\n\nCut to a closeup of BEYONCÉ’s bare feet on a wooden floor, walking towards the camera.\n\nBEYONCÉ (V.O.): Are the hips that cracked, the deep velvet of your mother...\n\nCut to a closeup of  a bowl on a raised surface. A crack in its surface shows signs of having been broken and repaired.\n\nBEYONCÉ (V.O.): ...and her mother...\n\nCut to a closeup of two black-and-white photos on a shelf. One features a full body shot of a solemn-faced man sitting in a wooden chair. The other features a ¾ shot of a solemn-faced woman in a white dress.\n\nBEYONCÉ (V.O.): ...and her mother?\n\nCut to a blurred closeup of a vinyl record player with Nina Simone’s Silk & Soul LP resting against the wall behind it.\n\nBEYONCÉ (V.O.): There is a curse that will be broken.\nMUSIC CUE: \"SANDCASTLES\"PART 9: ResurrectionEXT. NEIGHBORHOOD\n\nTitle is displayed in front of a young Black female wearing a white dress with her back pressed against a large tree. A residence with a garden is in the background. Cut to a left-panning shot of several Black women dressed in old-timey attire.\n\nFEMALE VOICE (V.O.): Something is missing. I've never seen this in my life.\n\nCut to a young Black woman operating an antique camera.\n\nFEMALE VOICE (V.O.): So many young women...They take our men, huh?\n\nCut to a shot an abundance of Black women posing for the photo shoot.\n\nFEMALE VOICE (V.O.): Say, \"All them men make them feel better than you.\"\n\nOTHER FEMALE VOICE (V.O.): What?\n\nCut to a right-panning closeup shot of the women\n\nFEMALE VOICE (V.O.): So how are we supposed to lead our children to the future? What do we do?\n\nCut to an upward angle shot of three Black women of varying ages, separate from the others. The youngest is standing in front, and the two older women flank her on either side. Slow zoom on their faces.\n\nFEMALE VOICE (V.O.): How do we lead them?\n\nOTHER FEMALE VOICE (V.O.): Love. L-O-V-E, love.\n\nFEMALE VOICE (V.O.): Mmm, mmmm, mmm. Hallelujah. Thank you, Jesus. I just love the Lord, oh yeah. I'm... I'm sorry, brother.\n\nCut to a grainy video recording of two Black women in modern attire embracing. They are facing the camera, smiling. The one on the right is waving to the camera.\n\nFEMALE VOICE (V.O.): I love the Lord, that's all I got.\n\nCut to a closeup of the waving woman. Cars pass by on the road behind her.\n\nFEMALE VOICE (V.O.): When your back is against the wall and your wall against your back, who you call? Hey!\n\nCut to a closeup of the waving woman’s hair. She turns side to side, showing her hair to the camera.\n\nFEMALE VOICE (V.O.): Who you call? Who you call? You gotta call him.\n\nCut to a panning shot of photographs strewn across the ground.\n\nFEMALE VOICE (V.O.): You gotta call Jesus. You gotta call him. You gotta call him, cause you ain't got another hope!\n\nCut to an obscure view of BEYONCÉ in a dirty mirror. She is wearing a gown.\n\nBEYONCÉ (V.O.): You are terrifying...and strange...\n\nPan to BEYONCÉ from the side. She is looking at a picture and then places it down.\n\nBEYONCÉ (V.O.): ...and beautiful.\nMUSIC CUE: \"FORWARD\"INT. DINING ROOM - NIGHT\n\nThe dining room table is set and lit with candles. A young girl dressed in Native American garb is walking around the dining room table, playing a tambourine. She walks past the camera into an endless loop of table circling. Cut to BEYONCÉ standing in a bus, surrounded by Black women with their faces and bodies painted in white designs.\n\nBEYONCÉ (V.O.): Magic.\n\nCut to a zooming shot of Black baby lying on a bed. Music plays in the background. Cut to a shot of BEYONCÉ from behind. The camera follows her as she walking through a set of double doors.\nPART 10: HopeINT. KITCHEN - DAY\n\nA group of Black women are preparing many different kinds of food.\n\nBEYONCÉ (V.O.): The nail technician pushes my cuticles back...\n\nCut to an alternate view of the kitchen. Two of the women are working on preparing other food elements.\n\nBEYONCÉ (V.O.): ...turns my hand over, stretches the skin on my palm and says:\n\nCut to a group of Black women on a stage in white dresses. Half of them are standing in the back of the stage, while the other half either sit on the edge of the stage or stand to the side.\n\nBEYONCÉ (V.O.): \"I see your daughters, and their daughters.\"\n\nCut to black. The camera slowly pans through a hole in a brick wall.\n\nBEYONCÉ (V.O.): That night in a dream the first girl emerges from a slit in my stomach.\n\nCut to a bald Black figure standing bare-chested in the center of a room. He is wearing a golden shoulder piece and a yellow skirt.\n\nBEYONCÉ (V.O.):The scar heals into a smile. The man I love pulls the stitches out with his fingernails.\n\nCut to a stormy sky over an open field\n\nBEYONCÉ (V.O.): We leave black sutures curling on the side of the bath.\n\nCut to BEYONCÉ sitting in a chair. Immediate cut to a shot of BEYONCÉ from behind. The camera follows her as she walks down a dark hallway, touching both walls.\n\nBEYONCÉ (V.O.):I wake as the second girl crawls headfirst up my throat.\n\nCut to the gold-shouldered figure, sitting in a chair. They are looking up. The camera pans up to reveal they are staring at a hole in the roof.\n\nBEYONCÉ (V.O.): A flower blossoming out of the hole in my face.\n\nCut to an above shot of a group of people sitting on benches.\nMUSIC CUE: \"FREEDOM\"PART 11: RedemptionINT. HOUSE - DAY\n\nTitle sits over a closeup of a screen door. Three young Black girls run out into the daylight.\n\nBEYONCÉ (V.O.): Take one pint of water, add a half pound of sugar, the juice of eight lemons...\n\nCut to a closeup of a hanging sheet. Two Black women pull it open from either side, revealing  people walking through a garden. Both women turn to face the camera.\n\nBEYONCÉ (V.O.): ...the zest of half lemon.\n\nCut to a rear view of five Black women walking through a yard towards a house.\n\nBEYONCÉ (V.O.): Pour the water from one jug, then into the other, several times.\n\nCut to a dinner table set with food. Each chair is filled by a different woman. They are conversing happily.\n\nBEYONCÉ (V.O.): Strain through a clean napkin.\n\nCut to a view of a BEYONCÉ’s  feet through the legs of a wicker chair. She is wearing ornate shoes adorned with flowers.\n\nBEYONCÉ (V.O.): Grandmother, the alchemist.\n\nCut to a rear view of the BEYONCÉ’s head\n\nBEYONCÉ (V.O.): You spun gold out of this hard life.\n\nCut to another woman, standing by the corner of a house. Her eyes are obscured by a leaf.\n\nBEYONCÉ (V.O.): Conjured beauty from  the things left behind.\n\nCut to a front view of BEYONCÉ sitting in the rocking chair.\n\nBEYONCÉ (V.O.): Found healing where it did not live.\n\nCut to BEYONCÉ in a room with her hair styled differently. She is talking to a girl  standing in front of her and admiring her hair. Cut to a closeup of an elderly woman’s hands.\n\nBEYONCÉ (V.O.): Discovered the antidote in your own kitchen.\n\nCut to a room full of women sitting together, talking. Pan up to BEYONCÉ, standing behind one of the women and brushing her hair. She is smiling.\n\nBEYONCÉ (V.O.): Broke the curse with your own two hands.\n\nCut back to BEYONCÉ in the rocking chair.\n\nBEYONCÉ (V.O.): You passed these instructions down to your daughter.\n\nCut back to the three girls from the beginning of the scene. They are out running in the field.\n\nBEYONCÉ (V.O.): Who then passed it down to her daughter.\n\nApplause can be heard. Cut to a words illuminated on a wooden floor reading, “Hattie’s 90th,” then cut to a side view of GRANDMOTHER (HATTIE), reading a speech to a crowd.\n\nGRANDMOTHER (HATTIE): I've had my ups and downs, but I always find the inner strength to pull myself up.\n\nCut to two children at the party, a boy and a girl, then cut back to GRANDMOTHER (HATTIE).\n\nGRANDMOTHER (HATTIE): I was served lemons, but I made lemonade.\n\nThe crowd laughs and applauds. Cut to an upward view of trees.\n\nBEYONCÉ (V.O.): My grandma said, nothing real can be threatened.\n\nPan down to the ocean, revealing the trees are growing directly out of the water. BEYONCÉ is in a white dress, standing atop one of the tree’s roots. Cut to a closeup of a woman. She is moving her hands and fingers in front of her face.\n\nBEYONCÉ (V.O.): True love brought salvation back into me.\n\nCut back to BEYONCÉ, her back now against the tree.\n\nBEYONCÉ (V.O.): With every tear came redemption.\n\nCut to BEYONCÉ and the woman tugging on either end of a rope, in a stalemate. Cut to a swathe of high grass. Fade to black.\n\nBEYONCÉ (V.O.): And my torturer became my remedy.\n\nCut to an extreme closeup of BEYONCÉ. She is staring through the camera, then closes her eyes, then opens them again.\n\nBEYONCÉ (singing V.O.): (I love...)\n\nCut to two woman in a garden. One is in the background, kneeling. The other is carrying a bucket full of vegetables. Cut to a rear view of the woman carrying the bucket of vegetables. The camera follows her as she walks out of the garden and into the yard.\n\nBEYONCÉ (V.O.): So we're gonna heal, we're gonna start again. You've brought the orchestra.\n\nCut to a rear view of three women. Two are sitting, wearing yellow dresses. One is standing, wearing a red dress. The camera slowly zooms in on the one wearing a red dress.\n\nBEYONCÉ (V.O.): Synchronized swimmers, you are the magician. Pull me back together again the way you cut me in half.\n\nCut to a closeup of a man and a woman, standing side by side.\n\nBEYONCÉ (V.O.): Make the woman in doubt disappear.\n\nCut to BEYONCÉ and six other women, sitting on a porch stoop.\n\nBEYONCÉ (V.O.): Pull the sorrow from between my legs like silk, knot after knot after knot.\n\nCut to a wide view of a sparse forest through which the setting sun can be seen.\n\nBEYONCÉ (V.O.): The audience applauds...\n\nCut to black.\n\nBEYONCÉ (V.O.): ...but we can't hear them.\nMUSIC CUE: \"ALL NIGHT\"Credits roll.\nMUSIC CUE: \"FORMATION\"[Click Here for Spoken Words Only]", "image": "https://images.genius.com/53c6c3f0a185fa0e583d005530bb7cc2.597x597x1.png"}], "artist": "Beyoncé"}