{"songs": [{"title": "Love Drought & Sandcastles (Live from the 2017 Grammy’s Awards)", "album": null, "year": null, "lyrics": "Pt. 1 Love Drought\n\n[Intro: Lemonade Speech]\nDo you remember being born?\nAre you thankful for the hips that cracked, the deep velvet of your mother\nAnd her mother and her mother?\n\nYou look nothing like your mother,\nYou look everything like your mother.\nYou desperately want to look like her.\nHow to wear your mother's lipstick\nYou must wear it like she wears disappointment on her face.\n\nYour mother is a woman,\nAnd women like her can not be contained.\n\nI think of lovers as trees\nGrowing to and from one another,\nSearching for the same light.\nWhy are you afraid of love?\nI think it's not possible for someone like you.\nBut you are the love of my life (the love of my life)\n\n[Verse]\nTen times out of nine, I know you‘re lying\nBut nine times out of ten, I know you're trying\nSo I'm trying to be fair\nAnd you're trying to be there and to care\nAnd you're caught up in your permanent emotions\nAll the loving I've been giving goes unnoticed\nIt's just floating in the air, lookie there\nAre you aware you're my lifeline, are you tryna kill me?\nIf I wasn't me, would you still feel me?\nLike on my worst day? Or am I not thirsty, enough?\nI don't care about the lights or the beams\nSpend my life in the dark for the sake of you and me\nOnly way to go is up, skin thick, too tough\n\n[Chorus]\nCause you, you, you, you and me could move a mountain\nYou, you, you, you and me could calm a war down\nYou, you, you, you and me could make it rain now (make it rain now)\nYou, you, you, you and me could stop this love drought\n\nPt. 2 Sandcastles\n\n[Intro: Lemonade Speech]\nIf we're gonna heal\nWe gonna start again,\nYou are the magician pulling me back together again,\nThe way you cut me in half.\n\nMake the woman in doubt disappear.\nHer heaven would be a love without betrayal.\nYou look nothing like your mother,\nYou look everything like your mother.\n\n[Verse]\nWe built sandcastles that washed away\nI made you cry when I walked away\nAnd although I promised that I couldn't stay, baby\nEvery promise don't work out that way\n\nAnd your heart is broken 'cause I walked away\nShow me your scars and I won't walk away\nAnd I know I promised that I couldn't stay, baby\nEvery promise don't work out that way, no no no no no\nEvery promise don't work out that way\n\n[Outro]\nThere is a curse,\nThat will be broken.\nOne thousand girls raise their arms.\nNow that reconciliation is possible,\nIf we gonna heal,\nLet it be glorious.", "image": "https://images.genius.com/995535bff9a0a15e5f1840990707d61d.399x399x1.jpg"}], "artist": "Beyoncé"}