{"songs": [{"title": "The Spot (Jail)", "album": "MTV’s Hip Hopera Soundtrack: Carmen", "year": "2002-01-01", "lyrics": "[Beyoncè]\nI live my life to the fullest\nParty every chance I get\nFriday nights, the Spot is the place i hit\nDecked out, chestout\nMe and my girls roll up at the Spot like we own the world\nYou should see the eyes on me, dress fittin like a prize on me\nHigh split , fellas get the rise on me\nJuss from the looks of it , I must say\nYa bound to get hooked , if you play\n\n[Mekhi]\nYour optomistic for someone goin to jail\n\n[Beyoncè]\nWould you stop being so damn stale\nI know you gotta girl but damn dont u wanna see new things\nSecurity shouldn't purchase a ring\n\n[Mekhi]\nSo why you lookin at me like that\nLike what u say is tru?\n\n[Beyoncè]\nI kno ya type I see through you\n\n[Mekhi]\nOh yea? What u see??\nCause I love my girl it ain't about security I give her the world\nShes down for and always has been\n\n[Beyoncè]\nAnd I would be too if I was your girlfriend\nBut Im not\nI even take ya too the Spot, bring sand to the beach, keep u on a leash\nI kno how most of these chicks could be\nSceemin and plottin on you like me\n\n[Mekhi]\nListen, you a little too hot for a guy like me\nMy girl is mo' like me she juss coo ya kno?\nNot a risk taker she just goes w/ the flow\n\n[Beyoncè]\nShes wack! Ya need a little spice in ya life\nLive a little you'll see what u want in a wife is in me\nI'm tellin you its like gold\nHard to let go, Harder to hold\nI'll dance wit ya slowly, too a hip-hop joint\nAnd only stop on a positive, you got the point?\n\n[Mekhi]\nI dont dance, i dont drink i dont like clubs im not impressed\nI dont smoke, only scrubs go to different places and fall for pretty faces\nTo me ya'll are all basic\n\n[Beyoncè]\nAnd ya life is wasted\nThats why u a cop\nYou never got to taste it if you had one drop\nYou wouldn't go back\nI'll prove it to you\nCome out wit me tonight, that'll do it for you!", "image": "https://images.genius.com/a21fc00220b7775c1c2cedae44552434.497x497x1.jpg"}], "artist": "Beyoncé"}