{"songs": [{"title": "Crazy In Love (Homecoming Live)", "album": "HOMECOMING: THE LIVE ALBUM", "year": "2019-04-18", "lyrics": "[Intro: Beyoncé & JAY-Z]\nCoachella, you ready?\nLet's go get 'em\nYes! So crazy right now!\nMost incredibly, it's your girl, yes, B\nHistory in the making\nPart two, it's so crazy right now\n\n[Verse 1: Beyoncé]\nI look and stare so deep in your eyes\nI touch on you more and more every time\nWhen you leave I'm begging you not to go\nCall your name two, three times in a row\nSuch a funny thing for me to try to explain\nHow I'm feeling and my pride is the one to blame\nYeah, I still don't understand\nJust how your love can do what no one else can\n\n[Chorus: Beyoncé]\nGot me looking so crazy right now\nYour love's got me looking so crazy right now (Your love)\nGot me looking so crazy right now\nYour touch got me looking so crazy right now (Your touch)\nGot me hoping you'll page me right now\nYour kiss got me hoping you'll save me right now\nLooking so crazy, your love's got me looking\nGot me looking so, looking so, looking so\n\n[Bridge: Beyoncé]\nDrop it\nOh oh, oh oh, uh oh, oh no no\nOh oh, oh oh, uh oh, oh no no\nOh oh, oh oh, uh oh, oh no no\nOh oh, oh oh, uh oh, oh no no\nOh oh, oh oh, uh oh, oh no no\nOh oh, oh oh, uh oh, oh no no\nOh oh, oh oh, uh oh, oh no no\n\n[Instrumental Interlude]\n\n[Verse 2: Beyoncé]\n(B)\nWhen I talk to my friends so quietly\n(\"Who he think he is?\")\nLook at what you did to me\nTennis shoes, don't even need to buy a new dress\nYou ain't there, ain't nobody else to impress\nIt's the way that you know what I thought I knew\nThe beat that my heart skips when I'm with you\nI still don't understand\nJust how your love can do what no one else can\n\n[Chorus: Beyoncé]\nGot me looking so crazy right now (Yeah)\nGot me looking so crazy right now (So, crazy)\nGot me looking so crazy right now (Your love)\nSo crazy right now, so crazy right now\nGot me looking so crazy right now (Hey)\nGot me looking so crazy right now (Hey)\nGot me looking so crazy right now (Coachella)\nSo crazy right now, so crazy right now (Y'all dance with me, come on)\n\n[Outro: JAY-Z]\nNigga, ask\nNigga, nigga, ask about me\nNigga, ask\nNigga, nigga, ask about me\nNigga, ask\nNigga, nigga, ask about me\nNigga, ask\nNigga, nigga, ask", "image": "https://images.genius.com/86527286e5623e09de9082461be09538.1000x1000x1.jpg"}], "artist": "Beyoncé"}