{"songs": [{"title": "If We", "album": "Glitter", "year": "2001-09-11", "lyrics": "[Intro: Mariah Carey & Ja Rule]\nI never thought (Who would've thought, baby?)\nThat I'd be (Missing you, baby)\nWithout you (I need you, baby)\nWhy me? (Why me?)\nI never thought (Who would've thought, baby?)\nThat I'd be (Missing you, baby)\nWithout you (I need you, baby)\nWhy me? (Why me?)\n\n[Verse 1: Ja Rule]\nLove, want your body next to me\nOr me actually off that ecstasy\nReminiscing how we used to smoke and freak\n(Fuck) and fall asleep, locking' for a week\nNow we barely even talk and walk the block\nKiss and cuddle up\nGirl, we're losing touch\nWhat's a man to do but go crazy, babe?\nI know you're mad but you don't really hate me, babe\nIt's deeper than that\n\n[Hook: Mariah Carey]\nAnd baby, if we got together again\nSugar, I would be your very best friend\n(I'd be your very best friend)\nI would love you unconditionally\nYou'll never want to let me go, baby\nI promise I will be by your side (side)\nI'll give you anything you need to get by\n(What you need to get by)\nThen my broken heart will finally mend\nBaby, if we got together again\n(Baby, if we got together again)\n\n[Verse 2: Nate Dogg]\nSometimes I close my eyes and just pretend\nWhat if I had a chance to do it all again?\nSometimes for happiness we hesitate\nJust like the game, I hear the love won't wait\nWhat if I had another best friend? (another best friend)\nWhat if I had someone on whom I could depend? (me)\nSomeone who makes me feel like you used to\nTell me, babe, what would you do?\n\n[Hook: Mariah Carey]\nAnd baby if we got together again\nSugar, I would be your very best friend\nI would love you unconditionally (I)\nYou'll never wanna let me go, baby (never)\nI promise I will be by your side (I promise I will be)\nI'll give you anything you need to get by\nThen my broken heart will finally mend\nBaby, if we got together again\nAnd baby if we got together again\nSugar, I would be your very best friend (If we got together)\nI would love you unconditionally\nYou'll never want to let me go, baby\nI promise I will be by your side (right by your side)\nI'll give you anything you need to get by\nThen my broken heart will finally mend\nBaby, if we got together again (Why me?)\n\n[Verse 3: Ja Rule]\nWhy would you wanna go\nThrough the pain of loving another man?\nThe truth is nobody can love you like I can\nIt's a damn shame we can't get along\nWe used to get it on, where'd it all go wrong?\nI admit the flesh is weak, but the game is strong\nWe go my way, your way, baby, we moving on\nIt's true, gon' miss you\nWho would've thought I'd be without you?\n\n[Bridge: Mariah Carey & Ja Rule]\nI never thought (Baby, there's nothin' to lose)\nThat I'd be (You know my soul's so cold)\nWithout you (And my love is pain)\nWhy me? Why me? (Spit it one more time)\nI never thought (My baby)\nThat I'd be (Pride and joy)\nWithout you (I'ma make you mine)\nWhy me? (No doubt, Rule)\nIf we got\n\n[Hook: Mariah Carey]\nAnd baby, if we got together again\nSugar, I would be your very best friend\n(I would be your very best friend)\nI would love you unconditionally (yes, I would, I would)\nYou'll never want to let me go baby\nI promise I will be by your side (I will be by your side)\nI'll give you anything you need to get by\nThen my broken heart will finally mend\nBaby, if we got together again\n(If we) And baby, if we got together again\n(If we) Sugar, I would be your very best friend\n(If we) I would love you unconditionally\nYou'll never want to let me go, baby\n(If we) I promise I will be by your side\n(If we) I'll give you anything you need to get by\n(If we) Then my broken heart will finally mend\n(If we) Baby, if we got together again\nBaby, if we got together again\nSugar, I would be your very best friend\nI would love you unconditionally\nYou'll never want to let me go, baby\nI promise I will be by your side\nI'll give you anything you need to get by\nThen my broken heart will finally mend\n\n[Outro]\n- So, don't you be getting all freaking on the first date\n- It's not a date!\n- It is a date. I gotta go. It is a date, people now that. Date!", "image": "https://images.genius.com/f8fe0fd38704974b77bbdbc032a5f12b.1000x1000x1.jpg"}], "artist": "Mariah Carey"}