{"songs": [{"title": "All I Want for Christmas Is You (So So Def Remix)", "album": "Greatest Hits", "year": "2003-10-03", "lyrics": "[Intro: Momma Wow, Bow Wow, & Jermaine Dupri]\nAlright Jermaine, it's time for Lil Bow Wow to go to sleep\nSanta Claus is gonna be here\nI ain't going to sleep\nWhy man?\nYou hear me?\nYeah, Bow Wow, you gotta go to sleep, man, Santa on his way, man\nI said bedtime!\nWhy y'all ain't going to sleep then?\nHa, ain't no damn Santa Claus\nExcuse me?\nIf he coming, I'ma see him when ya'll see him, ya heard? Holla, yeah\nI'm sayin' man, he just paged me, yo, you better go to sleep\nYeah, whatever\nHolla, child, you better holla yo butt to bed\nSo, so def\n\n[Verse 1: Mariah Carey & Jermaine Dupri]\nI don't want a lot for Christmas (Uh-uh)\nThere is just one thing I need (Haha) (And I)\nDon't care about presents (Uh)\nUnderneath the Christmas tree (Uh-huh)\nI don't need to hang my stocking (Yeah)\nThere upon the fireplace (C'mon) (Ah)\nSanta Claus won't make me happy\nWith a toy on Christmas day (Why's that?)\n\n[Chorus: Mariah Carey & Jermaine Dupri]\nI just want you for my own (Uh-huh)\nMore than you could ever know (Yeah)\nMake my wish come true (Say what?)\nBaby, all I want for Christmas is you (Haha, ah-hah)\nYou, baby (Yeah)\n\n[Verse 2: Mariah Carey & Jermaine Dupri]\nOh, oh, oh, I won't ask for much this Christmas (Uh-huh)\nI won't even wish for snow (Yeah) (And I)\nI'm just gonna keep on waiting (I'm gonna keep)\nUnderneath the mistletoe (I'm gonna keep waitin' by the mistletoe)\n(This Christmas we gon' dance)\nI won't make a list and send it (Ah, haha)\nTo the North Pole for Saint Nick (Whoa) (Ah)\nI won't even stay awake to hear those magic reindeer click (C'mon)\n\n[Chorus: Mariah Carey & Jermaine Dupri]\n'Cause I just want you here tonight (Me too)\nHolding on to me so tight (Yeah)\nWhat more can I do? (Make another wish, ooh)\nBaby, all I want for Christmas is you (Ah, ha)\nYou, baby (Let's slow it down)\n\n[Bridge: Mariah Carey & Jermaine Dupri]\nAll the lights are shining\nSo brightly everywhere (I like that) (And the sound)\nAnd the sound of children's laughter fills the air\n(I can feel it everywhere) (C'mon, uh)\nAnd everyone is singing (Uh oh) (Oh)\nI hear those sleigh bells ringing (I can hear them ringing) (Oh)\nSanta won't you bring me (Yeah) the one I really need (Oh) (Uh-huh)\nWon't you please bring my baby to me? (Oh)\n(Uh, uh, look out)\n\n[Verse 3: Mariah Carey & Jermaine]\nI don't want a lot for Christmas (Uh-huh)\nThis is all I'm asking for (What's that?) (Ah)\nI just want to see my baby (Uh) (I'm gonna keep)\nStanding right outside my door\n(I'm gonna keep waiting by the mistletoe)  (MC)\n\n[Chorus: Mariah Carey & Jermaine]\nOh, I just want you for my own (Uh-huh)\nMore than you could ever know (Yeah) (Baby, make my wish)\nMake my wish come true (Ha)\nBaby, all I want for Christmas is you (Is you)\n\n[Outro]\nAll I want for Christmas is you, baby (Is you, baby)\nAll I want for Christmas is you, baby (Uh, uh, is you, baby, uh)\nAll I want for Christmas is you, baby (Is you, baby, ya heard?)\nAll I want for Christmas is you, baby (Uh-huh, yeah, let's go)", "image": "https://images.genius.com/d231a94f0279b70680b1fe4643e590b0.355x355x1.jpg"}], "artist": "Mariah Carey"}