{"songs": [{"title": "Shake it Off (Remix)", "album": null, "year": "2005-07-12", "lyrics": "[Intro: Jay-Z (Young Jeezy)]\nUh, uh, uh, uh\nH-O-V and M.C. H-O-V Young Jeezy (YEAAHHHH)\nH-O-V and M.C. H-O-V Young Jeezy\nI know you all see how it's going down\nThe best in the business baby\nLive from the Oval Office\nLet's Get It!\n\n[Verse 1: Jay-Z]\nLadies and gentleman, it's Hov'\nBreak up is imminent, I know\nWhat's the sense of putting it off till tomorrow?\nPretending it is not going to end, let's roll\nGot to move baby, know its hell of hard\nYou got to find your groove baby like Stell-in-a\nThat is not you baby, got to let her do what it do baby\nShed a tear or two but don't get too crazy baby\nWhy are you behaving like it is not other fish\nIn the fish bowl for the disco, nigga let's go\nThe Emancipation of M-I-M-I, I spray ?Ra-mus? RA, RA\nTwenty worldwide nigga get your plaques\nGuess who the fuck got his swagger back\nShake them all, uh, shake them all, uh\nG4's and all we take off, uh we flawless mister\nI'm the boss, El Presidente, caliente\nCall me the other dog, so fuck all you all\nThe boy is back along with the voice is back\nM.C., shake them off\n\n[Verse 2: Mariah Carey]\n(Shake it off)\nBy the time you get this message, it's going to be too late\nSo don't bother paging me, because I'll be on my way\nSee I grabbed all my diamonds and clothes\nJust ask your momma she knows\nYou're going to miss me baby, hate to say I told you soooo\nWell at first I didn't know, but now it's clear to me\nYou would cheat with all your freaks and lie compulsively\nSo I packed up my Louis Vuitton\nJumped in your ride and took off\nYou'll never ever find a girl, who loves you more than me\n\n[Chorus]\nI got to shake it off - because the loving is not the same\nAnd you keep on playing games like you know I'm here to stay\nI got to sh-shake it off - just like the Calgon commercial, I -\nReally got to get, up outta here, and go somewhere\nI got to shake it off - got to make that move\nFind somebody who, appreciates all the love I give\nBoy, I got to sh-shake it off - got to do what's best for me\nBaby and that means I got to - shake it off\n\n[Chorus] [4X]\nI got to - shake, shake, shake, shake, shake it off\n\n[Bridge: Young Jeezy overlaps]\nYeah, you all ready know what it is man!\nA-Town's finest! What's cracking, M.C.?\nYoung Hov, what's good baby? Eh-eh\nLet's Get It\n\n[Verse 3: Young Jeezy (with his adlibs)]\nMake me imagine that\nFor real playgirl like I'm having that\nBronze on my tip can't shake them off\nTake her to the crib then I break them off\n[?] on my team cause she know that I'm a winner\nDrink Cris out the bottle, eat Popeye's for dinner\nLeft the coupe at the crib, scooped her up in the Chevy\nGot the top down and the bass beating heavy\nSee he-he spoils you me I ignore ya\nSh-shake ya off, don't answer ya phone calls\nYou say I'm tripping but me I call it tough love\nSo tell your friends you're in love with a straight thug\n[?] What's happening with you honey\nYoung Snowman chase nothing but some money\n\n[Verse 4: Mariah Carey]\nI found out about a gang of your dirty little deeds\nWith this one and that one by the pool, on the beach, in the streets\nHeard you all was Hold up my phone's breaking up\nI am hang up and call the machine right back\n(I got to get this of my mind)\nYou wasn't worth my time, so I'm leaving you behind[?]\nCause I need a real love in my life\nSave this recording because, I'm never coming back home\n[?]Baby I'm gone\nDon't you know\n\n[Chorus] [Bridge]", "image": "https://images.genius.com/36f3e90121545c0842978fbfff0ea1a0.1000x1000x1.jpg"}], "artist": "Mariah Carey"}