{"songs": [{"title": "Honey (So So Def Radio Mix) (featuring Da Brat and JD)", "album": "Butterfly", "year": null, "lyrics": "Mariah Carey (Da Brat):\nIf Jermaine likes it\n(He do)\nHa ha ha!\n(Ha, I do)\nThen I like it\n\nJermaine Dupri (Da Brat):\nYo, uh, uh\nYou know what? Y'all ain't ready for this\nStill scrambling from the damage of the last remix\n(Most of your stories bore me, Y'all love to lie\nTo my royalties be the glory\nMariah, honey be fly!)\nAh, me and B-R we are usually seen in hot spots jumpin' outta two seaters\n(We got money to make\nAnd many records to break)\nWe not similar to any so make no mistake\nListen\n\nMariah:\nOh, honey (So So Def)\nYou can have me, when you want me\nYou simply ask me to be there\nAnd you're the only one, who makes me come running\nCause what you got, is far beyond compare, ooh\n\nAnd it's just (just)\nLike (like)\nHoney (honey)\nWhen your love (uh huh) comes over me\nOh baby I've got a dependency, always strung out\nFor another taste of your honey (yeah, yeah)\nIt's like honey when it rushes over me\nYou know sugar never ever was so sweet\nAnd I'm dying for you, crying for you\nI adore you, one hit your love addicted me\nAnd I'm strung out on you, darling don't you see\nEvery night and day, I can hardly wait\nFor another taste of honey\nHoney I can't describe, how good it feels inside\nHoney I can't describe, how good it feels inside\n\nMC c'mon\nYeah, ooh\nOh, I can't be elusive with you honey\nCause it's blatant that I'm feeling you (say what)\nAnd it's too hard for me to leave abruptly\n'Cuss you're the only thing I wanna do\n\nJermaine Dupri:\nY'all be saying this and that\nBut y'all don't wanna see this new phenomenon\nThis Don Chi Chi\nIt's somethin' nasty\nWord to B.I.G\nI'm in it for life\nDead president for life\nAnd by the minute I get more nice\nI'm the J-E-R\nThe M-A-I\nN don't forget the E\nAnd she go by the unforgettable name\nOf the B\nTo the R\nTo the A\nTo the T\n\nDa Brat:\nI like colloso size pieces of rocks\nAnd getting pushed in the Bentley drop top\nUndefeated indefinitely\nAnd don't stop\nWe rock in all kinds of spots\nCalling all the shots\nAnd y'all knows how we get down\nMy beliefs is being dolla bill seeker\nAnd a Benjamin keeper\nDon't mind popping if y'all\nOr slow wind with some clown with\nSeven digit accounts\n\n[Jermaine Dupri x2:]\nThey say 'Hey, JD won't you play that song?\nKeep 'em dancing (dancing) all night long' (all night long)\nHey, JD won't you play that song?\nKeep 'em dancing (dancing) all night long' (all night long)\n\n(Honey, it's like...)\nIt's like honey when it rushes over me\nYou know sugar never ever was so sweet\nAnd I'm dying for you, crying for you (I need your love right now baby)\nI adore you, one hit your love addicted me\nAnd I'm strung out on you, darling don't you see\nEvery night and day, I can hardly wait\nFor another taste of honey (I need a taste of honey)\n\nIt's like honey when it rushes over me (I need it)\nYou know sugar never ever was so sweet\nAnd I'm dying for you, crying for you (oh honey, oh honey)\nI adore you, one hit your love addicted me (I need it)\nAnd I'm strung out on you, darling don't you see\nEvery night and day, I can hardly wait\nFor another taste of honey (honey)\n\nI need it, need it\nI need it, need it", "image": "https://images.genius.com/f9e30591b3620ce4e7d369afd9b008ad.1000x1000x1.jpg"}], "artist": "Mariah Carey"}