{"songs": [{"title": "One & Only", "album": "The Emancipation of Mimi", "year": "2005-04-12", "lyrics": "[Intro: Mariah Carey]\nI'm lookin' for my one and only\nEvery time I turn around\nI find my heart in pieces on the ground\nSo, so lonely\nI'm lookin' for my one and only\n\n[Verse 1: Mariah Carey]\nI'm riding home in pain again, baby\nBut that don't mean shit to you\nYou're currently engaged in an intimate conversation\nWith a young groupie or two\nThey say players only love you when they're playing games\nStill I gave my heart to you\nI should have stayed away-ay-ay-ay\nLike my friends all told me to\n\n[Chorus: Mariah Carey]\nEvery time I turn around\nI find my heart in pieces on the ground\nSo, so lonely\nI'm lookin' for my one and only\nEvery time I turn around\nI find my heart in pieces on the ground\nWhy can't I find my one and only?\n\n[Verse 2: Mariah Carey]\nSee, I'm looking for a man that'll rub me slow\nMake me sing real high when he goes down low\nBut see, it ain't just a physical thing\nHe's gotta treat me affectionately\nAnd I gotta know he won't betray my trust\nJust like every other motherfucker does\nIs this just an impossible dream, baby?\nToo elusive to pursue\nIt's been such a sad and windy road for me\nJust searchin' for the truth\n\n[Chorus: Mariah Carey]\nEvery time I turn around\nI find my heart in pieces on the ground\nSo, so lonely\nI'm lookin' for my one and only\nEvery time I turn around\nI find my heart in pieces on the ground\nWhy can't I find my one and only?\n\n[Verse 3: Twista & (Mariah Carey)]\nNow you know I'm rolling Beamer and a Benz\nAnd I'm dishing out ends\nWhy you hating on a play, baller?\nHaving better conversations while we rolling on twenty four\nAnd I know you got doubts\nWhy you listen to what people talk about?\nYou ain't figured out why they call you\nThe heifer steady hating 'cause you rolling on twenty four\nSee how you money flow\nYou dressed in designer clothes from head to the toe\nYou are not satisfied then tell me what you looking for?\n(Mariah Carey: I'm looking for my one and only)\nWell, I'll be your one and only\nIf you give me a chance, I'll make a change for you girl\nI know I am not been the most faithful nigga in the world\nBut let's stay together so we can shine like pearls\nSpending to a wallet, fill a Swisha with fire\nTo kiss you lips, I desire\nTwist and Mariah, together like a rim and a tire\n(I'm looking for my one and only)\nWell, come on Shorty let me make it better\nWe can do whatever, while we sitting on suede and leather\nFeeling through the city while we rolling chrome and\nLet's kick it in the Chi\nI know I messed up with you, I ain't gon' lie\nI knew you was feeling, you really know your guy\nBut baby girl, I ain't mean to blow your high\nLet me pick the pieces up and put them back together\n'Cause I want to be with you, don't wanna  leave you lonely\nRide with you like the homie, never no phony\nShorty, can I be your one and only?\n\n[Chorus until Fade: Mariah Carey]\nEvery time I turn around\nI find my heart in pieces on the ground\nSo, so lonely\nI'm lookin' for my one and only\nEvery time I turn around\nI find my heart in pieces on the ground\nWhy can't I find my one and only?", "image": "https://images.genius.com/3b1400674a0257ceef8198a8a335b3f8.1000x1000x1.jpg"}], "artist": "Mariah Carey"}