{"songs": [{"title": "Last Night a DJ Saved My Life", "album": "Glitter", "year": "2001-09-11", "lyrics": "[Intro: DJ Clue & Busta Rhymes]\nYeah, DJ Clue (yeah)\nDesert Storm (yeah), Fabolous (Flipmode)\nWith Wilma M. Holla (Busta Bus, alright)\nPay attention (Oh, oh, oh)\nLet's all form a line and focus (Yeah)\nYeah, yeah, yeah, yeah ha ha\n(I'm trying to save your life)\n\n[Verse 1: Fabolous]\nWe can do it in the mix\nI'll even raise the privacy shade if we do it in the six\nEverything his and hers\nI know you like sipping K, moving until your vision blurs\nExquisite furs, this preferred\nYou even got a set of keys to the Spiz in Jers\nGet your man that ain't promise\nI'm the kid that'll make sure you keep that tan from St. Thomas\nIt's no trouble at all\nSo you can imagine after I go double this fall\nMost this player can do is retire\nI know Gucci's newest attire\nAnd shoes is required\nI don't care who was your priors\nAny man saying he don't want you is a liar\nAll they can do is admire\nF-A-B-O-L-O-U-S, I do this, Mariah\n\n[Verse 2: Mariah Carey & Busta Rhymes]\nLast night a DJ saved my life (Come on, ha-ha)\nLast night a DJ saved my life, yeah\n'Cause I was sitting there bored to death\nAnd in just one breath (Come on)\nHe said you gotta get up (Gotta get up, gotta get up)\n(Yeah, just bounce around)\n(Just shake that shit and bounce around)\nYou gotta get on\nYou gotta get down girl\nYou know you drive me crazy, baby (M.C., Wilma)\nTurning to another man (Talk to him Wilma, talk to him Wilma)\nCalled you on the phone, no one's home (yeah, yeah)\n(Just shake and bounce around, come on)\nBaby, why you leave me all alone?\n(Just bounce around, yeah, just bounce around)\n(Just shake that shit and bounce around)\nAnd if it wasn't for the music, I don't know what I'd do\n(What cha' gonna do? Talk to me and let me see it, baby)\n(Come talk to me, ha, come talk to me)\n\n[Hook: Mariah Carey & Busta Rhymes]\nLast night a DJ saved my life ooh\n(Ha, shake that shit and bounce around)\nLast night a DJ saved my life from a broken heart (One time now)\nLast night a DJ saved my life\n(Yeah, where we going now, come touch me girl yeah, yeah, yeah)\nLast night a DJ saved my life with a song\n\n[Verse 3: Busta Rhymes & DJ Clue]\nYeah, here we go now come on\nShake that thing and come give it to me\n(DJ Clue!) Come on (Fabolous)\nShake that thing and come give it to me (Busta Rhymes)\nCome on, put your hands where my eyes can see (M.C.)\nCome on, shake that thing and come give it to me, come on\n(Come on!)\n\n[Verse 4]\nMariah Carey & (Busta Rhymes):\nYou know I hopped into my car\nDidn't get very far, no\nBecause I had you on my mind\nWhy be so unkind\n(Yeah, yeah talk to me my, Wilma where you at, come talk to me come on)\nYou've got your women all around\nAll around this town, boy\n(Ha ha, yeah just shake and bounce around)\n(Come on, yeah just bounce around come on)\nBut I was trapped in love with you\nAnd I didn't know what to do\n(Yeah, yeah pass that thing steaming over there)\n(And give me that bottle of that Henny over there)\nBut when I turned on the radio\nI found out all that I needed to know\n(Just shake and bounce around come on, yeah) Check it out\n(Just bounce around, come on)\n\n[Hook: Mariah Carey & Busta Rhymes]\nLast night a DJ saved my life\n(Whatcha' want now, what cha' want now)\nLast night a DJ saved my life from a broken heart, from a broken heart\n(From a broken heart, come on)\nLast night a DJ saved my life, last night\n(Whatcha' want now, what cha' want now)\nLast night a DJ saved my life with a song\n(Put your hands up high for me, come on)\nLast night a DJ saved my life\n(Whatcha' want now, what cha' want now)\nLast night a DJ saved my life from a broken heart (DJ Clue, M.C.!)\n(Put your hands up high for me, come on)\nLast night a DJ saved my life\n(Yeah, yeah, yeah)\nLast night a DJ saved my life with a song, with a song\n\n[Verse 5: Mariah Carey], (Busta Rhymes), DJ Clue\nHey, listen up to your local DJ\nYou better hear what he's got to say\n(Yeah, give it to em' Wilma, and we can rap just talk to me, come on)\nThere's not a problem I can't fix\nCause I can do it in the mix\nAnd if your man gives you trouble\nJust you move out on the double\nAnd don't let it trouble your brain\nCause away goes troubles down the drain\nI said away goes troubles down the drain\n(Yeah and where we going come on)\n(M.C. tell em' where we going come on) DJ Clue!\n(I make em' bounce in the truck, where we going, come on) Desert Storm!\n(Just pour a little of that Cris on the floor)\n(For all those who couldn't enjoy this moment) Wilma M.! Holla!\n(So special, so precious we gonna put the smackdown on all of y'all)\nYou know how we do babe!\n(Shaking your asses out there)\n(Busta Rhymes, M.C., Clue, Damizza, come on)\nLast night (Desert Storm!) a DJ saved my life\n(Put your hands where my eyes can see)\n(Come on shake that thing and come give it to me, come on)\nThere's not a problem that I can't fix\nCause I can do it in the mix (All my DJ's)\nThere's not a problem that I can't fix\nCause I can do it in the mix\n(In the mix now) In the mix (In the mix now) In the mix (In the mix now)\nIn the mix (In the mix now) In the mix (In the mix now) In the mix\n(In the mix now, put it down now) In the mix (In the mix now) In the mix\n(Busta Rhymes, Desert Storm in the mix now)\n(We got Damizza and M.C. in the mix now Wilma, Wilma)\nHey, last night a DJ saved (Flipmode come on)\nOoh (Ha, ha, ha, ha, ha) Mr. Clue-minati, In the mix In the mix\nIn the mix, In the mix now (Wilma M.)\n\n[Verse 6: Busta Rhymes] & (DJ Clue)\nShake that thing and come give it to me, come on\nShake that thing and come give it to me, come on (Damizza!)\nPut your hands where my eyes can see, come on\nGive me that bottle of that Henny over there\nShake that thing and come give it to me, come on\n(Fabolous, Busta Rhymes!)\nPut your hands where my eyes can see, come on\nShake that thing and come give it to me, come on (Come on man)\nJust shake and bounce around, come on yeah\nJust bounce around, come on\nJust bounce around\nJust shake that shit and bounce around (Willie D., Ali Baba)\nJust shake and bounce around\nYeah, just bounce around\nJust bounce around\nPut your hands where my eyes could see, come on\nShake that thing and come give it to me (Wilma M. Holla!)\nCome on, put your hands where my eyes can see\nShake that thing and come give it to me, come on (I'm C)\nHa, ha, ha, ha, ha (GMX)\nYeah, where you at now talk to me\nJust bounce around and come give it to me, come on\nTalk to me\nJust bounce around and come give it to me (DJ Clue, Desert Storm)\nTalk to me\nJust bounce around and come give it to me", "image": "https://images.genius.com/46c6b95e8b75a2890e01df1e66e6d08e.953x953x1.jpg"}], "artist": "Mariah Carey"}