{"songs": [{"title": "Heavenly (No Ways Tired / Can’t Give Up Now)", "album": "Me. I Am Mariah… The Elusive Chanteuse", "year": "2014-05-27", "lyrics": "[Spoken Intro]\nFolks will taking advantage of you because they believe you’re too weak to speak up for yourself\nYou don’t have to speak up for yourself\nBe still and let God fight your battles\nSomebody come and go with me, friend!\n\n[Verse 1]\nThere will be mountains that I will have to climb\nAnd there will be battles that I will have to fight\nBut victory or defeat, it's up to me to decide\nBut how can I expect to win if I never try?\n\n[Chorus]\nI just can't give up now\nCome too far from where I started from\nNobody told me the road would be easy\nAnd I don't believe He's brought me this far to leave me\n\n[Verse 2]\nNever said there wouldn't be trials\nNever said I wouldn't fall\nNever said that everything would go\nThe way I want it to go\nBut when my back is against the wall\nAnd I feel all hope is gone\nI'll just lift my head up to the sky\nAnd say, “Help me to be strong”\n\n[Chorus]\nI just can't give up now\nI've come too far from where I started from\nNobody told me the road would be easy\nAnd I don't believe He's brought me this far to leave me\n\n[Bridge]\nNo you didn't bring me out here to leave me lonely\nEven when I can't see clearly\nI know that you are with me, so I can’t\n\n[Chorus - Variation]\nOh, I just can't give up now\nCause I've come too far from where I started from\nNobody told me (nobody told me that the road would be easy)\nAnd I don't believe (don't believe)\nHe's brought me this far to leave me\n\nAnd I can't give up now\nYeah, just can't, oh\nCan't give up now\nSaid I've come too far from where I started from\nNobody told me (nobody told me that the road would be easy)\nAnd I don't believe (don't believe)\nHe's brought me this far to leave me\n\nI just can't give up now\nI've come too far from where I started from\nNobody told me the road would be easy (it's been a little rough but I don't believe)\nDon't believe, He's brought me this far to leave me (no no, no no)\n\nI can't give up now!\nI just can't give up now\nSaid I've come too far\nCome too far from where I started from\nNo one said it would be easy\nNobody told me the road would be easy\nAnd I don't believe\nHe's brought me this far to leave me\n\n[Outro]\nI don't feel no ways tired\n(Be still and let God fight your battles)\nI don't believe He's brought me this far (x8)", "image": "https://images.genius.com/6803b0f303b5bba84a9528acd118ff2c.800x800x1.jpg"}], "artist": "Mariah Carey"}