{"songs": [{"title": "Why You Mad? (Infinity Remix)", "album": null, "year": "2015-08-08", "lyrics": "[Intro: Mariah Carey]\nBut why? Why\n\n[Verse 1: French Montana]\nBaby why you mad? Go on, tell me why you're mad\nPackin' shit up in your bag and you're leavin' out the back\nAnd you hoppin' in that Benz truck, callin' all your friends up\nTwisted off the liquor, talkin' crazy, can't stand up\nTwisted off the vodka, drink some water\nAnd I'm goin' crazy tryna get my life in order\nEvery time we pull up all my dogs got their hood up\nI was tryna pull my hood up, got me ridin' with my hood up, Lord\nFrom the bottom to the top and you know it\nLeavin' one eye open, baby, like Fetty Wap\nWe be grindin' to the top, we never folding\nBad bitches, they be callin', European cars rollin'\n\n[Pre-Chorus: Mariah Carey]\nWhy you mad? Talkin' 'bout you're mad\nCould it be that you just lost the best you've ever had?\nThat’s your bad, yup, that’s too bad\nShow is over, you ain’t gotta act\n\n[Chorus: Mariah Carey]\nClose the door, lose the key\nLeave my heart on the mat for me\nI was yours eternally, there’s an end to infinity\nTo infinity, to infinity\n\n[Verse 2: Justin Bieber]\nIt's like every time you call me, you know I can't leave you lonely\nCause I was always there when you need me, you said that you'd be there 'til the end\nWhat must I say? I never thought it would happen this way\nBut I can tell you're down again, yeah and I'mma fall, stayin' to the end\n\n[Chorus: Mariah Carey]\n\n[Verse 3: T.I.]\nYeah, it started fuck you and your opinion, my heart cold, got no feelin'\nTurnt up, got no ceilin', can't come down, no thank you\nI know I'm no angel and I don't know why I go straight to danger\nCan't explain it, lil suspicion done drove her crazy\nAnd now she goin' through my phone, shit doin' what she wants\nYou're surely delusional, losin' your mind right now but I bet you'll miss me when I'm gone\nGet the fuckin' with the suckas if you want, you finna go out back, know I had it and lost it\nKnow I'm mad, but hold up how you know I'm mad though?\n\n[Bridge: Mariah Carey + French Montana]\nBaby why you mad? Go on, tell me why you're mad\nPackin' shit up in your bag and you're leavin' out the back\nBaby why you mad? Go on, tell me why you're mad\nPackin' shit up in your bag and you're leavin' out the back\nBaby why you mad? Go on, tell me why you're mad\nBaby why you mad? Go on, tell me why you're mad\nPackin' shit up in your bag and you're leavin' out the back\n\n[Outro: Mariah Carey]\nWhy you mad?\nOh baby I wanna know", "image": "https://images.genius.com/9f3015743a178fe7f8cc8827121c4c1b.640x640x1.png"}], "artist": "Mariah Carey"}