{"songs": [{"title": "Latin Car Ride Medley", "album": null, "year": "2016-11-08", "lyrics": "[I Know What You Want]\nBaby, if you give it to me, I'll give it to you\nI know what you want, you know I got it\nBaby, if you give it to me, I'll give it to you\nAs long as you want, you know I got it\n(Baby, if you give it to me, I'll give it to you)\n(I know what you want, you know I got it)\n(Baby, if you give it to me, I'll give it to you)\n(As long as you want, you know I got it)\n\nYes you know I'll die for you\nAnd ya know I'll ride with you\nI will always try with you\nAnd give ya my love and cry with you\n\nI will climb a mountain high aha\nUntil I was up to touch the sky\nSo baby come and get more close to me\nThis is where your love is supposed to be\n\n[Honey]\nBreakdown\nUh, uh, every little thing you do\n(Now what we going to do right here)\n(We going to smooth it out, come on)\nUh, uh, honey, got me hooked on you\n(MC, and she won't stop)\n\n[Breakdown]\nBreak, breakdown, steady breaking me on down\nBreak, breakdown, steady breaking me on down\nBreak, breakdown, steady breaking me on down\nBreak, breakdown, steady breaking me on down\n\nYou called yesterday\nTo basically say\nThat you care for me but\nThat you're just not in love\nImmediately I pretended to be feeling similarly\nAnd led you to believe I was OK\nTo just walk away from the one thing\nThat's unyielding and sacred to me\n\nWell, I guess I'm trying to be nonchalant about it\nAnd I'm going to extremes to prove I'm fine without you\nBut in reality I'm slowly losing my mind\nUnderneath the guise of smile, gradually I'm dying inside\nFriends ask me how I feel and I lie convincingly\nBecause I don't want to reveal the fact that I'm suffering\nSo I wear my disguise 'till I go home at night\nThen turn down all the lights and then I breakdown and cry\n\n[Obsessed]\nAnd I was like\n\"Why are you so obsessed with me?\"\n\nWhy you so obsessed with me? Boy, I wanna know\nLying that you're sexing me, when everybody knows\nIt's clear that you're upset with me\nFinally found a girl that you couldn't impress\nLast man on the earth still couldn't get this\n\nSo oh, oh, oh, oh, so oh, oh, oh, oh, so oh, oh, oh, oh...\n\nAll up in the blogs saying we met at the bar\nWhen I don't even know who you are\nSaying we up in your house, saying I'm up in your car\nBut you in LA, and I'm out at Jermaine's\nI'm up in the A, you so so lame\nAnd no one here even mentions your name\nIt must be the weed, it must be the E\nCause you be popping, heard you get it popping\n\nWhy you so obsessed with me? Boy, I wanna know\nLying that you're sexing me, when everybody knows\nIt's clear that you're upset with me\nFinally found a girl that you couldn't impress\nLast man on the earth still couldn't get this\n\nYou're delusional, you're delusional\nBoy, you're losing your mind\nIt's confusing, yo, you're confused, you know\nWhy you wasting your time?\nGot you all fired up with your Napoleon complex\nSeeing right through you like you're bathing in Windex\n\nOh, oh, oh, oh\nBoy, why you so obsessed with me?\n\n[It's Like That]\nI came to have a party\nOpen off the Bacardi\nFeeling so hot tamale\nBoy, I know you watching me\nSo what's it going to be?\nPurple taking me higher\nI'm lifted and I like it\nBoy, you got me inspired\nBaby, come and get it\nIf you're really feeling me\n\nCause it's my night\nNo stress, no fights\nI'm leaving it all behind\nNo tears, no time to cry\nJust making the most of life\n\n[Loverboy]\nI wanna, I wanna, I wanna, I wanna\nI need a, I need a, I need a, I need a\nI lover, lover, I lover, lover\nA lover, a lover, a lover, a loverboy for me\n\nI got myself a lover who knows what I like\nWhen he invites me over I come every time\nAnd when my sugar daddy takes me for a ride\nWhatever way we go it's delirium time\n\nHe's all mine\nAnd his loving gets me high\nLike a taste of ecstasy\nAll I need is him to be my loverboy\n\nLoverboy, come on and love me\nGive me more, touch me and touch me\nI enjoy the way you rock me all night long\nLoverboy, come on and take me\nOnly you know how to make me\n(You know how to make me)\nShudder with anticipation all night long", "image": "https://images.genius.com/166d034d5ae37d93c67dc946f0b83dd6.680x401x1.jpg"}], "artist": "Mariah Carey"}