{"songs": [{"title": "Thirsty (Remix)", "album": null, "year": "2014-05-13", "lyrics": "[Produced by Hit-Boy, Mariah Carey & Rey Reel]\n\n\n[Intro]\nUhm, you thirsty (x8)\nYou boo-boo, you T'd, you turned down, you thirsty, you boo-boo[x4]\n\n[Verse 1: Mariah Carey]\nChasing them bright lights, even change your name\nSay you my boss now, ain't nothing out your range\nWell, almost anything\n\n[Pre-Chorus]\nYou used to be Mister-all-about-we\nNow you’re just thirsty for celebrity\nBest thing that happened to your ass was me\nPull down them Tom Fords, and act like you see\n\n[Chorus]\nYou thirsty for a dream leaving me drowning\nBoy, there ain't no SOS\nFilled with discontent\nFinding you can’t quit\nWhy you try so damn hard?\n\n[Bridge]\nUhm, you thirsty (x8)\nYou boo-boo, you T'd, you turned down, you thirsty, you boo-boo![x4]\n\n[Verse 3: Rich Homie Quan]\nSomebody get this girl a glass water\nI say she six nickels, not a dime, past a quarter\nHer daddy question me why she thirsty nigga ask your daughter\nBack up off me, you look a little salty\nSo thirsty, should drink coffee\nAnd you ain't really gotta keep hitting my phone\nI see every message\nTexting me asking where I'm going, baby girl, stop stressin'\nThen I walked in like the man of the year\nWith these thirsty girls in my section\nThese thirsty girls want a blessin'\nGet wet, you won't get this shit from me\nNo defense, but you can get the D\nNo sequel, it's only one of me\nThat thirsty bitch just slit my tires, it got me on fire\nRich Homie Quan times Mariah - sing!\n\n[Bridge]\nBoss now, you tryna be a boss now, thinking you a boss now\nBoy, you just fuckin' thirsty\nBoss now, you tryna be a boss now, thinking you a chief now\nBoy, you just fuckin' thirsty\n\n[Outro]\nSee your name in lights, and dream of fancy cars\nLike superstars, you don’t know who you are\nThat VIP too far for you to see\nOutside the club adding me constantly\nCan’t get the real math, yeah yeah\nCause boy, you’re thirsty, yeah yeah", "image": "https://images.genius.com/faccb763fe76311b50fa7fc582a28581.350x350x1.jpg"}], "artist": "Mariah Carey"}