{"songs": [{"title": "We Belong Together (Remix)", "album": "The Emancipation of Mimi (Ultra Platinum Edition)", "year": "2005-11-15", "lyrics": "[Intro: Mariah Carey & DJ Clue]\nWhen you left, I lost a part of me\nIt's still so hard to believe\nCome back, baby, please, 'cause we belong together\nHaha, remix, Desert Storm\n\n[Verse 1: Jadakiss & (Styles P.)]\nUh, yo, show your respect whenever you hear me or see me\n(This is the emancipation of Mimi)\nHot like the real fever, the real diva\nSo successful, yet still so eager\nNo matter what they say, it's on forever\n(It's our time right now) more than ever\n(To the death) we gon' get it on together\nAnd M-C, you know we belong together\n\n[Chorus: Mariah Carey]\nI lost a part of me\nWhen you left boy, can't you see?\nBoy, come back, baby, please, 'cause we belong together\nWho I gon' lean on when times get rough?\nWho's gon' to talk to me till the sun comes up?\nWho's gon' take your place, there ain't nobody there\nOh, baby, baby, we belong together\n\n[Verse 2: Mariah Carey]\nI only think of you on two occasions\nThat's day and night\nI'd go for broke if I could be wit you\nOnly you can make it right, make it right, make it right\n\n[Verse 3: Styles P. & (Jadakiss)]\nWe belong together like the sun in the summertime\nBounce in a lemon range (Skip in a hummer lime)\n(P and kiss, in and out) Mariah on the other line\nBaby, I'ma come back (Believe it'll come a time)\n(We belong together like peanut butter and jelly)\nFebruaries and skellies, after parties and tellies\n(Feeling you in my stomach like you a part of my belly)\nBaby, I'ma come back with every part of you ready\n\n[Chorus: Mariah Carey]\nI lost a part of me\nWhen you left boy, can't you see?\nBoy, come back, baby, please, 'cause we belong together\nWho I gon' lean on when times get rough?\nWho's gon' to talk to me till the sun comes up?\nWho's gon' take your place, there ain't nobody there\nOh, baby, baby, we belong together\n\n[Verse 4: Mariah Carey & (Jadakiss)]\nI can't sleep at night when you are on my mind\nBobby Womack's on the radio singing to me\nIf you think you're lonely now, wait until tonight\nBoy, I'm feeling all out of my element\nThrowing things, crying, trying to figure out where the hell I went wrong\nThe pain reflected in this song, ain't even half of what I'm feeling inside\nI need you, need you back in my life, baby (let's go)\n\n[Verse 5: Styles P. & (Jadakiss)]\nYou gonna need a shoulder to cry on\nClassic Mustang Cobra to ride on\nPast is the past, just let it be bygone's\nMatter of fact, I know a fly song that we could vibe on\nLet's get it straight\nIf it's the six or the quarter to eight\n(Then I'm throwing Babyface or Shy on)\nYeah and Kiss, Ghost and MC\nGet close and toast to the diva and MC's\n(Uh, the trees will blow)\n(Big cups, Pino Grigio) Take it easy, you\n(We belong together, we know that)\n(Now I think that it's 'bout time we show that)\n(Even though every moment won't be a Kodak) naw\n(Sometimes we argue, I spaz out, grab my bozak)\n(Come back not because I have to, I want to)\n(And naw, I don't just want to have you, I want you, uh)\n\n[Chorus: Mariah Carey]\nI lost a part of me\nWhen you left boy, can't you see\nBoy, come back, baby, please, 'cause we belong together\nWho I gon' lean on when times get rough?\nWho's gon' to talk to me till the sun comes up?\nWho's gon' take your place, there ain't nobody there\nOh, baby, baby, we belong together\n\n[Outro: DJ Clue & (Mariah Carey)]\nThis is, Desert Storm remix, ha ha (We belong together)\n(Oh baby, baby, we belong together)\nDJ Clue, Desert Storm (Oh, come back baby please)\n(We belong together) MC\n(Come back, baby. please) Woo\nIs it so hard to believe (we belong together)\nWe back, baby\n(We belong together)", "image": "https://images.genius.com/9e386d599b2e721466664c684e66be42.1000x1000x1.jpg"}], "artist": "Mariah Carey"}