{"songs": [{"title": "Up Out My Face (Remix)", "album": null, "year": "2010-01-26", "lyrics": "[Intro: Mariah Carey & Nicki Minaj (Spoken)]\nIt's not chipped, we're not cracked\nOh, we're shattered\nMariah... Hey-ey\nYoung Money! Hey-ey\nNicki Minaj! Hey-ey\nYou're such a Barbie!\n\n[Verse 1: Nicki Minaj]\nYo, Mariah I was in them million dollar meetings, he was cheatin'\nAll up in the church, he was sneaking with the deacon\nCats away, well the mice'll play\nLOL, smiley face, have a nice day\nCause pop, pop, pop, there goes my rubber band\nSo stop, stop, stop sniffing that contraband\nCause you was penny pinching, my accounts laced\nAttention! About face\n\n[Verse 2: Mariah Carey]\nI thought we had something special, like we had something good\nBut I should have had another mechanic under my hood\nIf you see me walking by you, boy, don't you even speak\nPretend you on the sofa and I'm on the TV\nMight see me on a poster, see me at a show\nBut you won't see me for free, boy, this ain't no promo\n\n[Bridge]\nIn all shame now\nWhere ever you been laying, you can stay now\nGotta board the BBJ and pull the shades down\nI'm on the plane now\nAnd don't keep calling from your mama's house\n\n[Chorus]\nWhen I break, I break boy\n[Up out my face boy] [x4]\nWhen I break\n[Up out my face boy] [x4]\nWhen I break\n\n[Verse 3]\nYou ain't never gonna feel this thing again\nYou gon' get alot of calls cause I CC-ed all your friends\n(Laugh)\nI ain't walking around no more\nFeeling sad, that ain't even my bad baby\nI break, when I break, I break\nMariah\n\n[Verse 4]\nSo look who's crying now, boo-hoo-hoo\nTalking 'bout you missing your boo, hoo-hoo\nOh, no, you ain't getting it\nI know you ain't hitting it\nNo, you ain't a rapper, so you need to stop spitting it\nHa ha ha ha ha\nYou wondering who I'm messing while you ain't next to me\nHa ha ha ha ha\nSo pay the consequences cause you acted all ignorant\n\n[Bridge]\nIn all shame now\nWhere ever you been laying, you can stay now\nGotta board the BBJ and pull the shades down\nI'm on the plane now\nAnd don't keep calling from your mama's house\n\n[Verse 5: Nicki Minaj]\nYo, styling on them big B's, bought the Benz out\nElevator, press P for the penthouse\nTop doe's, then we break like tacos\nRoscoe's, on his knees with a snot-nose\nThey be like, \"She next!\", Kawasaki T-Rex\nGive em' some Kleenex, match his little V-Necks\nOh, that's what he left? Let his mama pick it up\nMight back up on it, VROOM VROOM, with the pick-up truck\nThat blue and yellow, yeah, that's the Carmelo Jag\nI bob and weave em', hit em' wit that Mayweather jab\nI get the thumbs up like I'm hailing a yellow cab\nMy flow nuts like M&M's in the yellow bag\nMariah\n\n[Verse 6]\nWhen I break I break I break\nAnd no super glue can fix this shit\nWhen I break I break I break\nNot even a welder and a builder could rebuild this shit\nWhen I break I break I break\nNot even a nail technician with a whole lot of gel and acrylic\nCan fix this when I break, I break\nIf we were two Lego blocks\nEven the Harvard University graduating class of 2010\nCouldn't put us back together again\nWhen I break [Laughs]\nUp out my face boy\n\n[Verse 7: Nicki Minaj in the background]\nBetter go back to you mama's house\nI told you, I put, I put his stuff on the sidewalk\nI will roll over every nook and cranny with a pickup truck like\nLike straight up and down I am Nicki Minaj can't say \"ask about me\"\nYoung Money", "image": "https://images.rapgenius.com/cdc82ac85b459918a42d2d7f8b61ad88.1000x1000x1.jpg"}], "artist": "Mariah Carey"}