{"songs": [{"title": "All I Want for Christmas Is You (Live at the Cathedral of St. John The Divine", "album": "Merry Christmas (Deluxe Anniversary Edition) ", "year": "2019-11-01", "lyrics": "[Intro]\nI don't want a lot for Christmas\nThere is just one thing I need\nI don't care about the presents\nUnderneath the Christmas tree\nI just want you for my own\nMore than you could ever know\nMake my wish come true\nAll I want for Christmas is you, yeah\n\n[Verse 1]\nI don't want a lot for Christmas\nThere is just one thing I need (And I)\nDon't care about the presents\nUnderneath the Christmas tree\nI don't need to hang my stocking\nThere upon the fireplace (I)\nSanta Claus won't make me happy\nWith a toy on Christmas Day\n\n[Chorus]\nI just want you for my own (Ooh, ooh, ooh)\nMore than you could ever know (Oh, oh, oh)\nMake my wish come true\nAll I want for Christmas is you\nYou, baby\n\n[Verse 2]\nOh, I won't ask for much this Christmas\nI won't even wish for snow (And I)\nI'm just going to keep on waiting\nUnderneath the mistletoe\nAnd I won't make a list and send it\nTo the North Pole for Saint Nick (I)\nI won't even stay awake to\nHear those magic reindeer click\n\n[Chorus]\n'Cause I just want you here tonight (Ooh, ooh, ooh)\nHolding on to me so tight (Oh, oh, oh)\nWhat more can I do?\nOh baby, all I want for Christmas is you\nYou, you, baby\n\n[Bridge]\nOh, all the lights are shining\nSo brightly everywhere\nAnd the sound of children's (Ooh)\nLaughter fills the air (Oh, oh)\nAnd everyone is singing (Ah)\nI hear those sleigh bells ringing (Yeah, oh)\nSanta, won't you bring me the one I really need? (Yeah, oh, oh)\nWon't you please bring my baby to me? Yeah\n\n[Verse 3]\nOh, I don't want a lot for Christmas\nThis is all I'm asking for (Ah)\nI just want to see my baby\nStanding right outside my door\n\n[Chorus]\nOh, I just want you for my own (Ooh)\nMore than you could ever know (Oh, oh)\nMake my wish come true\nOh baby, all I want for Christmas is\n\n[Outro]\nYou (You, baby, all I want for Christmas is you, baby)\nYou, you, you, you, you\nAll I want, all I really want is (All I want for Christmas is you, baby)\nAll I want, all I really want is (All I want for Christmas is you, baby)\nYou, you, you, you (All I want for Christmas is you, baby)\nAll, all (All I want for Christmas is you, baby)\nYou, you, you, you (All I want for Christmas is you, baby)\nYou, you, you (All I want for Christmas is you, baby)\nIs you baby\nAll I want, all I really want is, all I really want is (All I want for Christmas is you, baby)\nYou\n\n[Spoken]\nThank you", "image": "https://images.genius.com/d3fab1c64f6eaeb9cf8b00f2df7133fa.680x680x1.jpg"}], "artist": "Mariah Carey"}