{"songs": [{"title": "Gorilla (G-Mix)", "album": null, "year": "2013-11-12", "lyrics": "[Verse 1: Pharrell]\nYuh, it's 4am and you are up getting fucked up\nAnd what a world it is all girls, I'm in luck\nSay hello to your sisters and let's try some yoga\nI'm yoda, it's cold, but let's get it poppin' like soda\nOne will make a bridge and two will make a pose up\nOne will do the down dog and I will be the cobra\nIt's NERD where the party is never sorry, no, illa\nI take'em to the head, now to the bed, said the red gorilla\n\n[Verse 2: Bruno Mars]\nOoh I got a body full of liquor with a cocaine kicker and I'm feeling like I'm thirty feet tall\nSo lay it down, lay it down!\nYou got your legs up in the sky with the devil in your eyes, let me hear you say you want it all\nSay it now, say it now!\n\n[Pre-Chorus: Bruno Mars]\nLook what you're doing, look what you've done\nBut in this jungle you can't run\nCause what I got for you\nI promise it's a killa\nYou'll be banging on my chest, bang bang; gorilla\n\n[Chorus: Bruno Mars]\nOoh, yeah\nYou and me baby making love like gorillas\nOoh, yeah\nYou and me baby making love like gorillas](2703689)\n\n[Verse 3: R. Kelly]\nI'm like a anaconda in your garden\nBaby girl, I'm explorin'\nDeep down in your forest like\n(Oooh oooh oooh aaah aaah aaah)\nHey, we got it hotter than an amazon\nGotcha cheetah bra with your heels on\nAnd I'm about to be the king of your jungle like\n(Oooh oooh oooh aaah aaah aaah)\nYeah, yeah\n\n[Pre-Chorus: R. Kelly]\nHey, it's like a rain forest, baby, how I got your love pouring down\nAnd I'ma make that pussy growl\nCause what I got for ya, girl, I promise, it's a killa\nYou'll be banging on my chest, bang bang; gorilla\n\n[Chorus: Bruno Mars]\nOoh, yeah\nYou and me baby making love like gorillas\nOoh, yeah\nYou and me baby making love like gorillas](2703689)\n\n[Bridge: Bruno Mars (& R. Kelly)]\nI bet you never ever felt so good, so good\nI got your body trembling like it should, it should\nYou'll never be the same baby once I'm done with you-you-you-you-you\n\nI'm gonna be your gorilla\nWe'll be making love like gorillas\nBaby, I'ma be your gorilla\n\nOh, you with me, baby\nMaking love like gorillas\nAnd I'll be going ape on you, baby\nUh, all up on you and the floor is going crazy, yeah\n\nYou and me, baby, we'll be fuckin' like gorillas\nYeaah, yeaah, yeaah, yeaah, yeaah\nBaby, yeaah, baby, yeaah, aaww yeaah\n\nYou and me, baby, making love like gorillas\nYeah, mmm\nMaking love like gorillas", "image": "https://images.genius.com/bd815e8b1951bf94f9504ba5a77ab614.1000x1000x1.jpg"}], "artist": "Bruno Mars"}